module.exports =
[
  { "id": 0,
    "albumName": "Ready to Die",
    "albumYear": "1994",
    "albumDescription": "Ready to Die is the debut studio album by American rapper The Notorious B.I.G.; it was released on September 13, 1994, by Bad Boy Records. The label's first release, the album features production by Bad Boy founder Sean \"Puffy\" Combs, Easy Mo Bee, Chucky Thompson, DJ Premier and Lord Finesse, among others. Recording for the album took place during 1993 to 1994 at The Hit Factory and D&D Studios in New York City. The partly autobiographical album tells the story of B.I.G.'s experiences as a young criminal. Ready to Die is his only studio album released during his lifetime, as he was murdered just days prior to the release of his second album, Life After Death (1997).",
    "artistId": 0,
  },
  {
    "id": 1,
    "albumName": "Conspiracy",
    "albumYear": "1995",
    "albumDescription": "Conspiracy is the debut studio album by American hip hop group Junior M.A.F.I.A. (Including The Notorious B.I.G., Lil' Cease, Trife and Larceny of The Snakes, Lil' Kim, Nino Brown, Chico Del Vec, Kleptomaniac, Capone, Bugsy). It was released on August 29, 1995 by Undeas Recordings and Big Beat Records. The album debuted at number 8 on the US Billboard 200, selling 69,000 copies in its first week.[1] The album is now out of print.",
    "artistId": 0,
  },
  {
    "id": 2,
    "albumName": "Life After Death",
    "albumYear": "1997",
    "albumDescription": "Life After Death is the second studio album by the American rapper The Notorious B.I.G., released on March 25, 1997, on Bad Boy Records. A double album, it was released posthumously following his death on March 9, 1997. It features collaborations with guest artists such as 112, Jay-Z, Lil' Kim, Mase, Bone Thugs-n-Harmony, Too $hort, Angela Winbush, D.M.C. of Run-D.M.C., R. Kelly, The LOX and Puff Daddy. Life After Death exhibits The Notorious B.I.G. further delving into the mafioso rap subgenre. The album is a sequel to his first album, Ready to Die, and picks up where the last song, \"Suicidal Thoughts\", ends.",
    "artistId": 0,
  },
  {
    "id": 3,
    "albumName": "Born Again",
    "albumYear": "1999",
    "albumDescription": "Born Again is the first posthumous album by The Notorious B.I.G. It was released on December 7, 1999. It is composed primarily of early recorded verses with newer beats and guest rappers.",
    "artistId": 0,
  },
  {
    "id": 4,
    "albumName": "The College Dropout",
    "albumYear": "2004",
    "albumDescription": "The College Dropout is the debut studio album by American hip hop artist Kanye West, released February 10, 2004, by Roc-A-Fella Records. It was recorded over a period of four years, beginning in 1999. Prior to the album's release, West had received praise for his production work for artists such as Jay-Z and Talib Kweli, but faced difficulty being accepted as a recording artist in his own right by figures in the music industry. Nonetheless intent on pursuing a solo career, it was several years before West finally received a record deal from Roc-A-Fella Records.",
    "artistId": 1,
  },
  {
    "id": 5,
    "albumName": "Late Registration",
    "albumYear": "2005",
    "albumDescription": "Late Registration is the second studio album by American hip hop producer and rapper Kanye West, released on August 30, 2005, by Roc-A-Fella Records and Def Jam Recordings. It was recorded over the course of a year in sessions held across studios in New York City and Hollywood, with West collaborating with American record producer and composer Jon Brion. The album features guest contributions from Adam Levine, Lupe Fiasco, Jamie Foxx, Common, Jay-Z, Brandy, and Nas, among others. Its production was notably more lush and elaborate than West's 2004 debut album The College Dropout, as he utilized intricate sampling methods and string orchestration with Brion. West's lyrics explore both personal and political themes, including poverty, drug trafficking, racism, healthcare, and the blood diamond trade.",
    "artistId": 1,
  },
  {
    "id": 6,
    "albumName": "Graduation",
    "albumYear": "2007",
    "albumDescription": "Graduation is the third studio album by American hip hop recording artist and record producer Kanye West. It was released on September 11, 2007, by Roc-A-Fella Records. Recording sessions for the album took place during 2005 to 2007 at Chung King Studios and Sony Music Studios in New York City and at Chalice Studios and The Record Plant in Los Angeles. It was primarily produced by West himself, with contributions from DJ Toomp, as well as Mike Dean, Nottz, Brian \"All Day\" Miller, Eric Hudson, Warryn Campbell, Gee Roberson, Plain Pat and Jon Brion. It features guest contributions from artists, including Mos Def, Dwele, T-Pain, Lil Wayne, DJ Premier and Chris Martin of Coldplay. The album's cover artwork was designed by Japanese contemporary artist Takashi Murakami.",
    "artistId": 1,
  },
  {
    "id": 7,
    "albumName": "808s & HeartBreak",
    "albumYear": "2008",
    "albumDescription": "808s & Heartbreak is the fourth studio album by American recording artist Kanye West, released on November 24, 2008, by Roc-A-Fella Records. It was recorded during September and October 2008 at Glenwood Studios in Burbank, California and Avex Recording Studio in Honolulu, Hawaii, with the help of producers No I.D., Jeff Bhasker and others.",
    "artistId": 1,
  },
  {
    "id": 8,
    "albumName": "My Beautiful Dark Twisted Fantasy",
    "albumYear": "2010",
    "albumDescription": "My Beautiful Dark Twisted Fantasy is the fifth studio album by American hip hop producer and rapper Kanye West, released on November 22, 2010, by Roc-A-Fella Records. Following a period of public and legal controversy, West retreated to a \"self-imposed exile\" in Hawaii in 2009. There, he worked on the album in a communal recording environment that involved numerous contributing musicians and producers. The album features guest appearances from Bon Iver, Jay Z, Pusha T, Rick Ross, Kid Cudi, Nicki Minaj, John Legend and more. Production is led by West himself, alongside a variety of high-profile record producers including Mike Dean, No I.D., Jeff Bhasker, RZA, S1, Bink and DJ Frank E. Noted by critics for its maximalist aesthetic, opulent production quality, and dichotomous themes, My Beautiful Dark Twisted Fantasy incorporates aspects of West's previous works, including soul, baroque, electro, and symphonic styles. The album deals with themes of excess and celebrity, and explores such issues as consumer culture, race, and the idealism of the American Dream.",
    "artistId": 1,
  },
  {
    "id": 9,
    "albumName": "Yeezus",
    "albumYear": "2013",
    "albumDescription": "Yeezus is the seventh studio album by American rapper Kanye West. It was released on June 18, 2013 by Def Jam Recordings.[1] West gathered a number of artists and close collaborators for production on the album, including Mike Dean, Daft Punk, Noah Goldstein, Hudson Mohawke, Arca, Che Pope, Brodinski, Gesaffelstein and Travis Scott. Yeezus also features guest vocals from Justin Vernon, Chief Keef, Kid Cudi, Assassin, King L, Charlie Wilson and Frank Ocean. Fifteen days before its release date, West enlisted the help of producer Rick Rubin to strip down the record's sound in favor of a more minimalist approach.",
    "artistId": 1,
  },
  {
    "id": 9,
    "albumName": "The Life of Pablo",
    "albumYear": "2016",
    "albumDescription": "The Life of Pablo is the seventh studio album by American rapper Kanye West. It was released on February 14, 2016, by GOOD Music, Def Jam Recordings and Roc-A-Fella Records. Recording sessions took place from 2013 to 2016, in Italy, Mexico, Canada and the United States. Record production on the album was handled by West alongside a variety of producers such as Mike Dean, Noah Goldstein, Metro Boomin, Rick Rubin, Hudson Mohawke, and more. He also enlisted a wide array of guest vocalists, including Ty Dolla Sign, Desiigner, Kid Cudi, The-Dream, Chance the Rapper, Rihanna and Frank Ocean, among others. The album was preceded by the release of the promotional singles \"Facts\", \"Real Friends\", \"No More Parties in LA\", and \"30 Hours\" as part of West's GOOD Fridays giveaways.",
    "artistId": 1,
  },
  {
    "id": 10,
    "albumName": "Watch the Throne",
    "albumYear": "2011",
    "albumDescription": "Watch the Throne is a collaborative studio album by American rappers Jay-Z and Kanye West, released on August 8, 2011, by Roc-A-Fella Records, Roc Nation, and Def Jam Recordings. Before the album, Jay-Z and West had collaborated on their respective singles and with West as a producer on Jay-Z's work. As longtime friends, they originally sought out to record a five-song EP together, but the project eventually evolved into a full-length album. Recording sessions took place at various locations and began in November 2010. Production on the album was led by West himself, alongside a variety of high-profile record producers including Mike Dean, Swizz Beatz, Sak Pase, Jeff Bhasker, The Neptunes and Q-Tip.",
    "artistId": 1,
  },
  {
    "id": 11,
    "albumName": "In My Mind",
    "albumYear": "2006",
    "albumDescription": "In My Mind is the solo debut studio album by American recording artist and record producer Pharrell. It was released on July 25, 2006. It debuted at number 3 on the US Billboard 200 and sold 142,000 copies in its first week. It was also certified Silver in the United Kingdom for sales of over 60,000 copies.",
    "artistId": 2,
  },
  {
    "id": 12,
    "albumName": "G I R L",
    "albumYear": "2014",
    "albumDescription": "Girl (stylized as G I R L) is the second studio album by American recording artist and record producer Pharrell Williams. The album was released on March 3, 2014, through Williams' label i Am Other and Columbia Records. Girl was Williams' first studio album since his 2006 debut, In My Mind. It contains appearances by Justin Timberlake, Miley Cyrus, Daft Punk, JoJo and Alicia Keys.",
    "artistId": 2,
  },
  {
    "id": 13,
    "albumName": "Man on the Moon: The End of Day",
    "albumYear": "2009",
    "albumDescription": "Man on the Moon: The End of Day is the debut studio album by American hip hop recording artist Kid Cudi, released on September 15, 2009, by Dream On, GOOD Music and Universal Motown. A concept album, narrated by fellow American rapper Common, it follows the release of his first mixtape A Kid Named Cudi (2008). Production for the album took place during 2007 to 2009 and was handled by several record producers, including Cudi, Kanye West, Emile Haynie, Plain Pat, No I.D., Dot da Genius and Jeff Bhasker, among others.",
    "artistId": 3,
  },
  {
    "id": 14,
    "albumName": "Man on the Moon II: The Legend of Mr. Rager",
    "albumYear": "2010",
    "albumDescription": "Man on the Moon II: The Legend of Mr. Rager is the second studio album by American hip hop recording artist Kid Cudi. It was released on November 9, 2010, by GOOD Music and Universal Motown. The album was supported by two singles: \"Erase Me\" featuring Kanye West and \"Mr. Rager\".
Man on the Moon II: The Legend of Mr. Rager debuted at number 3 on the US Billboard 200, selling 169,000 copies during its first week of release. The album received generally positive reviews from critics. On July 26, 2012, the album was certified Gold by the Recording Industry Association of America (RIAA), for shipments of 500,000 copies in the United States.",
    "artistId": 3,
  },
  {
    "id": 15,
    "albumName": "Indicud",
    "albumYear": "2013",
    "albumDescription": "Indicud is the third studio album by American hip hop recording artist Kid Cudi. The album was released on April 12, 2013, by Republic Records. It was the first album of Cudi's solo career to not be an installment of his Man on the Moon series. The album's cover artwork was designed by Kid Cudi himself, who also served as an executive producer of Indicud. It was Cudi's goal to make more uptempo and positive music with the album. He described it as a completely new format compared to his previous albums.",
    "artistId": 3,
  },
  {
    "id": 16,
    "albumName": "Satellite Flight: The Journey to Mother Moon",
    "albumYear": "2014",
    "albumDescription": "Satellite Flight: The Journey to Mother Moon (stylized as KiD CuDi presents SATELLITE FLIGHT: The Journey to Mother Moon) is the fourth studio album by American hip hop recording artist Kid Cudi. The album was issued on February 25, 2014, with only few hours' notice, was first released to digital retailers such as iTunes and Google Play, by Wicked Awesome Records and Republic Records.",
    "artistId": 3,
  },
  {
    "id": 17,
    "albumName": "Speedin' Bullet 2 Heaven",
    "albumYear": "2015",
    "albumDescription": "Speedin' Bullet 2 Heaven is the fifth studio album by American recording artist Kid Cudi. The album was released on December 4, 2015, through Republic Records and Cudi's Wicked Awesome Records imprint. The album is a complete departure from his previous projects, excluding WZRD, a 2012 collaborative effort which was his first venture into rock music. Inspired by the 1990's indie music scene, Cudi included commissioned skits featuring Mike Judge voicing the title characters of his 90's animated sitcom, Beavis and Butt-Head.",
    "artistId": 3,
  },
  {
    "id": 18,
    "albumName": "Passion, Pain & Demon Slayin'",
    "albumYear": "2016",
    "albumDescription": "Passion, Pain & Demon Slayin' is the upcoming sixth studio album by American recording artist Kid Cudi. The album is scheduled to be released through Republic Records and Cudi's Wicked Awesome Records imprint. It succeeds Cudi's alternative rock album Speedin' Bullet 2 Heaven (2015). The album features production from Dot da Genius, Mike Dean, Mike Will Made It and Plain Pat, along with guest appearances from André 3000, Travis Scott, Pharrell Williams and Willow Smith. The album was preceded by the lead singles, \"Frequency\" and \"Surfin'\".",
    "artistId": 3,
  },
  {
    "id": 19,
    "albumName": "WZRD",
    "albumYear": "2012",
    "albumDescription": "WZRD is the eponymously titled debut studio album by American alternative rock duo WZRD. It was released on February 28, 2012, via Universal Republic Records, as well as Cudi's newly found label imprint, Wicked Awesome Records. The album was supported by the singles \"Brake\" and \"Teleport 2 Me, Jamie\".",
    "artistId": 3,
  }

]

  
