module.exports =
[
  { "id": 0,
    "artistId": "0",
    "category": [
      {
        "type": "Bio",
        "title": "Birth",
        "content": "Christopher George Latore Wallace was born in St. Mary's Hospital in Brooklyn, New York, New York, on May 21, 1972, as the only child of Voletta Wallace, a Jamaican preschool teacher, and Selwyn George Latore, a Jamaican welder and politician. His father left the family when Wallace was two years old, and his mother worked two jobs while raising him. Wallace grew up in the Clinton Hill section of Brooklyn on 226 St. James Place near the border of Bedford-Stuyvesant, Brooklyn, considered at the time to be within the latter neighborhood's boundaries.",
        "date": "05/21/1972"
      },
      {
        "type": "Album",
        "title": "Ready to Die",
        "content": "Ready to Die is the debut studio album by American rapper The Notorious B.I.G.; it was released on September 13, 1994, by Bad Boy Records. The label's first release, the album features production by Bad Boy founder Sean \"Puffy\" Combs, Easy Mo Bee, Chucky Thompson, DJ Premier and Lord Finesse, among others. Recording for the album took place during 1993 to 1994 at The Hit Factory and D&D Studios in New York City. The partly autobiographical album tells the story of B.I.G.'s experiences as a young criminal. Ready to Die is his only studio album released during his lifetime, as he was murdered just days prior to the release of his second album, Life After Death (1997).",
        "date": "09/13/1994"
      },
      {
        "type": "Bio",
        "title": "First Child",
        "content": "On August 8, 1993, Wallace's longtime girlfriend gave birth to his first child, T'yanna. Wallace had split with the girlfriend for some time before T'yanna's birth. Wallace wanted his daughter to complete her education, despite being a high school dropout himself. Wallace said that if his mother had promised him what he promised his daughter, everything she wanted, Wallace would have been not only a graduate but also at the top of his class. He continued selling drugs after the birth to support his daughter financially. Once Combs discovered this, he forced Wallace to quit.",
        "date": "08/08/1993"
      },
      {
        "type": "Bio",
        "title": "Marriage",
        "content": "On August 4, 1994, Wallace married R&B singer Faith Evans after they met at a Bad Boy photoshoot. Five days later, Wallace had his first pop chart success as a solo artist with double A-side, \"Juicy/Unbelievable\", which reached No. 27 as the lead single to his debut album.",
        "date": "08/04/1994"
      },
      {
        "type": "Album",
        "title": "Conspiracy",
        "content": "Conspiracy is the debut studio album by American hip hop group Junior M.A.F.I.A. (Including The Notorious B.I.G., Lil' Cease, Trife and Larceny of The Snakes, Lil' Kim, Nino Brown, Chico Del Vec, Kleptomaniac, Capone, Bugsy). It was released on August 29, 1995 by Undeas Recordings and Big Beat Records. The album debuted at number 8 on the US Billboard 200, selling 69,000 copies in its first week. The album is now out of print.",
        "date": "08/29/1995"
      },
      {
        "type": "Album",
        "title": "Life After Death",
        "content": "Life After Death is the second studio album by the American rapper The Notorious B.I.G., released on March 25, 1997, on Bad Boy Records. A double album, it was released posthumously following his death on March 9, 1997. It features collaborations with guest artists such as 112, Jay-Z, Lil' Kim, Mase, Bone Thugs-n-Harmony, Too $hort, Angela Winbush, D.M.C. of Run-D.M.C., R. Kelly, The LOX and Puff Daddy. Life After Death exhibits The Notorious B.I.G. further delving into the mafioso rap subgenre. The album is a sequel to his first album, Ready to Die, and picks up where the last song, \"Suicidal Thoughts\", ends.",
        "date": "03/25/1997"
      },
      {
        "type": "Album",
        "title": "Born Again",
        "content": "Born Again is the first posthumous album by The Notorious B.I.G. It was released on December 7, 1999. It is composed primarily of early recorded verses with newer beats and guest rappers.",
        "date": "12/07/1999"
      },
      {
        "type": "Bio",
        "title": "Death",
        "content": "On March 7, he presented an award to Toni Braxton at the 1997 Soul Train Music Awards in Los Angeles and was booed by some of the audience. The following evening, March 8, Wallace attended an after party hosted by Vibe magazine and Qwest Records at the Petersen Automotive Museum in Los Angeles. Other guests included Faith Evans, Aaliyah, Sean Combs, and members of the Bloods and Crips gangs. On March 9, Wallace left in a GMC Suburban SUV at 12:30 a.m. (PST). By 12:45 a.m. (PST), the streets were crowded with people leaving the event. Wallace's SUV stopped at a red light at the corner of Wilshire Blvd & South Fairfax Ave 50 yards (46 m) from the museum. A dark colored Chevrolet Impala SS pulled up alongside Wallace's SUV. The driver of the Impala, a black male dressed in a blue suit and bow tie, rolled down his window, drew a 9mm blue-steel pistol and fired at the SUV. Four bullets hit Wallace. His entourage rushed him to Cedars-Sinai Medical Center, where doctors performed an emergency thoracotomy, but he was pronounced dead at 1:15 a.m. (PST), six months after Tupac Shakur was killed. Sixteen days after his death, Wallace's double-disc second album was released as planned with the shortened title of Life After Death and hit No. 1 on the Billboard 200 charts, after making a premature appearance at No. 176 due to street-date violations. The record album featured a much wider range of guests and producers than its predecessor. It gained strong reviews and in 2000 was certified Diamond, the highest RIAA certification awarded to a solo hip hop album. Considered one of the best artists in hip hop music, Wallace was described by AllMusic as \"the savior of East Coast hip-hop\". The Source magazine named Wallace the greatest rapper of all time in its 150th issue in 2002. In 2003, when XXL magazine asked several hip hop artists to list their five favorite MCs, Wallace's name appeared on more rappers' lists than anyone else. In 2006, MTV ranked him at No. 3 on their list of The Greatest MCs of All Time, calling him possibly \"the most skillful ever on the mic\". Editors of About.com ranked him No. 4 on their list of the Top 50 MCs of Our Time (1987–2007). In 2012, The Source ranked him No. 3 on their list of the Top 50 Lyrical Leaders of all time. Rolling Stone has referred to him as the \"greatest rapper that ever lived\". In 2015, Billboard named Wallace as the greatest rapper of all time.",
        "date": "03/09/1997"
      }
    ]
  },
  { "id": 1,
    "artistId": "1",
    "category": [
      {
        "type": "Bio",
        "title": "Birth",
        "content": "Kanye Omari West was born on June 8, 1977 in Atlanta, Georgia. His parents divorced when he was three years old. After the divorce, he and his mother moved to Chicago, Illinois. His father, Ray West, is a former Black Panther and was one of the first black photojournalists at The Atlanta Journal-Constitution. Ray West was later a Christian counselor, and in 2006, opened the Good Water Store and Café in Lexington Park, Maryland with startup capital from his son. West's mother, Dr. Donda C. (Williams) West, was a professor of English at Clark Atlanta University, and the Chair of the English Department at Chicago State University before retiring to serve as his manager. West was raised in a middle-class background, attending Polaris High School in suburban Oak Lawn, Illinois after living in Chicago. At the age of 10, West moved with his mother to Nanjing, China, where she was teaching at Nanjing University as part of an exchange program. According to his mother, West was the only foreigner in his class, but settled in well and quickly picked up the language, although he has since forgotten most of it. When asked about his grades in high school, West replied, \"I got A's and B's. And I'm not even frontin'.\" West demonstrated an affinity for the arts at an early age; he began writing poetry when he was five years old. His mother recalled that she first took notice of West's passion for drawing and music when he was in the third grade. Growing up in Chicago, West became deeply involved in its hip hop scene. He started rapping in the third grade and began making musical compositions in the seventh grade, eventually selling them to other artists. At age thirteen, West wrote a rap song called \"Green Eggs and Ham\" and began to persuade his mother to pay $25 an hour for time in a recording studio. It was a small, crude basement studio where a microphone hung from the ceiling by a wire clothes hanger. Although this wasn't what West's mother wanted, she nonetheless supported him. West crossed paths with producer/DJ No I.D., with whom he quickly formed a close friendship. No I.D. soon became West's mentor, and it was from him that West learned how to sample and program beats after he received his first sampler at age 15. After graduating from high school, West received a scholarship to attend Chicago's American Academy of Art in 1997 and began taking painting classes, but shortly after transferred to Chicago State University to study English. He soon realized that his busy class schedule was detrimental to his musical work, and at 20 he dropped out of college to pursue his musical dreams. This action greatly displeased his mother, who was also a professor at the university. She later commented, \"It was drummed into my head that college is the ticket to a good life... but some career goals don\'t require college. For Kanye to make an album called College Dropout it was more about having the guts to embrace who you are, rather than following the path society has carved out for you.\"",
        "date": "05/08/1977"
      },
      {
        "type": "Album",
        "title": "The College Dropout",
        "content": "The College Dropout is the debut studio album by American hip hop artist Kanye West, released February 10, 2004, by Roc-A-Fella Records. It was recorded over a period of four years, beginning in 1999. Prior to the album's release, West had received praise for his production work for artists such as Jay-Z and Talib Kweli, but faced difficulty being accepted as a recording artist in his own right by figures in the music industry. Nonetheless intent on pursuing a solo career, it was several years before West finally received a record deal from Roc-A-Fella Records.",
        "date": "02/10/2004"
      },
      {
        "type": "Album",
        "title": "Late Registration",
        "content": "Late Registration is the second studio album by American hip hop producer and rapper Kanye West, released on August 30, 2005, by Roc-A-Fella Records and Def Jam Recordings. It was recorded over the course of a year in sessions held across studios in New York City and Hollywood, with West collaborating with American record producer and composer Jon Brion. The album features guest contributions from Adam Levine, Lupe Fiasco, Jamie Foxx, Common, Jay-Z, Brandy, and Nas, among others. Its production was notably more lush and elaborate than West's 2004 debut album The College Dropout, as he utilized intricate sampling methods and string orchestration with Brion. West's lyrics explore both personal and political themes, including poverty, drug trafficking, racism, healthcare, and the blood diamond trade.",
        "date": "08/30/2005"
      },
      {
        "type": "Album",
        "title": "Graduation",
        "content": "Graduation is the third studio album by American hip hop recording artist and record producer Kanye West. It was released on September 11, 2007, by Roc-A-Fella Records. Recording sessions for the album took place during 2005 to 2007 at Chung King Studios and Sony Music Studios in New York City and at Chalice Studios and The Record Plant in Los Angeles. It was primarily produced by West himself, with contributions from DJ Toomp, as well as Mike Dean, Nottz, Brian \"All Day\" Miller, Eric Hudson, Warryn Campbell, Gee Roberson, Plain Pat and Jon Brion. It features guest contributions from artists, including Mos Def, Dwele, T-Pain, Lil Wayne, DJ Premier and Chris Martin of Coldplay. The album's cover artwork was designed by Japanese contemporary artist Takashi Murakami.",
        "date": "09/11/2007"
      },
      {
        "type": "Album",
        "title": "808s & HeartBreak",
        "content": "808s & Heartbreak is the fourth studio album by American recording artist Kanye West, released on November 24, 2008, by Roc-A-Fella Records. It was recorded during September and October 2008 at Glenwood Studios in Burbank, California and Avex Recording Studio in Honolulu, Hawaii, with the help of producers No I.D., Jeff Bhasker and others.",
        "date": "11/24/2008"
      },
      {
        "type": "Album",
        "title": "My Beautiful Dark Twisted Fantasy",
        "content": "My Beautiful Dark Twisted Fantasy is the fifth studio album by American hip hop producer and rapper Kanye West, released on November 22, 2010, by Roc-A-Fella Records. Following a period of public and legal controversy, West retreated to a \"self-imposed exile\" in Hawaii in 2009. There, he worked on the album in a communal recording environment that involved numerous contributing musicians and producers. The album features guest appearances from Bon Iver, Jay Z, Pusha T, Rick Ross, Kid Cudi, Nicki Minaj, John Legend and more. Production is led by West himself, alongside a variety of high-profile record producers including Mike Dean, No I.D., Jeff Bhasker, RZA, S1, Bink and DJ Frank E. Noted by critics for its maximalist aesthetic, opulent production quality, and dichotomous themes, My Beautiful Dark Twisted Fantasy incorporates aspects of West's previous works, including soul, baroque, electro, and symphonic styles. The album deals with themes of excess and celebrity, and explores such issues as consumer culture, race, and the idealism of the American Dream.",
        "date": "11/22/2010"
      },
      {
        "type": "Album",
        "title": "Yeezus",
        "content": "Yeezus is the seventh studio album by American rapper Kanye West. It was released on June 18, 2013 by Def Jam Recordings. West gathered a number of artists and close collaborators for production on the album, including Mike Dean, Daft Punk, Noah Goldstein, Hudson Mohawke, Arca, Che Pope, Brodinski, Gesaffelstein and Travis Scott. Yeezus also features guest vocals from Justin Vernon, Chief Keef, Kid Cudi, Assassin, King L, Charlie Wilson and Frank Ocean. Fifteen days before its release date, West enlisted the help of producer Rick Rubin to strip down the record's sound in favor of a more minimalist approach.",
        "date": "06/18/2013"
      },
      {
        "type": "Album",
        "title": "The Life of Pablo",
        "content": "The Life of Pablo is the seventh studio album by American rapper Kanye West. It was released on February 14, 2016, by GOOD Music, Def Jam Recordings and Roc-A-Fella Records. Recording sessions took place from 2013 to 2016, in Italy, Mexico, Canada and the United States. Record production on the album was handled by West alongside a variety of producers such as Mike Dean, Noah Goldstein, Metro Boomin, Rick Rubin, Hudson Mohawke, and more. He also enlisted a wide array of guest vocalists, including Ty Dolla Sign, Desiigner, Kid Cudi, The-Dream, Chance the Rapper, Rihanna and Frank Ocean, among others. The album was preceded by the release of the promotional singles \"Facts\", \"Real Friends\", \"No More Parties in LA\", and \"30 Hours\" as part of West's GOOD Fridays giveaways.",
        "date": "02/14/2016"
      },
      {
        "type": "Album",
        "title": "Watch the Throne",
        "content": "Watch the Throne is a collaborative studio album by American rappers Jay-Z and Kanye West, released on August 8, 2011, by Roc-A-Fella Records, Roc Nation, and Def Jam Recordings. Before the album, Jay-Z and West had collaborated on their respective singles and with West as a producer on Jay-Z's work. As longtime friends, they originally sought out to record a five-song EP together, but the project eventually evolved into a full-length album. Recording sessions took place at various locations and began in November 2010. Production on the album was led by West himself, alongside a variety of high-profile record producers including Mike Dean, Swizz Beatz, Sak Pase, Jeff Bhasker, The Neptunes and Q-Tip.",
        "date": "08/08/2011"
      }
    ]
  },
  { "id": 2,
    "artistId": "2",
    "category": [
      {
        "type": "Bio",
        "title": "Birth",
        "content": "Pharrell Lanscilo Williams was born on April 5, 1973, in Virginia Beach, Virginia, the oldest of three sons of Pharaoh Williams, a handyman, and his wife Carolyn, a teacher. His roots extend for generations in Virginia and North Carolina, and one of his ancestors journeyed to West Africa in 1831, prompting other relatives to emigrate from America to Liberia in 1832. He met Chad Hugo in a seventh-grade summer band camp where Williams played the keyboards and drums and Hugo played tenor saxophone. They were also both members of a marching band; Williams played the snare drum while Hugo was drum major. Williams and Hugo attended Princess Anne High School where he played in the school band; there Pharrell got the name Skateboard P. Hugo attended Kempsville High School. In the MTV show When I Was 17, Pharrell stated that he was a nerd and often did things that stood out from most of his peers. In the early 1990s, Hugo and Williams formed a four-piece \"R&B-type\" group, the Neptunes, with friends Shay Haley and Mike Etheridge. They later entered a high school talent show where they were discovered by Teddy Riley, whose studio was next to Princess Anne High School. After graduating from high school, the group signed with Riley.",
        "date": "04/05/1973"
      },
      {
        "type": "Album",
        "title": "In Search Of...",
        "content": "In Search of... is the debut studio album by American funk rock band N.E.R.D. The group originally released the album on August 6, 2001 in Europe, where Kelis' Wanderland—produced by The Neptunes, consisting of N.E.R.D members Pharrell Williams and Chad Hugo—was better received. Similarly to Kelis' early work, the original version of In Search of... juxtaposes hip hop and rock influences and styles. The album is named after the TV series In Search of..., hosted by Leonard Nimoy. On March 12, 2002, In Search of... was re-released worldwide, with the largely electronic production backing of the album replaced by live backing provided by 1960s-style power pop band Spymob, giving the new version of the album a more rock-oriented sound. The skits and the intro from the original album were also dropped, significantly shortening the play length.",
        "date": "08/06/2001"
      },
      {
        "type": "Album",
        "title": "Fly or Die",
        "content": "Fly or Die is the second studio by American funk rock band N*E*R*D. It was released on March 23, 2004. The band recorded its second album Fly or Die during 2003. The band actually learned the instruments needed to play the tunes, so they could perform live. As Chad Hugo told MTV News on December 9, 2003, \"We're the ones playing the instruments live this time. I just started playing guitar last year so I'm learning as we go. Pharrell's playing drums. Last time, (on In Search of...) we didn't have time to learn certain instruments so we got Spymob to help us out.\"The band also recruited some assistance to record the album with Lenny Kravitz and Questlove playing on the track \"Maybe.\" Several of tracks concern issues of particular concern to adolescents including \"Thrasher\" about bullies, \"Drill Sergeant\" about rebellion and conscription, and first love on \"Backseat Love\".",
        "date": "08/06/2001"
      },
      {
        "type": "Album",
        "title": "Seeing Sounds",
        "content": "Seeing Sounds is the third studio album by American funk rock band N.E.R.D released June 10, 2008 on Star Trak Entertainment and Interscope Records in the United States. After ending their contract with Virgin Records in 2005, the band felt their previous album Fly or Die (2004) was too consistent. Using their own money, the band recorded the album in Florida and California. The album was produced solely by record production duo The Neptunes, consisting of Pharrell Williams and Chad Hugo, with additional assistance by rock band Spymob and was mainly written by Williams. The album's title, as well as its content, revolves around the neurological phenomenon of synesthesia, the mixing of sensory modalities. The album debuted at number seven on the U.S. Billboard 200 chart, selling 80,000 in its first week. It peaked in the top 20 in Australia, Canada, the Netherlands, Switzerland and the United Kingdom, while also charting in the several other countries. Upon its release, Seeing Sounds received generally mixed to positive reviews from most music critics. Some writers called the record N.E.R.D's best album to date and praised its production, while others negatively criticized Williams' singing and the album's lyrical content.",
        "date": "06/10/2008"
      },
      {
        "type": "Album",
        "title": "Nothing",
        "content": "Nothing is the fourth studio album by American funk rock band N.E.R.D, released November 2, 2010 on Star Trak Entertainment and Interscope Records in the United States. On October 17, 2010, the standard edition and the deluxe edition of the album became available for pre-order on iTunes.",
        "date": "11/02/2010"
      },
      {
        "type": "Album",
        "title": "In My Mind",
        "content": "In My Mind is the solo debut studio album by American recording artist and record producer Pharrell. It was released on July 25, 2006. It debuted at number 3 on the US Billboard 200 and sold 142,000 copies in its first week. It was also certified Silver in the United Kingdom for sales of over 60,000 copies.",
        "date": "07/25/2006"
      },
      {
        "type": "Album",
        "title": "G I R L",
        "content": "Girl (stylized as G I R L) is the second studio album by American recording artist and record producer Pharrell Williams. The album was released on March 3, 2014, through Williams' label i Am Other and Columbia Records. Girl was Williams' first studio album since his 2006 debut, In My Mind. It contains appearances by Justin Timberlake, Miley Cyrus, Daft Punk, JoJo and Alicia Keys.",
        "date": "03/03/2014"
      }
    ]
  },
  { "id": 3,
    "artistId": "3",
    "category": [
      {
        "type": "Bio",
        "title": "Birth",
        "content": "Scott Ramon Seguro Mescudi was born on January 30, 1984, in Cleveland, Ohio, and grew up in Shaker Heights and Solon. He is the youngest of four children, with two brothers, Domingo and Dean, and a sister, Maisha. His mother, Elsie Harriet (Banks), is a middle-school choir teacher at Roxboro Middle School in Cleveland Heights, Ohio. His father, Lindberg Styles Mescudi, was a house painter, substitute teacher and World War II Air Force veteran. His father was of African-American and Mexican-American descent, while his mother is African-American. When he was eleven years old, Cudi's father died of cancer; his passing had a significant effect on Cudi's personality and subsequently his music. Cudi attended Shaker Heights High School for two years before transferring to Solon High School. He was expelled from the school for threatening to punch his principal and would later earn his GED. Cudi studied film at the University of Toledo, dropping out after a year. His subsequent plan to join the U.S. Navy didn't pan out because of his juvenile police record.",
        "date": "01/30/1984"
      },
      {
        "type": "Album",
        "title": "Man on the Moon: The End of Day",
        "content": "Man on the Moon: The End of Day is the debut studio album by American hip hop recording artist Kid Cudi, released on September 15, 2009, by Dream On, GOOD Music and Universal Motown. A concept album, narrated by fellow American rapper Common, it follows the release of his first mixtape A Kid Named Cudi (2008). Production for the album took place during 2007 to 2009 and was handled by several record producers, including Cudi, Kanye West, Emile Haynie, Plain Pat, No I.D., Dot da Genius and Jeff Bhasker, among others.",
        "date": "09/15/2009"
      },
      {
        "type": "Album",
        "title": "Man on the Moon II: The Legend of Mr. Rager",
        "content": "Man on the Moon II: The Legend of Mr. Rager is the second studio album by American hip hop recording artist Kid Cudi. It was released on November 9, 2010, by GOOD Music and Universal Motown. The album was supported by two singles: \"Erase Me\" featuring Kanye West and \"Mr. Rager\". Man on the Moon II: The Legend of Mr. Rager debuted at number 3 on the US Billboard 200, selling 169,000 copies during its first week of release. The album received generally positive reviews from critics. On July 26, 2012, the album was certified Gold by the Recording Industry Association of America (RIAA), for shipments of 500,000 copies in the United States.",
        "date": "11/09/2010"
      },
      {
        "type": "Album",
        "title": "Indicud",
        "content": "Indicud is the third studio album by American hip hop recording artist Kid Cudi. The album was released on April 12, 2013, by Republic Records. It was the first album of Cudi's solo career to not be an installment of his Man on the Moon series. The album's cover artwork was designed by Kid Cudi himself, who also served as an executive producer of Indicud. It was Cudi's goal to make more uptempo and positive music with the album. He described it as a completely new format compared to his previous albums.",
        "date": "04/12/2013"
      },
      {
        "type": "Album",
        "title": "Satellite Flight: The Journey to Mother Moon",
        "content": "Satellite Flight: The Journey to Mother Moon (stylized as KiD CuDi presents SATELLITE FLIGHT: The Journey to Mother Moon) is the fourth studio album by American hip hop recording artist Kid Cudi. The album was issued on February 25, 2014, with only few hours' notice, was first released to digital retailers such as iTunes and Google Play, by Wicked Awesome Records and Republic Records.",
        "date": "02/25/2014"
      },
      {
        "type": "Album",
        "title": "Speedin' Bullet 2 Heaven",
        "content": "Speedin' Bullet 2 Heaven is the fifth studio album by American recording artist Kid Cudi. The album was released on December 4, 2015, through Republic Records and Cudi's Wicked Awesome Records imprint. The album is a complete departure from his previous projects, excluding WZRD, a 2012 collaborative effort which was his first venture into rock music. Inspired by the 1990's indie music scene, Cudi included commissioned skits featuring Mike Judge voicing the title characters of his 90's animated sitcom, Beavis and Butt-Head.",
        "date": "12/04/2015"
      },
      {
        "type": "Album",
        "title": "Passion, Pain & Demon Slayin'",
        "content": "Passion, Pain & Demon Slayin' is the upcoming sixth studio album by American recording artist Kid Cudi. The album is scheduled to be released through Republic Records and Cudi's Wicked Awesome Records imprint. It succeeds Cudi's alternative rock album Speedin' Bullet 2 Heaven (2015). The album features production from Dot da Genius, Mike Dean, Mike Will Made It and Plain Pat, along with guest appearances from André 3000, Travis Scott, Pharrell Williams and Willow Smith. The album was preceded by the lead singles, \"Frequency\" and \"Surfin'\".",
        "date": "09/30/2016"
      }
    ]
  },
  { "id": 4,
    "artistId": "4",
    "category": [
      {
        "type": "Bio",
        "title": "Birth",
        "content": "Aubrey Drake Graham was born on October 24, 1986, known simply as Drake, is a Canadian rapper, singer, songwriter, record producer, and actor. Drake initially gained recognition as an actor on the teen drama television series Degrassi: The Next Generation in the early 2000s. Intent on pursuing a career as a rapper, he departed the series in 2007 following the release of his debut mixtape, Room for Improvement. He released two further independent projects, Comeback Season and So Far Gone, before signing to Lil Wayne's Young Money Entertainment in June 2009.",
        "date": "10/24/1986"
      },
      {
        "type": "Album",
        "title": "So Far Gone",
        "content": "So Far Gone is the debut extended play by Canadian hip hop recording artist Drake. It was released on September 15, 2009, by OVO, Young Money Entertainment, Cash Money Records and Universal Motown. This is his reissued project from his third mixtape that was released earlier on February 13, 2009. This EP features five tracks from the mixtape, with the inclusions of containing two new songs. The EP features guest appearances from Trey Songz, Lil Wayne, Bun B and Young Jeezy. The EP was supported by three singles: \"Best I Ever Had\", \"Successful\" featuring Trey Songz and Lil Wayne, and \"I'm Goin' In\" featuring . In April 2010, the EP won the Rap Recording of the Year at the 2010's Juno Awards.",
        "date": "09/15/2009"
      },
      {
        "type": "Album",
        "title": "Thank Me Later",
        "content": "Thank Me Later is the debut studio album by Canadian rapper Drake. It was released on June 15, 2010, by Aspire Music Group, Young Money Entertainment, Cash Money Records, and Universal Motown Records. Production for the album took place at various recording studios during 2009 to 2010 and was mostly produced by longtime collaborators Noah \"40\" Shebib and Boi-1da. It also featured contributions from Timbaland, Swizz Beatz, Nicki Minaj, Lil Wayne, The-Dream, and Kanye West, among others. Thank Me Later has a languorous, ambient production that incorporates moody synthesizers, sparse beats, obscured keyboards, minor keys, and subtle arrangements. Thematically, the album focuses on Drake's introduction to fame and his romances over the course of confessional, club-oriented, and sexual songs. Drake's emotionally transparent, self-deprecating lyrics are delivered in both rapped and subtly sung verses, and explore feelings of doubt, insecurity, and heartbreak.",
        "date": "06/15/2010"
      },
      {
        "type": "Album",
        "title": "Take Care",
        "content": "Take Care is the second studio album by Canadian hip hop recording artist Drake. It was released on November 15, 2011, by Young Money Entertainment, Cash Money Records and Republic Records. It serves as a follow-up to his debut album Thank Me Later (2010). Recording sessions took place from 2010 to 2011, with production that was primarily handled by frequent collaborator Noah \"40\" Shebib, alongside T-Minus, The Weeknd, Boi-1da, Just Blaze, Jamie xx and Drake himself, among others. For this album, the recording was more cohesive than Drake's debut album. While expanding the sonic aesthetic from his debut album, Take Care features an atmospheric sound that was characterized by a low-key musical elements and incorporates R&B, pop, electronica and post-dubstep styles. Drake's lyrics mostly eschew boastful raps for introspective lyrics that deals with topics such as failed romances, relationship with friends and family, growing wealth and fame, concerns about leading a hollow life, and despondency. The album was noted by music writers for its minimalist R&B elements, existential subject matter, conflicted lyrics, and Drake's alternately sung and rapped vocals. Labeling as one of the most anticipated music releases in 2011, Take Care has experienced some several delays to its release date and some subsequent online leakage, only nine days before its scheduled release.",
        "date": "11/15/2011"
      },
      {
        "type": "Album",
        "title": "Nothing Was the Same",
        "content": "Nothing Was the Same is the third studio album by Canadian recording artist Drake. It was released on September 24, 2013, by OVO Sound, Young Money Entertainment, Cash Money Records and Republic Records. Work on the record began in 2012 and continued through 2013. As its executive producer, Drake enlisted collaborators including 2 Chainz, Big Sean, Jay Z, Jhené Aiko and Sampha to appear as guest appearances on the album. The album's production was primarily handled by 40 and other OVO Sound producers; Boi-1da, Mike Zombie, Majid Jordan and Nineteen85, among others such as, Detail, Key Wane, Hudson Mohawke and Jake One.",
        "date": "09/24/2013"
      },
      {
        "type": "Album",
        "title": "Views",
        "content": "Views is the fourth studio album by Canadian rapper Drake. It was released on April 29, 2016, by Young Money Entertainment, Cash Money Records and Republic Records. Recording sessions took place between 2014 and 2016, with the production that was primarily handled by his longtime and frequent collaborator 40, alongside with each of these several producers, including Nineteen85, Maneesh Bidaye, Kanye West and Jordan Ullman, among others. The album was supported by the five singles: \"Hotline Bling\", \"One Dance\" featuring Wizkid and Kyla, \"Pop Style\" featuring The Throne, \"Controlla\" and \"Too Good\" featuring Rihanna. Views was met with lukewarm reviews from critics, many of whom found it to be an overlong retread of Drake's previous work. The album remained at number one on the US Billboard 200 for 13 non-consecutive weeks. \"One Dance\" became Drake's first Billboard Hot 100 number-one single as a lead artist, spending 10 weeks at number one. As of August 2016, the album has sold 1.4 million copies in the United States. Views became the first album to accumulate one-billion streams on Apple Music.",
        "date": "04/29/2016"
      },
      {
        "type": "Mixtape",
        "title": "If You're Reading This It's Too Late",
        "content": "If You're Reading This It's Too Late is the fourth mixtape by Canadian recording artist Drake. It was released through the iTunes Store without prior announcement on February 13, 2015, by Cash Money Records. The physical edition of the project was released by Cash Money Records; as well as Young Money Entertainment, OVO Sound and Republic Records. There is a debate upon whether this project is a mixtape or a studio album, as it was also released commercially through his record label, while Drake himself referred to the project as a mixtape.",
        "date": "02/13/2015"
      },
      {
        "type": "Mixtape",
        "title": "What a Time to Be Alive",
        "content": "What a Time to Be Alive is a collaborative mixtape by hip hop recording artists Drake and Future. It was released on September 20, 2015, by Young Money Entertainment, Cash Money Records, Epic Records, Republic Records, OVO Sound, and Freebandz. What a Time to Be Alive was supported by Drake and Future's previous collaboration on the single \"Where Ya At\". As friends, they originally planned to record a mixtape together earlier in the year, however, the project never fully materialized. However, during recording sessions for \"Where Ya At\", the duo began working on the project, beginning in July. The mixtape was extensively produced by Metro Boomin, as well as also being produced by Southside, Boi-1da, and 40, among others. It was released on the iTunes Store and Apple Music, and debuted at number one on the US Billboard 200.",
        "date": "09/20/2015"
      },
      {
        "type": "Mixtape",
        "title": "Room for Improvement",
        "content": "Room for Improvement is the first official mixtape from Canadian rapper Drake. It was self-released in 2006. The mixtape was originally intended for sale only and had sold 6,000 copies in 2006.",
        "date": "02/14/2006"
      },
      {
        "type": "Mixtape",
        "title": "Comeback Season",
        "content": "Comeback Season is the second official mixtape from Canadian rapper Drake. In 2007, Comeback Season spawned a single and a music video for \"Replacement Girl\", featuring Trey Songz, that was executive produced by Terral \"T. Slack\" of BPE. Also in 2007, Drake became the first unsigned Canadian rapper to have his music video featured on BET when his first single, \"Replacement Girl\", was featured as the \"New Joint of the Day\" on April 30, 2007.",
        "date": "09/01/2007"
      },
    ]
  },
  { "id": 5,
    "artistId": "5",
    "category": [
      {
        "type": "Bio",
        "title": "Birth",
        "content": "Tupac Amaru Shakur born Lesane Parish Crooks on June 16, 1971, also known by his stage names 2Pac and Makaveli, was an African-American rapper, record producer, and actor. As of 2007, Shakur has sold over 75 million records worldwide. His double disc albums All Eyez on Me and his Greatest Hits are among the best selling albums in the United States with All Eyez on Me selling 5,000,000 copies and Greatest Hits selling 5,100,000 copies. He has been listed and ranked as one of the greatest artists of all time by many magazines, including Rolling Stone which ranked him 86th on its list of The 100 Greatest Artists of All Time. He is consistently ranked as one of the greatest and most influential rappers of all time. Shakur began his career as a roadie, backup dancer, and MC for the alternative hip hop group Digital Underground, eventually branching off as a solo artist. The themes of most of Shakur's songs revolved around the violence and hardship in inner cities, racism, and other social problems. Both of his parents and several other people in his family were members of the Black Panther Party, whose ideals were reflected in his songs. During the latter part of his career, Shakur was a vocal participant during the East Coast–West Coast hip hop rivalry, becoming involved in conflicts with other rappers, producers, and record-label staff members, most notably The Notorious B.I.G. and the label Bad Boy Records.",
        "date": "06/16/1971"
      },
      {
        "type": "Album",
        "title": "2Pacalypse Now",
        "content": "2Pacalypse Now is the debut studio album by American rapper 2Pac. It was released on November 12, 1991, by Interscope Records and EastWest Records America. Less polished than it later proceed with his studio album, 2Pacalypse Now, which is 2Pac's commentary on contemporary social issues facing American society such as racism, police brutality, poverty, black on black crime, and teenage pregnancy, some issues giving a lyrical glimpse into the world of a young black man on the urban streets of the United States. It featured three singles; \"Brenda's Got a Baby\", \"Trapped\", and \"If My Homie Calls\".",
        "date": "11/12/1991"
      },
      {
        "type": "Album",
        "title": "Strictly 4 My N.I.G.G.A.Z...",
        "content": "Strictly 4 My N.I.G.G.A.Z... is the second studio album by rapper Tupac Shakur, released by T.N.T. Recordings/Interscope Records/EastWest Records America on February 16, 1993. The rights now belong to Amaru Entertainment. N.I.G.G.A.Z. in the title is an acronym for Never Ign'ant Getting Goals Accomplished; the \"Z\" in the title makes it a plural. Similar to his debut, 2Pacalypse Now, the album contains many tracks emphasizing 2Pac's political and social views. The original album was going to be named \"Troublesome 21\" and released in September '92, but it was scrapped. Debuting at number twenty-four on the Billboard 200, this album saw more commercial success than its predecessor, and there are many noticeable differences in production. While Tupac's first effort included a more underground or indie-rap-oriented sound, this album was considered his \"breakout\" album. It spawned the hits \"Keep Ya Head Up\" and \"I Get Around\" and has since reached double platinum status. On vinyl, Side A (tracks 1-8) was labeled the \"Black Side\" and Side B (tracks 9-16) the \"Dark Side\". The album features guest appearances from the group Live Squad, 2Pac's stepbrother The Wycked (later known as \"Mopreme\", later a member of 2Pac's groups Thug Life and The Outlawz), Ice-T, Ice Cube, Treach, Apache, Poppi, Deadly Threat, R&B singer Dave Hollister and Digital Underground. The album is now out of print.",
        "date": "02/16/1993"
      },
      {
        "type": "Album",
        "title": "Me Against the World",
        "content": "Me Against the World is the third studio album by American hip hop artist 2Pac. It was released March 14, 1995 on the Interscope Records label. It was his impending prison sentence, troubles with the police and Shakur being poor, which many believe might have contributed to Shakur's artistic reemergence on record, as his material is believed by Steve Huey of AllMusic to have become markedly more \"confessional\", \"reflective\", and \"soul-baring\". Me Against the World, released while Shakur was imprisoned, made an immediate impact on the charts, debuting at number one on the Billboard 200. This made Shakur the first artist to have an album debut at number one on Billboard 200 while serving time in prison. The album served as one of Shakur's most positively reviewed albums, with many calling it the magnum opus of his career, and is considered one of the greatest and most influential hip hop albums of all-time. Me Against the World won best rap album at the 1996 Soul Train Music Awards.",
        "date": "03/14/1995"
      },
      {
        "type": "Album",
        "title": "All Eyez on Me",
        "content": "All Eyez on Me is the fourth studio album by American rapper 2Pac, released on February 13, 1996 under Death Row Records and Interscope Records. The album is frequently recognized as one of the crowning achievements of 1990s rap music. The album featured the Billboard Hot 100 number one singles \"How Do U Want It\" and \"California Love\". It featured five singles in all, the most of any of Shakur's albums. Moreover, All Eyez On Me (which was the only Death Row release to be distributed through PolyGram by way of Island Records) made history as the first double-full-length hip-hop solo studio album released for mass consumption. It was issued on two compact discs and four LPs. All Eyez on Me was the second album from 2Pac to hit number-one on both the Billboard 200 and the Top R&B/Hip-Hop Albums charts, selling 566,000 copies in the first week. The album won the 1997 Soul Train R&B/Soul or Rap Album of the Year Award posthumously. Shakur also won the Award for Favorite Rap/Hip-Hop Artist at the 24th Annual American Music Awards and is also commonly referred to as one of the greatest hip hop/rap albums of all time. The album was certified Diamond by the RIAA on July 23, 2014, almost 18 years after Tupac's death.",
        "date": "02/13/1996"
      },
      {
        "type": "Album",
        "title": "The Don Killuminati: The 7 Day Theory",
        "content": "The Don Killuminati: The 7 Day Theory (commonly shortened to The 7 Day Theory or Don Killuminati and sometimes called Makaveli) is the fifth studio album by Tupac Shakur. Released under his new stage name Makaveli, it was his first studio album to be posthumously released. The album was completely finished in a total of seven days during the first week of August 1996. The lyrics were written and recorded in only three days and mixing took an additional four days. These are the last songs Shakur recorded before his fatal shooting on September 7, 1996. The album was originally scheduled for release in March 1997, but as a result of his death, producer Suge Knight released it four months earlier. George \"Papa G\" Pryce, Former Head of Publicity for Death Row, claimed that \"Makaveli which we did was a sort of tongue-in-cheek, and it was not ready to come out, [but] after Tupac was murdered, it did come out... Before that, it was going to be a sort of an underground.\"",
        "date": "11/05/1996"
      },
      {
        "type": "Album",
        "title": "R U Still Down? (Remember Me)",
        "content": "R U Still Down? (Remember Me) is the sixth studio album by 2Pac, released in 1997, and the first to be finished without his creative input. Her son having left a large body of work behind, this was the first release from his mother's imprint Amaru Entertainment, set up to control 2Pac's posthumous releases.",
        "date": "11/25/1997"
      },
      {
        "type": "Album",
        "title": "Until the End of Time",
        "content": "Until the End of Time is the seventh studio album and third posthumous album by the late rapper Tupac Shakur, following his previous posthumous albums R U Still Down? (Remember Me) and Still I Rise. The album consists of material recorded while the rapper was on Death Row Records toward the later end of 1996. A majority of the music compositions were remixed from their original state. Until the End of Time was very highly anticipated and ended up being one of the best selling hip hop albums of 2001.",
        "date": "03/27/2001"
      },
      {
        "type": "Album",
        "title": "Better Dayz",
        "content": "Better Dayz is the eighth studio album and fourth posthumous album by the late American rapper 2Pac, the third to be released without the artist's creative input and is the last to be a double-album. It was released on November 26, 2002, debuting at number 5 on the Billboard 200. This album is the second of two albums (The first being Until The End Of Time) that consists of a collection of previously unreleased material by way of remixed songs from Tupac's \"Makaveli\" period while signed to Death Row Records, and was produced by Johnny \"J\", Jazze Pha, Frank Nitty, and E.D.I. of Outlawz. It includes \"Military Minds\" which features Boot Camp Clik members Buckshot and Smif-n-Wessun (credited as Cocoa Brovaz) which was supposed to be part of a collaborative album between Shakur and BCC titled One Nation but was never officially released due to Shakur's death. Better Dayz has no censored references to Death Row Records unlike the previous album Until The End Of Time. The only track on the album pre-Death Row era is \"My Block (Remix)\", which was recorded in 1994-1995 during Shakur's time with Interscope Records, and which the original version can be found on The Show. It features 23 unreleased recordings from the 1994-1996 period, the majority of which are remixed. Others retain their original form or are complete finished mixes, such as \"Fuck 'Em All\", \"Late Night\", \"Ghetto Star\", \"Better Dayz\", \"Who Do U Believe In?\" and \"They Don't Give A Fuck About Us\". The album features appearances by Outlawz, Ron Isley, Nas, Mýa, Jazze Pha, Tyrese and among others. The hit single, \"Thugz Mansion,\" comes in two versions: an acoustic version featuring Nas, on which the music video is based, and a hip hop version featuring Anthony Hamilton.",
        "date": "11/26/2002"
      },
      {
        "type": "Album",
        "title": "Loyal to the Game",
        "content": "Loyal to the Game is the ninth studio album and fifth posthumous studio album by Tupac Shakur. It contains remixes of previously unreleased music recorded by Shakur before his death in 1996. Released in the United States on December 14, 2004 (December 12 in the United Kingdom), Loyal to the Game was produced by Eminem. According to an interview with MTV, Eminem was so moved by Tupac's life and work that he wrote a letter to Tupac's mother, Afeni Shakur, asking her to consider letting him produce the album. Shakur agreed, giving Eminem the go ahead. The album featured two singles- \"Thugs Get Lonely Too\" featuring Nate Dogg and \"Ghetto Gospel\".",
        "date": "12/12/2004"
      },
      {
        "type": "Album",
        "title": "Pac's Life",
        "content": "Pac's Life is the tenth and final studio album and sixth posthumous album by the late rapper 2Pac. The album was released on November 21, 2006, in the United States, on Amaru Entertainment. Its 2006 release date was designed to commemorate the tenth anniversary of his murder. A broad range of artists contributed to the album, including Outlawz, Krayzie Bone, Snoop Dogg, Chamillionaire, Ludacris, A-3, Big Syke, Papoose, Keyshia Cole, Jay Rock, Young Buck, Ashanti, T.I., Lil' Scrappy, three posthumous appearances by Kadafi, and Jamal Woolard, who became famous for portraying The Notorious B.I.G. in the 2009 biopic Notorious. The album features guest appearances from Ashanti and T.I., who appear on the title track \"Pac's Life.\" They also participated in the release of the single version of the song, which was filmed at the Tupac Amaru Shakur Center for the Arts. The World Premiere of \"Pac's Life\" was on at 7:30 PM on BET's Access Granted on Wednesday, November 22. The video featured on BET's behind the scenes of the filming of \"Pac's Life\". Krayzie Bone, appears on the album's first single, \"Untouchable\".",
        "date": "11/21/2006"
      },
      {
        "type": "Bio",
        "title": "Death",
        "content": "On the night of September 7, 1996, Shakur attended the Bruce Seldon vs. Mike Tyson boxing match with Suge Knight at the MGM Grand in Las Vegas, Nevada. After leaving the match, one of Knight's associates spotted Orlando \"Baby Lane\" Anderson, an alleged Crips gang member from Compton, California, in the MGM Grand lobby. Earlier that year, Anderson and a group of Crips had robbed a member of Death Row's entourage in a Foot Locker store. Knight's associate told Shakur, who attacked Anderson. Shakur's entourage, as well as Knight and his followers, assisted in assaulting Anderson. The fight was captured on the hotel's video surveillance. After the brawl, Shakur went with Knight to Death Row-owned Club 662 (now known as restaurant/club Seven). Shakur rode in Knight's 1996 black BMW 750iL sedan as part of a larger convoy, which included many in Shakur's entourage. At 11:00–11:05 p.m. (PDT), they were halted on Las Vegas Boulevard by Metro bicycle police for playing the car stereo too loudly and not having license plates, which were found in the trunk of Knight's car; the party was released a few minutes later without being ticketed. At 11:10 p.m. (PDT), while they were stopped at a red light at the intersection of Flamingo Road and Koval Lane in front of the Maxim Hotel, a vehicle occupied by two women pulled up on their left side. Shakur, who was standing up through the sunroof, exchanged words with the women and invited them to Club 662. At 11:15 p.m. (PDT), a white, four-door, late-model Cadillac with an unknown number of occupants pulled up to the sedan's right side, rolled down a window, and rapidly fired gunshots at Shakur. He was hit four times, twice in the chest, once in the arm, and once in the thigh. One of the bullets went into Shakur's right lung. Knight was hit in the head by fragmentation. The bodyguard, Frank Alexander, stated that, when he was about to ride along with the rapper in Knight's car, Shakur asked him to drive the car of Shakur's fiancée, Kidada Jones, instead, in case they needed additional vehicles for the drive from Club 662 to the hotel. The bodyguard reported in his documentary, Before I Wake, that, shortly after the assault, one of the convoy's cars drove off after the assailant but that he never heard from the occupants. After arriving at the scene, police and paramedics took Knight and a wounded Shakur to the University Medical Center of Southern Nevada. Chris Carroll, the first Las Vegas police officer to arrive on the scene, heard Shakur's last words, \"f**k you\". Carroll reports that he refused to say another word to him or another officer. According to an interview with the music video director Gobi, while at the hospital, Shakur received news from a Death Row marketing employee that the shooters had called the record company and threatened Shakur. Gobi informed the Las Vegas police but said that the police claimed to be understaffed. No attackers came. At the hospital, Shakur was heavily sedated, was placed on life-support machines, and was ultimately put under a barbiturate-induced coma after repeatedly trying to get out of the bed. While in the intensive-care unit, on the afternoon of Friday, September 13, 1996, Shakur died from internal bleeding; doctors attempted to revive him but could not stop the hemorrhaging. His mother, Afeni, made the decision to tell the doctors to stop. He was pronounced dead at 4:03 p.m. (PDT). The official causes of death were noted as respiratory failure and cardiopulmonary arrest in connection with multiple gunshot wounds. Shakur's body was cremated the next day. Some of his ashes were later mixed with marijuana and smoked by members of the Outlawz. However, E.D.I. Mean claimed in an interview in 2014 that, despite his belief at the time that the ashes were those of Shakur, he later found that the ashes did not belong to Shakur. His fifth album, The Don Killuminati: The 7 Day Theory was released two months later.",
        "date": "09/07/1996"
      },
      {
        "type": "Bio",
        "title": "Prison",
        "content": "Shakur began serving his prison sentence on sexual-assault charges at Clinton Correctional Facility on February 14, 1995. Shortly afterward, he released his multi-platinum album Me Against the World. Shakur became the first artist to have an album at number one on the Billboard 200 while serving a prison sentence. Me Against the World made its debut on the Billboard 200 and stayed at the top of the charts for four weeks. The album sold 240,000 copies in its first week, setting a record for highest first week sales for a solo male rap artist at the time. While serving his sentence, he married his long-time girlfriend, Keisha Morris, on April 4, 1995; the couple divorced in 1996. Shakur stated that he married her \"for the wrong reasons\". In an interview after his release, Shakur claimed to have only written one song during his sentence. While imprisoned, Shakur read many books by Niccolò Machiavelli, The Art of War by Sun Tzu, and other works about political philosophy and strategy. The works inspired his pseudonym \"Makaveli\" under which he released the album The Don Killuminati: The 7 Day Theory. The album presents a stark contrast to previous works. Throughout the album, Shakur continues to focus on the themes of pain and aggression, making this album one of the emotionally darker works of his career. While in prison, Shakur wrote to Death Row Uncut director Nina Bhadresher about his plans to begin a \"new chapter\" of his life. According to Kevin Powell, who spoke to Shakur following his release from prison, Shakur \"seemed like a completely transformed person.\" Powell recalled Shakur being more dark and menacing to the extent that Powell wondered whether he had really known Shakur.",
        "date": "02/14/1995"
      },
    ]
  },
  { "id": 6,
    "artistId": "6",
    "category": [
      {
        "type": "Bio",
        "title": "Birth",
        "content": "Shawn Corey Carter, born December 4, 1969, known professionally as Jay Z (formerly Jay-Z), is an American rapper, businessman and investor. He is one of the most financially successful hip hop artists in America. In 2014, Forbes estimated Jay Z's net worth at nearly $520 million. He is one of the world's best-selling artists of all time, having sold more than 100 million records, while receiving 21 Grammy Awards for his musical work, and numerous additional nominations. Consistently ranked as one of the greatest rappers ever, he was ranked number one by MTV in their list of The Greatest MCs of All-Time in 2006. Three of his albums, Reasonable Doubt (1996), The Blueprint (2001), and The Black Album (2003), are considered landmarks in the genre with all of them featured in Rolling Stone's list of the 500 greatest albums of all time. As a businessman and an investor, Jay Z co-owns the New York 40/40 Club sports bar, and is the co-creator of the clothing line Rocawear. He is the former president of Def Jam Recordings, co-founder of Roc-A-Fella Records, and the founder of the entertainment company Roc Nation. He also founded the sports agency Roc Nation Sports and is a certified NBA and MLB sports agent. As an artist, he holds the record for most number one albums by a solo artist on the Billboard 200 with 13. Jay Z also has had four number ones on the Billboard Hot 100, one as lead artist. On December 11, 2009, Jay Z was ranked as the tenth-most successful artist of the 2000s by Billboard as well as the fifth top solo male artist and fourth top rapper behind Eminem, Nelly, and 50 Cent. He was also ranked the 88th greatest artist of all time by Rolling Stone.",
        "date": "12/04/1969"
      },
      {
        "type": "Album",
        "title": "Reasonable Doubt",
        "content": "Reasonable Doubt is the debut studio album by American rapper Jay Z. It was released on June 25, 1996, by Roc-A-Fella Records and Priority Records. The album features production provided by DJ Premier, Ski, Knobody and Clark Kent, and also it includes guest appearances from Memphis Bleek, Mary J. Blige and The Notorious B.I.G., among others. The album features Mafioso rap themes and gritty lyrics about the \"hustler\" lifestyle and material obsessions. Reasonable Doubt debuted at number 23 on the US Billboard 200, on which it charted for 18 weeks. It was promoted with four singles; including \"Ain't No Nigga\" and \"Can't Knock the Hustle\". Reasonable Doubt was certified platinum by the Recording Industry Association of America (RIAA) and, as of 2006, has sold 1.5 million copies in the United States. A critical success, it has been ranked on several publications' lists of the greatest rap albums ever, while many hip hop fans have viewed it as Jay-Z's best work.",
        "date": "06/24/1996"
      },
      {
        "type": "Album",
        "title": "In My Lifetime, Vol. 1",
        "content": "In My Lifetime, Vol. 1 is the second studio album by American rapper Jay Z, released on November 4, 1997 by Roc-A-Fella Records. The album debuted at number 3 on the U.S. Billboard 200 chart and was certified platinum by the RIAA. The album features guest contributions by Lil' Kim, Foxy Brown, Babyface, Blackstreet, Teddy Riley, Too $hort, and Puff Daddy. Producers for Reasonable Doubt such as DJ Premier and Ski contribute to a limited number of beats on this album, though the majority of the production is handled by beatmakers from Puff Daddy's Bad Boy label, giving the album a generally glossier sound than its predecessor. It displayed a shift from the mafioso rap themes of his first effort to the so-called \"jiggy\" era of late 90's hip-hop, often credited to videos and albums from Puff Daddy and his Bad Boy record label's roster of artists including Notorious B.I.G. (the first two singles from his second album were both huge pop hits) and Mase.",
        "date": "11/04/1997"
      },
      {
        "type": "Album",
        "title": "Vol. 2... Hard Knock Life",
        "content": "Vol. 2... Hard Knock Life is the third studio album by American rapper Jay Z. It was released on September 29, 1998, by Roc-A-Fella Records. In the liner notes of the album, Jay-Z gives his thoughts on various tracks. The lyrics to the fast paced \"Nigga What, Nigga Who (Originator 99)\" are also included. Speaking in December 1998 to noted UK urban writer Pete Lewis of the award-winning Blues & Soul, Jay described the background to the album's lyrical themes: \"Primarily I see myself as so much more than a rapper. I really believe I'm the voice for a lot of people who don't have that microphone or who can't rap. So I wanted to represent and tell the story of everybody who's been through what I've been through, or knows somebody that has. I also wanted to speak about our lifestyle to people who - though they may live, say, in the suburbs and not be part of that world - still want to know about it and understand it.\"",
        "date": "09/29/1998"
      },
      {
        "type": "Album",
        "title": "Vol. 3... Life and Times of S. Carter",
        "content": "Vol. 3… Life and Times of S. Carter is the fourth studio album by American rapper Jay Z. It was released on December 28, 1999, by Roc-A-Fella Records. According to USA Today critic Steve Jones, the record marked a return to the street-oriented sound of Jay-Z's 1996 debut album, Reasonable Doubt. Vol. 3... featured production from Swizz Beatz, Timbaland, K-Rob, DJ Clue, Rockwilder, DJ Premier, and Irv Gotti, among others. The album was well received by critics and debuted at number one on the Billboard 200, selling 462,000 copies in its first week. It has since sold over three million copies and been certified triple platinum by the Recording Industry Association of America. In a contemporary review, Rolling Stone critic Kris Ex wrote that Jay-Z \"has become a better architect of songs\" while hailing Vol. 3... as \"his strongest album to date, with music that's filled with catchy hooks, rump-shaking beats and lyrics fueled by Jay's hustler's vigilance\". Richard Harrington from The Washington Post found the record to be \"full of reputation-building swagger, cataloguing of lyrical skills and autobiographical perspective\". Reviewing the album in Entertainment Weekly, Anthony DeCurtis said it reconnects with Jay-Z's urban demographic, \"with flair\", while Steve Jones of USA Today was particularly impressed by his lyrics and flow, finding both to be \"razor-sharp as ever\". In The Village Voice, Robert Christgau argued that Jay-Z has too much at stake commercially to depart from \"playing the now-a-rapper-now-a-thug 'reality' game with his customers, thugs and fantasists both\", but he impresses with \"a rugged, expansive vigor, nailing both come-fly-with-me cosmopolitanism and the hunger for excitement that's turned gangster hangouts into musical hotbeds from Buenos Aires to Kansas City\". Fellow Voice critic Miles Marshall Lewis called Jay-Z \"the best MC in hip hop\" and Vol. 3… \"the quintessential 2000-model hip hop album\". Soren Baker was less impressed in the Los Angeles Times, writing that the record lacks the \"biting humor and spectacular wordplay\" of his previous albums.",
        "date": "12/28/1999"
      },
      {
        "type": "Album",
        "title": "The Dynasty: Roc La Familia",
        "content": "The Dynasty: Roc La Familia is the fifth studio album released by American rapper Jay Z. Its lead single, \"I Just Wanna Love U (Give It 2 Me)\", produced by The Neptunes, was one of Jay-Z's most successful singles peaking at number 11 on the Billboard Hot 100. The album debuted at #1 on the Billboard 200 with 557,789 copies sold in its first week and more than 2.3 million copies sold to date. The album generally received positive reviews from music critics and the album ended up becoming the 20th highest selling R&B/Hip-Hop Album of the 2000–2010 decade according to Billboard. Originally a Roc-A-Fella Records compilation album, a showcase for Roc-A-Fella artists such as Memphis Bleek, Beanie Sigel, Amil and Freeway, which eventually became another Jay-Z solo album (or at least marketed as one to increase sales), although the Roc-A-Fella artists are abundant on this album. Big name guest appearances have been limited to three – Snoop Dogg, R. Kelly, and Scarface – to make room for the Roc-A-Fella family. Rather than using big-name producers such as Swizz Beatz and Timbaland, who had featured prominently on Vol. 2 and Vol. 3, Jay-Z had decided to feature more up-and-coming producers at the time of this album, such as Just Blaze, Kanye West, Bink! and The Neptunes. Partially as a result of this exposure, these producers would achieve notable success in the future. This was also the first album of Jay-Z's not to feature work by longtime producer DJ Premier. Given Just Blaze and Kanye West's penchant for utilizing soul samples in their beats, the album features a smoother sound than Jay-Z's previous efforts, though Bay Area-based producer Rick Rock includes a more minimalist sound in his four productions.",
        "date": "10/31/2000"
      },
      {
        "type": "Album",
        "title": "The Blueprint",
        "content": "The Blueprint is the sixth studio album by American rapper Jay-Z, released on September 11, 2001, on Roc-A-Fella Records in the United States. Its release was set a week earlier than initially planned in order to combat bootlegging. Recording sessions for the album took place during 2001 at Manhattan Center Studios and Baseline Studios in New York City. Contrasting the radio-friendly sound of Jay-Z's previous work, The Blueprint features soul-based sampling and production handled primarily by Kanye West, Just Blaze and Bink, as well as Timbaland, Trackmasters and Eminem, who also contributes the album's sole guest verse. At the time of the album's recording, Jay-Z was awaiting two criminal trials, one for gun possession and another for assault, and had become one of hip hop's most dissed artists, receiving insults from rappers such as Nas, Prodigy, and Jadakiss.[1][2] The album is also famous for both its producers Kanye West and Just Blaze's breakouts as major producers. Kanye West produced 5 of the 13 tracks on the album, including the songs \"Izzo (H.O.V.A.)\" and the controversial \"Takeover,\" which included diss lyrics aimed at rappers Nas and Prodigy, while Just Blaze produced 3 tracks, \"Girls, Girls, Girls\", \"Song Cry\", and \"U Don't Know\", also including the hidden bonus track \"Breathe Easy (Lyrical Exercise)\". Upon its release, The Blueprint received universal acclaim, with critics praising Jay-Z's lyricism and the production. It is considered one of Jay-Z's best albums and has also been labeled as one of the greatest hip-hop albums of all time.",
        "date": "09/11/2001"
      },
      {
        "type": "Album",
        "title": "The Blueprint 2: The Gift & The Curse",
        "content": "The Blueprint 2: The Gift & The Curse is the seventh studio album by American rapper Jay Z. It was released on November 12, 2002, by Roc-A-Fella Records and Def Jam Recordings. The album serves as a sequel to his sixth album The Blueprint (2001). Parts of the album were later reissued for his compilation album, titled Blueprint 2.1 (2003). Unlike this project than his other four previous albums, it debuted at number one, shipping with first-week sales of 545,000 units. As of February 2012, the album has sold 2,117,000 units in the United States.",
        "date": "11/12/2002"
      },
      {
        "type": "Album",
        "title": "The Black Album",
        "content": "The Black Album is the eighth studio album by American rapper Jay Z, released on November 14, 2003, by Roc-A-Fella Records. It was advertised as his final album before retiring, which is also a recurring theme throughout the songs, although Jay-Z resumed his recording career in 2006. For the album, Jay-Z wanted to enlist a different producer for each song, working with Just Blaze, Kanye West, The Neptunes, Timbaland, 9th Wonder and Rick Rubin, among others. When The Black Album was released, it received widespread acclaim from critics. In its first week, the album debuted at number one on the Billboard 200, selling 463,000 copies in the United States. It became Jay Z's top selling record of the 2000s decade, and by July 2013, it had sold 3,516,000 copies in the US. The Black Album was promoted with a retirement tour by Jay Z and three singles that also achieved Billboard chart success, including the top-ten hits \"Change Clothes\" and \"Dirt Off Your Shoulder\". Jay-Z said The Black Album would have a different producer for each track, and early magazine advertisements listed a series of numbers (representing tracks) and a producer for each number. Dr. Dre and DJ Premier were originally supposed to be among these producers; however, they did not make the final cut. The final album did feature a variety of producers, although Roc-A-Fella producers Kanye West and Just Blaze produced two tracks each, in addition to the two produced by frequent Jay-Z collaborators The Neptunes.",
        "date": "11/14/2003"
      },
      {
        "type": "Album",
        "title": "Kingdom Come",
        "content": "Kingdom Come is the ninth studio album by American rapper Jay-Z. It was released on November 21, 2006, by Roc-A-Fella Records. It was considered a \"comeback album\" for the rapper, as 2003's The Black Album was promoted as his final release. Kingdom Come received generally lukewarm reviews but was a commercial success, selling 680,000 copies in its first week, while earning Jay-Z a Grammy Award nomination for Best Rap Album. He has since considered it to be his worst album. Kingdom Come was the first Jay-Z album released since 2003's The Black Album, which had been widely hyped as Jay-Z's \"retirement\" album. The video for that album's hit single \"99 Problems\" had ended with Jay-Z going down in a hail of gunfire. Jay-Z stated in interviews that that scene represented the \"death\" of Jay-Z and the \"rebirth\" of Shawn Carter. Because of this, Jay-Z had originally planned to release Kingdom Come under his real name of Shawn Carter, but decided in the end to release it under his more-famous stage name Jay-Z. The album's second single, \"Lost One\" (produced by Dr. Dre) addresses Jay's split with Roc-A-Fella co-founder Damon Dash, the death of his nephew, and supposedly his relationship with singer Beyoncé. Past collaborators Kanye West and particularly Just Blaze made significant contributions to the album's production. This is the first time Dr. Dre has played a substantial role in a Jay-Z album, as he produced four beats and mixed every song on the album. Relatively unknown newcomers B-Money, Syience, and DJ Khalil also contributed to the album's production, as well as Coldplay lead singer Chris Martin. Kingdom Come's opening track \"The Prelude\" features additional vocals from Pain in da Ass who featured on some of Jay Z's earlier album introductions, impersonating characters from films such as Scarface, Goodfellas, and Carlito's Way.",
        "date": "11/21/2006"
      },
      {
        "type": "Album",
        "title": "American Gangster",
        "content": "American Gangster is the tenth studio album by American rapper Jay-Z. It was recorded as a concept album—inspired by the 2007 film of the same name—and was released on November 6, 2007, by Roc-A-Fella Records. The album features production from Diddy & The Hitmen, Just Blaze, and The Neptunes, among others. Guest appearances include Beanie Sigel, Lil Wayne, Pharrell and Nas. American Gangster was released to commercial success, despite being pulled from the iTunes Store at Jay-Z's request, at the time of its initial release. It debuted at number one on the Billboard 200 chart, selling 425,861 copies in its first week, while tying Elvis Presley for the second most American number-one albums. American Gangster received widespread critical acclaim and was viewed as a return to form for Jay-Z after the 2006 album Kingdom Come.",
        "date": "11/06/2007"
      },
      {
        "type": "Album",
        "title": "The Blueprint 3",
        "content": "The Blueprint 3 is the eleventh studio album by American rapper Jay-Z, released September 8, 2009, on Roc Nation, through distribution from Atlantic Records. It is the final installment in The Blueprint trilogy, preceded by The Blueprint (2001) and The Blueprint2: The Gift & The Curse (2002). Production for the album took place during 2008 to 2009 at several recording studios and was handled by Kanye West, No I.D., The Neptunes, Jeff Bhasker, Al Shux, Jerome \"J-Roc\" Harmon, The Inkredibles, Swizz Beatz, and Timbaland. This is the only album in the Blueprint trilogy, as well as the first album since Vol. 3... Life and Times of S. Carter (1999), not to feature production from Just Blaze. The album debuted at number one on the US Billboard 200 chart, selling 476,000 copies in its first week. It became Jay-Z's eleventh US number-one album, breaking the record he had previously shared with Elvis Presley, and produced five singles that achieved chart success. Upon its release, The Blueprint 3 received generally positive reviews from music critics.",
        "date": "09/08/2009"
      },
      {
        "type": "Album",
        "title": "Magna Carta Holy Grail",
        "content": "Magna Carta Holy Grail (alternatively written as Magna Carta... Holy Grail) is the twelfth studio album by American rapper Jay Z. It was made available for free digital download for Samsung customers via the Jay Z Magna Carta app on July 4, 2013. It was released for retail sale on July 8, 2013, by Roc-A-Fella and Roc Nation. The album features guest appearances by Justin Timberlake, Nas, Rick Ross, Frank Ocean and Beyoncé. Most of the album was produced by Timbaland and Jerome \"J-Roc\" Harmon, while other producers included Boi-1da, Mike Will Made It, Hit-Boy, Mike Dean, No I.D., The-Dream, Swizz Beatz, and Pharrell Williams among others. The album was promoted through various commercials presented by Samsung and was not preceded by any retail singles. Upon its release, Magna Carta Holy Grail was met with mixed reviews from music critics. Some complimented the album's production and composition, while others were disappointed with its overall theme and found many songs repetitive. On the day of its physical release in the United States, the album was certified Platinum by the Recording Industry Association of America (RIAA) for shipments of 1,000,000 copies. It debuted at number one on the US Billboard 200, selling 528,000 copies in its first week, making it Jay-Z's 13th consecutive studio album to top the chart. On September 2, 2013, it was announced that Magna Carta Holy Grail was certified double Platinum by the RIAA, for shipments of two million copies in the United States. The album was nominated in six categories at the 2014 Grammy Awards winning the Best Rap/Sung Collaboration trophy for \"Holy Grail\" featuring Justin Timberlake. The album spawned three successful singles, \"Holy Grail\", \"Tom Ford\" and \"Part II (On the Run)\" featuring Beyoncé. Multiple other songs on the album achieved chart success including, \"FuckWithMeYouKnowIGotIt\", \"Oceans\", \"Heaven\" and \"Picasso Baby\". Additionally, the album was supported by the concert tour, Magna Carter World Tour.",
        "date": "07/04/2013"
      },
      {
        "type": "Album",
        "title": "The Best of Both Worlds",
        "content": "The Best of Both Worlds is a 2002 collaborative album by R. Kelly and Jay Z. The album sold 285,000 in its opening week and debuted at #2 on the U.S. Billboard 200 albums chart. The album received poor reviews from music critics. The album went platinum in the US for selling more than a million copies.",
        "date": "03/26/2002"
      },
      {
        "type": "Album",
        "title": "Unfinished Business",
        "content": "Unfinished Business is the second collaboration album between R&B artist R. Kelly and rapper Jay Z and was released worldwide on October 26, 2004. It was distributed in the United States and Canada by Jive Records and Island Def Jam Music Group, by the Bertelsmann Music Group (BMG) and its subsidiary Jive Records, except in Canada and the United States of America where Island Def Jam Music Group and its labels Def Jam Recordings and Roc-A-Fella Records replaced BMG. The album was composed of unreleased tracks from the recording sessions of 2002's The Best of Both Worlds, although slight additions were made. Unfinished Business was promoted by the \"Best of Both Worlds\" concert tour with R. Kelly and Jay Z performing songs from both their solo and joint albums. Two singles, \"Big Chips\" and \"Don’t Let Me Die\", were sent to radio stations, but only the former saw a physical release. Unfinished Business debuted at number one on the U.S. Billboard 200 chart amid controversy & criticism. Like its predecessor, it was criticized for repetitive lyrics. The \"Best of Both Worlds\" tour filled with tension and accusations that boiled over at an October 31 show where R. Kelly was accused of erratic behavior and was pepper sprayed by a Jay Z associate. Jay Z and the tour promoter then banned R. Kelly from the tour claiming \"lack of professionalism\". R. Kelly responded by suing his co-act and touring company for $75 million for breach of contract, among other things, on November 2. Unfinished Business was certified Platinum by the Recording Industry Association of America (RIAA) on December 1 for selling more than 1,000,000 copies in the US.",
        "date": "10/26/2004"
      },
      {
        "type": "Album",
        "title": "Collision Course",
        "content": "Collision Course is a collaborative rap rock CD/DVD set from American rapper Jay-Z and nu metal band Linkin Park, released on November 30, 2004 by Roc-A-Fella, Machine Shop, Warner Bros. and Def Jam records. Before the album, Jay-Z had released collaborations with The Roots and R. Kelly, and Linkin Park had collaborated with various artists on their remix album Reanimation. The album was inspired by The Grey Album by Danger Mouse, which was a mash-up album between Jay-Z and The Beatles. MTV had originally planned on mashing up only one or two songs, but the project was eventually expanded to a six song EP. The album was mostly produced by Mike Shinoda and Jay-Z, and was recorded between July 16 and July 19. Upon release, Collision Course reached #1 on the Billboard 200. As of June 2014, it has sold 2 million copies in the United States alone. The album spawned one single, Numb/Encore which eventually won Best Rap/Sung Collaboration at the 2006 Grammy Awards.",
        "date": "11/30/2004"
      },
      {
        "type": "Album",
        "title": "Watch the Throne",
        "content": "Watch the Throne is a collaborative studio album by American rappers Jay-Z and Kanye West, released on August 8, 2011, by Roc-A-Fella Records, Roc Nation, and Def Jam Recordings. Before the album, Jay-Z and West had collaborated on their respective singles and with West as a producer on Jay-Z's work. As longtime friends, they originally sought out to record a five-song EP together, but the project eventually evolved into a full-length album. Recording sessions took place at various locations and began in November 2010. Production on the album was led by West himself, alongside a variety of high-profile record producers including Mike Dean, Swizz Beatz, Sak Pase, Jeff Bhasker, The Neptunes and Q-Tip. Expanding on the dense production style of West's 2010 album My Beautiful Dark Twisted Fantasy, Watch the Throne incorporates orchestral and progressive rock influences, unconventional samples, and dramatic melodies in its sound. Jay-Z and West's braggadocio lyrics exhibit themes of opulence, fame, materialism, power, and the burdens of success, as well as political and socioeconomic context. The album expresses other topics such as Jay-Z's thoughts on fatherhood, West's reflection on being deemed a social villain, and their legacy as performers. Music writers interpreted the subject matter to concern the rappers' plight as African Americans struggling with financial success in America. The album produced seven singles, including \"H•A•M\", \"Otis\", \"Lift Off\", \"No Church in the Wild\", and the Billboard Hot 100 top five \"Niggas in Paris\", which all received music videos. Jay-Z and West promoted the album with the Watch the Throne Tour that spanned October 2011 to June 2012 and became the highest grossing hip-hop concert tour in history. Watch the Throne debuted at number one on the US Billboard 200 chart, selling 436,000 copies its first week. While some critics found the album's lyrical content uninspiring, its production and the rappers' performances were highly praised. Many critics and publications placed the album in their year-end best-of lists. It also earned Jay-Z and West seven Grammy Award nominations. The album is certified platinum in the US.",
        "date": "08/08/2011"
      },
    ]
  },
]


  
