module.exports =
[
  { "id": 0,
    "artistId": "0",
    "category": [
      {
        "type": "Bio",
        "title": "Birth",
        "content": "Christopher George Latore Wallace was born in St. Mary's Hospital in Brooklyn, New York, New York, on May 21, 1972, as the only child of Voletta Wallace, a Jamaican preschool teacher, and Selwyn George Latore, a Jamaican welder and politician. His father left the family when Wallace was two years old, and his mother worked two jobs while raising him. Wallace grew up in the Clinton Hill section of Brooklyn on 226 St. James Place near the border of Bedford-Stuyvesant, Brooklyn, considered at the time to be within the latter neighborhood's boundaries.",
        "date": "05/21/1972"
      },
      {
        "type": "Album",
        "title": "Ready to Die",
        "content": "Ready to Die is the debut studio album by American rapper The Notorious B.I.G.; it was released on September 13, 1994, by Bad Boy Records. The label's first release, the album features production by Bad Boy founder Sean \"Puffy\" Combs, Easy Mo Bee, Chucky Thompson, DJ Premier and Lord Finesse, among others. Recording for the album took place during 1993 to 1994 at The Hit Factory and D&D Studios in New York City. The partly autobiographical album tells the story of B.I.G.'s experiences as a young criminal. Ready to Die is his only studio album released during his lifetime, as he was murdered just days prior to the release of his second album, Life After Death (1997).",
        "date": "09/13/1994"
      },
      {
        "type": "Bio",
        "title": "First Child",
        "content": "On August 8, 1993, Wallace's longtime girlfriend gave birth to his first child, T'yanna. Wallace had split with the girlfriend for some time before T'yanna's birth. Wallace wanted his daughter to complete her education, despite being a high school dropout himself. Wallace said that if his mother had promised him what he promised his daughter, everything she wanted, Wallace would have been not only a graduate but also at the top of his class. He continued selling drugs after the birth to support his daughter financially. Once Combs discovered this, he forced Wallace to quit.",
        "date": "08/08/1993"
      },
      {
        "type": "Bio",
        "title": "Marriage",
        "content": "On August 4, 1994, Wallace married R&B singer Faith Evans after they met at a Bad Boy photoshoot. Five days later, Wallace had his first pop chart success as a solo artist with double A-side, \"Juicy/Unbelievable\", which reached No. 27 as the lead single to his debut album.",
        "date": "08/04/1994"
      },
      {
        "type": "Album",
        "title": "Conspiracy",
        "content": "Conspiracy is the debut studio album by American hip hop group Junior M.A.F.I.A. (Including The Notorious B.I.G., Lil' Cease, Trife and Larceny of The Snakes, Lil' Kim, Nino Brown, Chico Del Vec, Kleptomaniac, Capone, Bugsy). It was released on August 29, 1995 by Undeas Recordings and Big Beat Records. The album debuted at number 8 on the US Billboard 200, selling 69,000 copies in its first week. The album is now out of print.",
        "date": "08/29/1995"
      },
      {
        "type": "Album",
        "title": "Life After Death",
        "content": "Life After Death is the second studio album by the American rapper The Notorious B.I.G., released on March 25, 1997, on Bad Boy Records. A double album, it was released posthumously following his death on March 9, 1997. It features collaborations with guest artists such as 112, Jay-Z, Lil' Kim, Mase, Bone Thugs-n-Harmony, Too $hort, Angela Winbush, D.M.C. of Run-D.M.C., R. Kelly, The LOX and Puff Daddy. Life After Death exhibits The Notorious B.I.G. further delving into the mafioso rap subgenre. The album is a sequel to his first album, Ready to Die, and picks up where the last song, \"Suicidal Thoughts\", ends.",
        "date": "03/25/1997"
      },
      {
        "type": "Album",
        "title": "Born Again",
        "content": "Born Again is the first posthumous album by The Notorious B.I.G. It was released on December 7, 1999. It is composed primarily of early recorded verses with newer beats and guest rappers.",
        "date": "12/07/1999"
      },
      {
        "type": "Bio",
        "title": "Death",
        "content": "On March 7, he presented an award to Toni Braxton at the 1997 Soul Train Music Awards in Los Angeles and was booed by some of the audience. The following evening, March 8, Wallace attended an after party hosted by Vibe magazine and Qwest Records at the Petersen Automotive Museum in Los Angeles. Other guests included Faith Evans, Aaliyah, Sean Combs, and members of the Bloods and Crips gangs. On March 9, Wallace left in a GMC Suburban SUV at 12:30 a.m. (PST). By 12:45 a.m. (PST), the streets were crowded with people leaving the event. Wallace's SUV stopped at a red light at the corner of Wilshire Blvd & South Fairfax Ave 50 yards (46 m) from the museum. A dark colored Chevrolet Impala SS pulled up alongside Wallace's SUV. The driver of the Impala, a black male dressed in a blue suit and bow tie, rolled down his window, drew a 9mm blue-steel pistol and fired at the SUV. Four bullets hit Wallace. His entourage rushed him to Cedars-Sinai Medical Center, where doctors performed an emergency thoracotomy, but he was pronounced dead at 1:15 a.m. (PST), six months after Tupac Shakur was killed. Sixteen days after his death, Wallace's double-disc second album was released as planned with the shortened title of Life After Death and hit No. 1 on the Billboard 200 charts, after making a premature appearance at No. 176 due to street-date violations. The record album featured a much wider range of guests and producers than its predecessor. It gained strong reviews and in 2000 was certified Diamond, the highest RIAA certification awarded to a solo hip hop album. Considered one of the best artists in hip hop music, Wallace was described by AllMusic as \"the savior of East Coast hip-hop\". The Source magazine named Wallace the greatest rapper of all time in its 150th issue in 2002. In 2003, when XXL magazine asked several hip hop artists to list their five favorite MCs, Wallace's name appeared on more rappers' lists than anyone else. In 2006, MTV ranked him at No. 3 on their list of The Greatest MCs of All Time, calling him possibly \"the most skillful ever on the mic\". Editors of About.com ranked him No. 4 on their list of the Top 50 MCs of Our Time (1987–2007). In 2012, The Source ranked him No. 3 on their list of the Top 50 Lyrical Leaders of all time. Rolling Stone has referred to him as the \"greatest rapper that ever lived\". In 2015, Billboard named Wallace as the greatest rapper of all time.",
        "date": "03/09/1997"
      }
    ]
  },
  { "id": 1,
    "artistId": "1",
    "category": [
      {
        "type": "Bio",
        "title": "Birth",
        "content": "Kanye Omari West was born on June 8, 1977 in Atlanta, Georgia. His parents divorced when he was three years old. After the divorce, he and his mother moved to Chicago, Illinois. His father, Ray West, is a former Black Panther and was one of the first black photojournalists at The Atlanta Journal-Constitution. Ray West was later a Christian counselor, and in 2006, opened the Good Water Store and Café in Lexington Park, Maryland with startup capital from his son. West's mother, Dr. Donda C. (Williams) West, was a professor of English at Clark Atlanta University, and the Chair of the English Department at Chicago State University before retiring to serve as his manager. West was raised in a middle-class background, attending Polaris High School in suburban Oak Lawn, Illinois after living in Chicago. At the age of 10, West moved with his mother to Nanjing, China, where she was teaching at Nanjing University as part of an exchange program. According to his mother, West was the only foreigner in his class, but settled in well and quickly picked up the language, although he has since forgotten most of it. When asked about his grades in high school, West replied, \"I got A's and B's. And I'm not even frontin'.\" West demonstrated an affinity for the arts at an early age; he began writing poetry when he was five years old. His mother recalled that she first took notice of West's passion for drawing and music when he was in the third grade. Growing up in Chicago, West became deeply involved in its hip hop scene. He started rapping in the third grade and began making musical compositions in the seventh grade, eventually selling them to other artists. At age thirteen, West wrote a rap song called \"Green Eggs and Ham\" and began to persuade his mother to pay $25 an hour for time in a recording studio. It was a small, crude basement studio where a microphone hung from the ceiling by a wire clothes hanger. Although this wasn't what West's mother wanted, she nonetheless supported him. West crossed paths with producer/DJ No I.D., with whom he quickly formed a close friendship. No I.D. soon became West's mentor, and it was from him that West learned how to sample and program beats after he received his first sampler at age 15. After graduating from high school, West received a scholarship to attend Chicago's American Academy of Art in 1997 and began taking painting classes, but shortly after transferred to Chicago State University to study English. He soon realized that his busy class schedule was detrimental to his musical work, and at 20 he dropped out of college to pursue his musical dreams. This action greatly displeased his mother, who was also a professor at the university. She later commented, \"It was drummed into my head that college is the ticket to a good life... but some career goals don\'t require college. For Kanye to make an album called College Dropout it was more about having the guts to embrace who you are, rather than following the path society has carved out for you.\"",
        "date": "05/08/1977"
      },
      {
        "type": "Album",
        "title": "The College Dropout",
        "content": "The College Dropout is the debut studio album by American hip hop artist Kanye West, released February 10, 2004, by Roc-A-Fella Records. It was recorded over a period of four years, beginning in 1999. Prior to the album's release, West had received praise for his production work for artists such as Jay-Z and Talib Kweli, but faced difficulty being accepted as a recording artist in his own right by figures in the music industry. Nonetheless intent on pursuing a solo career, it was several years before West finally received a record deal from Roc-A-Fella Records.",
        "date": "02/10/2004"
      },
      {
        "type": "Album",
        "title": "Late Registration",
        "content": "Late Registration is the second studio album by American hip hop producer and rapper Kanye West, released on August 30, 2005, by Roc-A-Fella Records and Def Jam Recordings. It was recorded over the course of a year in sessions held across studios in New York City and Hollywood, with West collaborating with American record producer and composer Jon Brion. The album features guest contributions from Adam Levine, Lupe Fiasco, Jamie Foxx, Common, Jay-Z, Brandy, and Nas, among others. Its production was notably more lush and elaborate than West's 2004 debut album The College Dropout, as he utilized intricate sampling methods and string orchestration with Brion. West's lyrics explore both personal and political themes, including poverty, drug trafficking, racism, healthcare, and the blood diamond trade.",
        "date": "08/30/2005"
      },
      {
        "type": "Album",
        "title": "Graduation",
        "content": "Graduation is the third studio album by American hip hop recording artist and record producer Kanye West. It was released on September 11, 2007, by Roc-A-Fella Records. Recording sessions for the album took place during 2005 to 2007 at Chung King Studios and Sony Music Studios in New York City and at Chalice Studios and The Record Plant in Los Angeles. It was primarily produced by West himself, with contributions from DJ Toomp, as well as Mike Dean, Nottz, Brian \"All Day\" Miller, Eric Hudson, Warryn Campbell, Gee Roberson, Plain Pat and Jon Brion. It features guest contributions from artists, including Mos Def, Dwele, T-Pain, Lil Wayne, DJ Premier and Chris Martin of Coldplay. The album's cover artwork was designed by Japanese contemporary artist Takashi Murakami.",
        "date": "09/11/2007"
      },
      {
        "type": "Album",
        "title": "808s & HeartBreak",
        "content": "808s & Heartbreak is the fourth studio album by American recording artist Kanye West, released on November 24, 2008, by Roc-A-Fella Records. It was recorded during September and October 2008 at Glenwood Studios in Burbank, California and Avex Recording Studio in Honolulu, Hawaii, with the help of producers No I.D., Jeff Bhasker and others.",
        "date": "11/24/2008"
      },
      {
        "type": "Album",
        "title": "My Beautiful Dark Twisted Fantasy",
        "content": "My Beautiful Dark Twisted Fantasy is the fifth studio album by American hip hop producer and rapper Kanye West, released on November 22, 2010, by Roc-A-Fella Records. Following a period of public and legal controversy, West retreated to a \"self-imposed exile\" in Hawaii in 2009. There, he worked on the album in a communal recording environment that involved numerous contributing musicians and producers. The album features guest appearances from Bon Iver, Jay Z, Pusha T, Rick Ross, Kid Cudi, Nicki Minaj, John Legend and more. Production is led by West himself, alongside a variety of high-profile record producers including Mike Dean, No I.D., Jeff Bhasker, RZA, S1, Bink and DJ Frank E. Noted by critics for its maximalist aesthetic, opulent production quality, and dichotomous themes, My Beautiful Dark Twisted Fantasy incorporates aspects of West's previous works, including soul, baroque, electro, and symphonic styles. The album deals with themes of excess and celebrity, and explores such issues as consumer culture, race, and the idealism of the American Dream.",
        "date": "11/22/2010"
      },
      {
        "type": "Album",
        "title": "Yeezus",
        "content": "Yeezus is the seventh studio album by American rapper Kanye West. It was released on June 18, 2013 by Def Jam Recordings. West gathered a number of artists and close collaborators for production on the album, including Mike Dean, Daft Punk, Noah Goldstein, Hudson Mohawke, Arca, Che Pope, Brodinski, Gesaffelstein and Travis Scott. Yeezus also features guest vocals from Justin Vernon, Chief Keef, Kid Cudi, Assassin, King L, Charlie Wilson and Frank Ocean. Fifteen days before its release date, West enlisted the help of producer Rick Rubin to strip down the record's sound in favor of a more minimalist approach.",
        "date": "06/18/2013"
      },
      {
        "type": "Album",
        "title": "The Life of Pablo",
        "content": "The Life of Pablo is the seventh studio album by American rapper Kanye West. It was released on February 14, 2016, by GOOD Music, Def Jam Recordings and Roc-A-Fella Records. Recording sessions took place from 2013 to 2016, in Italy, Mexico, Canada and the United States. Record production on the album was handled by West alongside a variety of producers such as Mike Dean, Noah Goldstein, Metro Boomin, Rick Rubin, Hudson Mohawke, and more. He also enlisted a wide array of guest vocalists, including Ty Dolla Sign, Desiigner, Kid Cudi, The-Dream, Chance the Rapper, Rihanna and Frank Ocean, among others. The album was preceded by the release of the promotional singles \"Facts\", \"Real Friends\", \"No More Parties in LA\", and \"30 Hours\" as part of West's GOOD Fridays giveaways.",
        "date": "02/14/2016"
      },
      {
        "type": "Album",
        "title": "Watch the Throne",
        "content": "Watch the Throne is a collaborative studio album by American rappers Jay-Z and Kanye West, released on August 8, 2011, by Roc-A-Fella Records, Roc Nation, and Def Jam Recordings. Before the album, Jay-Z and West had collaborated on their respective singles and with West as a producer on Jay-Z's work. As longtime friends, they originally sought out to record a five-song EP together, but the project eventually evolved into a full-length album. Recording sessions took place at various locations and began in November 2010. Production on the album was led by West himself, alongside a variety of high-profile record producers including Mike Dean, Swizz Beatz, Sak Pase, Jeff Bhasker, The Neptunes and Q-Tip.",
        "date": "08/08/2011"
      }
    ]
  },
  { "id": 2,
    "artistId": "2",
    "category": [
      {
        "type": "Bio",
        "title": "Birth",
        "content": "Pharrell Lanscilo Williams was born on April 5, 1973, in Virginia Beach, Virginia, the oldest of three sons of Pharaoh Williams, a handyman, and his wife Carolyn, a teacher. His roots extend for generations in Virginia and North Carolina, and one of his ancestors journeyed to West Africa in 1831, prompting other relatives to emigrate from America to Liberia in 1832. He met Chad Hugo in a seventh-grade summer band camp where Williams played the keyboards and drums and Hugo played tenor saxophone. They were also both members of a marching band; Williams played the snare drum while Hugo was drum major. Williams and Hugo attended Princess Anne High School where he played in the school band; there Pharrell got the name Skateboard P. Hugo attended Kempsville High School. In the MTV show When I Was 17, Pharrell stated that he was a nerd and often did things that stood out from most of his peers. In the early 1990s, Hugo and Williams formed a four-piece \"R&B-type\" group, the Neptunes, with friends Shay Haley and Mike Etheridge. They later entered a high school talent show where they were discovered by Teddy Riley, whose studio was next to Princess Anne High School. After graduating from high school, the group signed with Riley.",
        "date": "04/05/1973"
      },
      {
        "type": "Album",
        "title": "In Search Of...",
        "content": "In Search of... is the debut studio album by American funk rock band N.E.R.D. The group originally released the album on August 6, 2001 in Europe, where Kelis' Wanderland—produced by The Neptunes, consisting of N.E.R.D members Pharrell Williams and Chad Hugo—was better received. Similarly to Kelis' early work, the original version of In Search of... juxtaposes hip hop and rock influences and styles. The album is named after the TV series In Search of..., hosted by Leonard Nimoy. On March 12, 2002, In Search of... was re-released worldwide, with the largely electronic production backing of the album replaced by live backing provided by 1960s-style power pop band Spymob, giving the new version of the album a more rock-oriented sound. The skits and the intro from the original album were also dropped, significantly shortening the play length.",
        "date": "08/06/2001"
      },
      {
        "type": "Album",
        "title": "Fly or Die",
        "content": "Fly or Die is the second studio by American funk rock band N*E*R*D. It was released on March 23, 2004. The band recorded its second album Fly or Die during 2003. The band actually learned the instruments needed to play the tunes, so they could perform live. As Chad Hugo told MTV News on December 9, 2003, \"We're the ones playing the instruments live this time. I just started playing guitar last year so I'm learning as we go. Pharrell's playing drums. Last time, (on In Search of...) we didn't have time to learn certain instruments so we got Spymob to help us out.\"The band also recruited some assistance to record the album with Lenny Kravitz and Questlove playing on the track \"Maybe.\" Several of tracks concern issues of particular concern to adolescents including \"Thrasher\" about bullies, \"Drill Sergeant\" about rebellion and conscription, and first love on \"Backseat Love\".",
        "date": "08/06/2001"
      },
      {
        "type": "Album",
        "title": "Seeing Sounds",
        "content": "Seeing Sounds is the third studio album by American funk rock band N.E.R.D released June 10, 2008 on Star Trak Entertainment and Interscope Records in the United States. After ending their contract with Virgin Records in 2005, the band felt their previous album Fly or Die (2004) was too consistent. Using their own money, the band recorded the album in Florida and California. The album was produced solely by record production duo The Neptunes, consisting of Pharrell Williams and Chad Hugo, with additional assistance by rock band Spymob and was mainly written by Williams. The album's title, as well as its content, revolves around the neurological phenomenon of synesthesia, the mixing of sensory modalities. The album debuted at number seven on the U.S. Billboard 200 chart, selling 80,000 in its first week. It peaked in the top 20 in Australia, Canada, the Netherlands, Switzerland and the United Kingdom, while also charting in the several other countries. Upon its release, Seeing Sounds received generally mixed to positive reviews from most music critics. Some writers called the record N.E.R.D's best album to date and praised its production, while others negatively criticized Williams' singing and the album's lyrical content.",
        "date": "06/10/2008"
      },
      {
        "type": "Album",
        "title": "Nothing",
        "content": "Nothing is the fourth studio album by American funk rock band N.E.R.D, released November 2, 2010 on Star Trak Entertainment and Interscope Records in the United States. On October 17, 2010, the standard edition and the deluxe edition of the album became available for pre-order on iTunes.",
        "date": "11/02/2010"
      },
      {
        "type": "Album",
        "title": "In My Mind",
        "content": "In My Mind is the solo debut studio album by American recording artist and record producer Pharrell. It was released on July 25, 2006. It debuted at number 3 on the US Billboard 200 and sold 142,000 copies in its first week. It was also certified Silver in the United Kingdom for sales of over 60,000 copies.",
        "date": "07/25/2006"
      },
      {
        "type": "Album",
        "title": "G I R L",
        "content": "Girl (stylized as G I R L) is the second studio album by American recording artist and record producer Pharrell Williams. The album was released on March 3, 2014, through Williams' label i Am Other and Columbia Records. Girl was Williams' first studio album since his 2006 debut, In My Mind. It contains appearances by Justin Timberlake, Miley Cyrus, Daft Punk, JoJo and Alicia Keys.",
        "date": "03/03/2014"
      }
    ]
  },
  { "id": 3,
    "artistId": "3",
    "category": [
      {
        "type": "Bio",
        "title": "Birth",
        "content": "Scott Ramon Seguro Mescudi was born on January 30, 1984, in Cleveland, Ohio, and grew up in Shaker Heights and Solon. He is the youngest of four children, with two brothers, Domingo and Dean, and a sister, Maisha. His mother, Elsie Harriet (Banks), is a middle-school choir teacher at Roxboro Middle School in Cleveland Heights, Ohio. His father, Lindberg Styles Mescudi, was a house painter, substitute teacher and World War II Air Force veteran. His father was of African-American and Mexican-American descent, while his mother is African-American. When he was eleven years old, Cudi's father died of cancer; his passing had a significant effect on Cudi's personality and subsequently his music. Cudi attended Shaker Heights High School for two years before transferring to Solon High School. He was expelled from the school for threatening to punch his principal and would later earn his GED. Cudi studied film at the University of Toledo, dropping out after a year. His subsequent plan to join the U.S. Navy didn't pan out because of his juvenile police record.",
        "date": "01/30/1984"
      },
      {
        "type": "Album",
        "title": "Man on the Moon: The End of Day",
        "content": "Man on the Moon: The End of Day is the debut studio album by American hip hop recording artist Kid Cudi, released on September 15, 2009, by Dream On, GOOD Music and Universal Motown. A concept album, narrated by fellow American rapper Common, it follows the release of his first mixtape A Kid Named Cudi (2008). Production for the album took place during 2007 to 2009 and was handled by several record producers, including Cudi, Kanye West, Emile Haynie, Plain Pat, No I.D., Dot da Genius and Jeff Bhasker, among others.",
        "date": "09/15/2009"
      },
      {
        "type": "Album",
        "title": "Man on the Moon II: The Legend of Mr. Rager",
        "content": "Man on the Moon II: The Legend of Mr. Rager is the second studio album by American hip hop recording artist Kid Cudi. It was released on November 9, 2010, by GOOD Music and Universal Motown. The album was supported by two singles: \"Erase Me\" featuring Kanye West and \"Mr. Rager\". Man on the Moon II: The Legend of Mr. Rager debuted at number 3 on the US Billboard 200, selling 169,000 copies during its first week of release. The album received generally positive reviews from critics. On July 26, 2012, the album was certified Gold by the Recording Industry Association of America (RIAA), for shipments of 500,000 copies in the United States.",
        "date": "11/09/2010"
      },
      {
        "type": "Album",
        "title": "Indicud",
        "content": "Indicud is the third studio album by American hip hop recording artist Kid Cudi. The album was released on April 12, 2013, by Republic Records. It was the first album of Cudi's solo career to not be an installment of his Man on the Moon series. The album's cover artwork was designed by Kid Cudi himself, who also served as an executive producer of Indicud. It was Cudi's goal to make more uptempo and positive music with the album. He described it as a completely new format compared to his previous albums.",
        "date": "04/12/2013"
      },
      {
        "type": "Album",
        "title": "Satellite Flight: The Journey to Mother Moon",
        "content": "Satellite Flight: The Journey to Mother Moon (stylized as KiD CuDi presents SATELLITE FLIGHT: The Journey to Mother Moon) is the fourth studio album by American hip hop recording artist Kid Cudi. The album was issued on February 25, 2014, with only few hours' notice, was first released to digital retailers such as iTunes and Google Play, by Wicked Awesome Records and Republic Records.",
        "date": "02/25/2014"
      },
      {
        "type": "Album",
        "title": "Speedin' Bullet 2 Heaven",
        "content": "Speedin' Bullet 2 Heaven is the fifth studio album by American recording artist Kid Cudi. The album was released on December 4, 2015, through Republic Records and Cudi's Wicked Awesome Records imprint. The album is a complete departure from his previous projects, excluding WZRD, a 2012 collaborative effort which was his first venture into rock music. Inspired by the 1990's indie music scene, Cudi included commissioned skits featuring Mike Judge voicing the title characters of his 90's animated sitcom, Beavis and Butt-Head.",
        "date": "12/04/2015"
      },
      {
        "type": "Album",
        "title": "Passion, Pain & Demon Slayin'",
        "content": "Passion, Pain & Demon Slayin' is the sixth studio album by American recording artist Kid Cudi. The album was released on December 16, 2016 through Republic Records and Cudi's Wicked Awesome Records imprint. It succeeds Cudi's alternative rock album Speedin' Bullet 2 Heaven (2015). The album features production from Dot da Genius, Mike Dean, Mike Will Made It, Anthony Kilhoffer and Plain Pat, along with guest appearances from André Benjamin, Travis Scott, Pharrell Williams and Willow Smith. The album was preceded by the lead singles, \"Frequency\" and \"Surfin'\".",
        "date": "12/16/2016"
      }
    ]
  },
  { "id": 4,
    "artistId": "4",
    "category": [
      {
        "type": "Bio",
        "title": "Birth",
        "content": "Aubrey Drake Graham was born on October 24, 1986, known simply as Drake, is a Canadian rapper, singer, songwriter, record producer, and actor. Drake initially gained recognition as an actor on the teen drama television series Degrassi: The Next Generation in the early 2000s. Intent on pursuing a career as a rapper, he departed the series in 2007 following the release of his debut mixtape, Room for Improvement. He released two further independent projects, Comeback Season and So Far Gone, before signing to Lil Wayne's Young Money Entertainment in June 2009.",
        "date": "10/24/1986"
      },
      {
        "type": "Album",
        "title": "So Far Gone",
        "content": "So Far Gone is the debut extended play by Canadian hip hop recording artist Drake. It was released on September 15, 2009, by OVO, Young Money Entertainment, Cash Money Records and Universal Motown. This is his reissued project from his third mixtape that was released earlier on February 13, 2009. This EP features five tracks from the mixtape, with the inclusions of containing two new songs. The EP features guest appearances from Trey Songz, Lil Wayne, Bun B and Young Jeezy. The EP was supported by three singles: \"Best I Ever Had\", \"Successful\" featuring Trey Songz and Lil Wayne, and \"I'm Goin' In\" featuring . In April 2010, the EP won the Rap Recording of the Year at the 2010's Juno Awards.",
        "date": "09/15/2009"
      },
      {
        "type": "Album",
        "title": "Thank Me Later",
        "content": "Thank Me Later is the debut studio album by Canadian rapper Drake. It was released on June 15, 2010, by Aspire Music Group, Young Money Entertainment, Cash Money Records, and Universal Motown Records. Production for the album took place at various recording studios during 2009 to 2010 and was mostly produced by longtime collaborators Noah \"40\" Shebib and Boi-1da. It also featured contributions from Timbaland, Swizz Beatz, Nicki Minaj, Lil Wayne, The-Dream, and Kanye West, among others. Thank Me Later has a languorous, ambient production that incorporates moody synthesizers, sparse beats, obscured keyboards, minor keys, and subtle arrangements. Thematically, the album focuses on Drake's introduction to fame and his romances over the course of confessional, club-oriented, and sexual songs. Drake's emotionally transparent, self-deprecating lyrics are delivered in both rapped and subtly sung verses, and explore feelings of doubt, insecurity, and heartbreak.",
        "date": "06/15/2010"
      },
      {
        "type": "Album",
        "title": "Take Care",
        "content": "Take Care is the second studio album by Canadian hip hop recording artist Drake. It was released on November 15, 2011, by Young Money Entertainment, Cash Money Records and Republic Records. It serves as a follow-up to his debut album Thank Me Later (2010). Recording sessions took place from 2010 to 2011, with production that was primarily handled by frequent collaborator Noah \"40\" Shebib, alongside T-Minus, The Weeknd, Boi-1da, Just Blaze, Jamie xx and Drake himself, among others. For this album, the recording was more cohesive than Drake's debut album. While expanding the sonic aesthetic from his debut album, Take Care features an atmospheric sound that was characterized by a low-key musical elements and incorporates R&B, pop, electronica and post-dubstep styles. Drake's lyrics mostly eschew boastful raps for introspective lyrics that deals with topics such as failed romances, relationship with friends and family, growing wealth and fame, concerns about leading a hollow life, and despondency. The album was noted by music writers for its minimalist R&B elements, existential subject matter, conflicted lyrics, and Drake's alternately sung and rapped vocals. Labeling as one of the most anticipated music releases in 2011, Take Care has experienced some several delays to its release date and some subsequent online leakage, only nine days before its scheduled release.",
        "date": "11/15/2011"
      },
      {
        "type": "Album",
        "title": "Nothing Was the Same",
        "content": "Nothing Was the Same is the third studio album by Canadian recording artist Drake. It was released on September 24, 2013, by OVO Sound, Young Money Entertainment, Cash Money Records and Republic Records. Work on the record began in 2012 and continued through 2013. As its executive producer, Drake enlisted collaborators including 2 Chainz, Big Sean, Jay Z, Jhené Aiko and Sampha to appear as guest appearances on the album. The album's production was primarily handled by 40 and other OVO Sound producers; Boi-1da, Mike Zombie, Majid Jordan and Nineteen85, among others such as, Detail, Key Wane, Hudson Mohawke and Jake One.",
        "date": "09/24/2013"
      },
      {
        "type": "Album",
        "title": "Views",
        "content": "Views is the fourth studio album by Canadian rapper Drake. It was released on April 29, 2016, by Young Money Entertainment, Cash Money Records and Republic Records. Recording sessions took place between 2014 and 2016, with the production that was primarily handled by his longtime and frequent collaborator 40, alongside with each of these several producers, including Nineteen85, Maneesh Bidaye, Kanye West and Jordan Ullman, among others. The album was supported by the five singles: \"Hotline Bling\", \"One Dance\" featuring Wizkid and Kyla, \"Pop Style\" featuring The Throne, \"Controlla\" and \"Too Good\" featuring Rihanna. Views was met with lukewarm reviews from critics, many of whom found it to be an overlong retread of Drake's previous work. The album remained at number one on the US Billboard 200 for 13 non-consecutive weeks. \"One Dance\" became Drake's first Billboard Hot 100 number-one single as a lead artist, spending 10 weeks at number one. As of August 2016, the album has sold 1.4 million copies in the United States. Views became the first album to accumulate one-billion streams on Apple Music.",
        "date": "04/29/2016"
      },
      {
        "type": "Mixtape",
        "title": "If You're Reading This It's Too Late",
        "content": "If You're Reading This It's Too Late is the fourth mixtape by Canadian recording artist Drake. It was released through the iTunes Store without prior announcement on February 13, 2015, by Cash Money Records. The physical edition of the project was released by Cash Money Records; as well as Young Money Entertainment, OVO Sound and Republic Records. There is a debate upon whether this project is a mixtape or a studio album, as it was also released commercially through his record label, while Drake himself referred to the project as a mixtape.",
        "date": "02/13/2015"
      },
      {
        "type": "Mixtape",
        "title": "What a Time to Be Alive",
        "content": "What a Time to Be Alive is a collaborative mixtape by hip hop recording artists Drake and Future. It was released on September 20, 2015, by Young Money Entertainment, Cash Money Records, Epic Records, Republic Records, OVO Sound, and Freebandz. What a Time to Be Alive was supported by Drake and Future's previous collaboration on the single \"Where Ya At\". As friends, they originally planned to record a mixtape together earlier in the year, however, the project never fully materialized. However, during recording sessions for \"Where Ya At\", the duo began working on the project, beginning in July. The mixtape was extensively produced by Metro Boomin, as well as also being produced by Southside, Boi-1da, and 40, among others. It was released on the iTunes Store and Apple Music, and debuted at number one on the US Billboard 200.",
        "date": "09/20/2015"
      },
      {
        "type": "Mixtape",
        "title": "Room for Improvement",
        "content": "Room for Improvement is the first official mixtape from Canadian rapper Drake. It was self-released in 2006. The mixtape was originally intended for sale only and had sold 6,000 copies in 2006.",
        "date": "02/14/2006"
      },
      {
        "type": "Mixtape",
        "title": "Comeback Season",
        "content": "Comeback Season is the second official mixtape from Canadian rapper Drake. In 2007, Comeback Season spawned a single and a music video for \"Replacement Girl\", featuring Trey Songz, that was executive produced by Terral \"T. Slack\" of BPE. Also in 2007, Drake became the first unsigned Canadian rapper to have his music video featured on BET when his first single, \"Replacement Girl\", was featured as the \"New Joint of the Day\" on April 30, 2007.",
        "date": "09/01/2007"
      },
    ]
  },
  { "id": 5,
    "artistId": "5",
    "category": [
      {
        "type": "Bio",
        "title": "Birth",
        "content": "Tupac Amaru Shakur born Lesane Parish Crooks on June 16, 1971, also known by his stage names 2Pac and Makaveli, was an African-American rapper, record producer, and actor. As of 2007, Shakur has sold over 75 million records worldwide. His double disc albums All Eyez on Me and his Greatest Hits are among the best selling albums in the United States with All Eyez on Me selling 5,000,000 copies and Greatest Hits selling 5,100,000 copies. He has been listed and ranked as one of the greatest artists of all time by many magazines, including Rolling Stone which ranked him 86th on its list of The 100 Greatest Artists of All Time. He is consistently ranked as one of the greatest and most influential rappers of all time. Shakur began his career as a roadie, backup dancer, and MC for the alternative hip hop group Digital Underground, eventually branching off as a solo artist. The themes of most of Shakur's songs revolved around the violence and hardship in inner cities, racism, and other social problems. Both of his parents and several other people in his family were members of the Black Panther Party, whose ideals were reflected in his songs. During the latter part of his career, Shakur was a vocal participant during the East Coast–West Coast hip hop rivalry, becoming involved in conflicts with other rappers, producers, and record-label staff members, most notably The Notorious B.I.G. and the label Bad Boy Records.",
        "date": "06/16/1971"
      },
      {
        "type": "Album",
        "title": "2Pacalypse Now",
        "content": "2Pacalypse Now is the debut studio album by American rapper 2Pac. It was released on November 12, 1991, by Interscope Records and EastWest Records America. Less polished than it later proceed with his studio album, 2Pacalypse Now, which is 2Pac's commentary on contemporary social issues facing American society such as racism, police brutality, poverty, black on black crime, and teenage pregnancy, some issues giving a lyrical glimpse into the world of a young black man on the urban streets of the United States. It featured three singles; \"Brenda's Got a Baby\", \"Trapped\", and \"If My Homie Calls\".",
        "date": "11/12/1991"
      },
      {
        "type": "Album",
        "title": "Strictly 4 My N.I.G.G.A.Z...",
        "content": "Strictly 4 My N.I.G.G.A.Z... is the second studio album by rapper Tupac Shakur, released by T.N.T. Recordings/Interscope Records/EastWest Records America on February 16, 1993. The rights now belong to Amaru Entertainment. N.I.G.G.A.Z. in the title is an acronym for Never Ign'ant Getting Goals Accomplished; the \"Z\" in the title makes it a plural. Similar to his debut, 2Pacalypse Now, the album contains many tracks emphasizing 2Pac's political and social views. The original album was going to be named \"Troublesome 21\" and released in September '92, but it was scrapped. Debuting at number twenty-four on the Billboard 200, this album saw more commercial success than its predecessor, and there are many noticeable differences in production. While Tupac's first effort included a more underground or indie-rap-oriented sound, this album was considered his \"breakout\" album. It spawned the hits \"Keep Ya Head Up\" and \"I Get Around\" and has since reached double platinum status. On vinyl, Side A (tracks 1-8) was labeled the \"Black Side\" and Side B (tracks 9-16) the \"Dark Side\". The album features guest appearances from the group Live Squad, 2Pac's stepbrother The Wycked (later known as \"Mopreme\", later a member of 2Pac's groups Thug Life and The Outlawz), Ice-T, Ice Cube, Treach, Apache, Poppi, Deadly Threat, R&B singer Dave Hollister and Digital Underground. The album is now out of print.",
        "date": "02/16/1993"
      },
      {
        "type": "Album",
        "title": "Me Against the World",
        "content": "Me Against the World is the third studio album by American hip hop artist 2Pac. It was released March 14, 1995 on the Interscope Records label. It was his impending prison sentence, troubles with the police and Shakur being poor, which many believe might have contributed to Shakur's artistic reemergence on record, as his material is believed by Steve Huey of AllMusic to have become markedly more \"confessional\", \"reflective\", and \"soul-baring\". Me Against the World, released while Shakur was imprisoned, made an immediate impact on the charts, debuting at number one on the Billboard 200. This made Shakur the first artist to have an album debut at number one on Billboard 200 while serving time in prison. The album served as one of Shakur's most positively reviewed albums, with many calling it the magnum opus of his career, and is considered one of the greatest and most influential hip hop albums of all-time. Me Against the World won best rap album at the 1996 Soul Train Music Awards.",
        "date": "03/14/1995"
      },
      {
        "type": "Album",
        "title": "All Eyez on Me",
        "content": "All Eyez on Me is the fourth studio album by American rapper 2Pac, released on February 13, 1996 under Death Row Records and Interscope Records. The album is frequently recognized as one of the crowning achievements of 1990s rap music. The album featured the Billboard Hot 100 number one singles \"How Do U Want It\" and \"California Love\". It featured five singles in all, the most of any of Shakur's albums. Moreover, All Eyez On Me (which was the only Death Row release to be distributed through PolyGram by way of Island Records) made history as the first double-full-length hip-hop solo studio album released for mass consumption. It was issued on two compact discs and four LPs. All Eyez on Me was the second album from 2Pac to hit number-one on both the Billboard 200 and the Top R&B/Hip-Hop Albums charts, selling 566,000 copies in the first week. The album won the 1997 Soul Train R&B/Soul or Rap Album of the Year Award posthumously. Shakur also won the Award for Favorite Rap/Hip-Hop Artist at the 24th Annual American Music Awards and is also commonly referred to as one of the greatest hip hop/rap albums of all time. The album was certified Diamond by the RIAA on July 23, 2014, almost 18 years after Tupac's death.",
        "date": "02/13/1996"
      },
      {
        "type": "Album",
        "title": "The Don Killuminati: The 7 Day Theory",
        "content": "The Don Killuminati: The 7 Day Theory (commonly shortened to The 7 Day Theory or Don Killuminati and sometimes called Makaveli) is the fifth studio album by Tupac Shakur. Released under his new stage name Makaveli, it was his first studio album to be posthumously released. The album was completely finished in a total of seven days during the first week of August 1996. The lyrics were written and recorded in only three days and mixing took an additional four days. These are the last songs Shakur recorded before his fatal shooting on September 7, 1996. The album was originally scheduled for release in March 1997, but as a result of his death, producer Suge Knight released it four months earlier. George \"Papa G\" Pryce, Former Head of Publicity for Death Row, claimed that \"Makaveli which we did was a sort of tongue-in-cheek, and it was not ready to come out, [but] after Tupac was murdered, it did come out... Before that, it was going to be a sort of an underground.\"",
        "date": "11/05/1996"
      },
      {
        "type": "Album",
        "title": "R U Still Down? (Remember Me)",
        "content": "R U Still Down? (Remember Me) is the sixth studio album by 2Pac, released in 1997, and the first to be finished without his creative input. Her son having left a large body of work behind, this was the first release from his mother's imprint Amaru Entertainment, set up to control 2Pac's posthumous releases.",
        "date": "11/25/1997"
      },
      {
        "type": "Album",
        "title": "Until the End of Time",
        "content": "Until the End of Time is the seventh studio album and third posthumous album by the late rapper Tupac Shakur, following his previous posthumous albums R U Still Down? (Remember Me) and Still I Rise. The album consists of material recorded while the rapper was on Death Row Records toward the later end of 1996. A majority of the music compositions were remixed from their original state. Until the End of Time was very highly anticipated and ended up being one of the best selling hip hop albums of 2001.",
        "date": "03/27/2001"
      },
      {
        "type": "Album",
        "title": "Better Dayz",
        "content": "Better Dayz is the eighth studio album and fourth posthumous album by the late American rapper 2Pac, the third to be released without the artist's creative input and is the last to be a double-album. It was released on November 26, 2002, debuting at number 5 on the Billboard 200. This album is the second of two albums (The first being Until The End Of Time) that consists of a collection of previously unreleased material by way of remixed songs from Tupac's \"Makaveli\" period while signed to Death Row Records, and was produced by Johnny \"J\", Jazze Pha, Frank Nitty, and E.D.I. of Outlawz. It includes \"Military Minds\" which features Boot Camp Clik members Buckshot and Smif-n-Wessun (credited as Cocoa Brovaz) which was supposed to be part of a collaborative album between Shakur and BCC titled One Nation but was never officially released due to Shakur's death. Better Dayz has no censored references to Death Row Records unlike the previous album Until The End Of Time. The only track on the album pre-Death Row era is \"My Block (Remix)\", which was recorded in 1994-1995 during Shakur's time with Interscope Records, and which the original version can be found on The Show. It features 23 unreleased recordings from the 1994-1996 period, the majority of which are remixed. Others retain their original form or are complete finished mixes, such as \"Fuck 'Em All\", \"Late Night\", \"Ghetto Star\", \"Better Dayz\", \"Who Do U Believe In?\" and \"They Don't Give A Fuck About Us\". The album features appearances by Outlawz, Ron Isley, Nas, Mýa, Jazze Pha, Tyrese and among others. The hit single, \"Thugz Mansion,\" comes in two versions: an acoustic version featuring Nas, on which the music video is based, and a hip hop version featuring Anthony Hamilton.",
        "date": "11/26/2002"
      },
      {
        "type": "Album",
        "title": "Loyal to the Game",
        "content": "Loyal to the Game is the ninth studio album and fifth posthumous studio album by Tupac Shakur. It contains remixes of previously unreleased music recorded by Shakur before his death in 1996. Released in the United States on December 14, 2004 (December 12 in the United Kingdom), Loyal to the Game was produced by Eminem. According to an interview with MTV, Eminem was so moved by Tupac's life and work that he wrote a letter to Tupac's mother, Afeni Shakur, asking her to consider letting him produce the album. Shakur agreed, giving Eminem the go ahead. The album featured two singles- \"Thugs Get Lonely Too\" featuring Nate Dogg and \"Ghetto Gospel\".",
        "date": "12/12/2004"
      },
      {
        "type": "Album",
        "title": "Pac's Life",
        "content": "Pac's Life is the tenth and final studio album and sixth posthumous album by the late rapper 2Pac. The album was released on November 21, 2006, in the United States, on Amaru Entertainment. Its 2006 release date was designed to commemorate the tenth anniversary of his murder. A broad range of artists contributed to the album, including Outlawz, Krayzie Bone, Snoop Dogg, Chamillionaire, Ludacris, A-3, Big Syke, Papoose, Keyshia Cole, Jay Rock, Young Buck, Ashanti, T.I., Lil' Scrappy, three posthumous appearances by Kadafi, and Jamal Woolard, who became famous for portraying The Notorious B.I.G. in the 2009 biopic Notorious. The album features guest appearances from Ashanti and T.I., who appear on the title track \"Pac's Life.\" They also participated in the release of the single version of the song, which was filmed at the Tupac Amaru Shakur Center for the Arts. The World Premiere of \"Pac's Life\" was on at 7:30 PM on BET's Access Granted on Wednesday, November 22. The video featured on BET's behind the scenes of the filming of \"Pac's Life\". Krayzie Bone, appears on the album's first single, \"Untouchable\".",
        "date": "11/21/2006"
      },
      {
        "type": "Bio",
        "title": "Death",
        "content": "On the night of September 7, 1996, Shakur attended the Bruce Seldon vs. Mike Tyson boxing match with Suge Knight at the MGM Grand in Las Vegas, Nevada. After leaving the match, one of Knight's associates spotted Orlando \"Baby Lane\" Anderson, an alleged Crips gang member from Compton, California, in the MGM Grand lobby. Earlier that year, Anderson and a group of Crips had robbed a member of Death Row's entourage in a Foot Locker store. Knight's associate told Shakur, who attacked Anderson. Shakur's entourage, as well as Knight and his followers, assisted in assaulting Anderson. The fight was captured on the hotel's video surveillance. After the brawl, Shakur went with Knight to Death Row-owned Club 662 (now known as restaurant/club Seven). Shakur rode in Knight's 1996 black BMW 750iL sedan as part of a larger convoy, which included many in Shakur's entourage. At 11:00–11:05 p.m. (PDT), they were halted on Las Vegas Boulevard by Metro bicycle police for playing the car stereo too loudly and not having license plates, which were found in the trunk of Knight's car; the party was released a few minutes later without being ticketed. At 11:10 p.m. (PDT), while they were stopped at a red light at the intersection of Flamingo Road and Koval Lane in front of the Maxim Hotel, a vehicle occupied by two women pulled up on their left side. Shakur, who was standing up through the sunroof, exchanged words with the women and invited them to Club 662. At 11:15 p.m. (PDT), a white, four-door, late-model Cadillac with an unknown number of occupants pulled up to the sedan's right side, rolled down a window, and rapidly fired gunshots at Shakur. He was hit four times, twice in the chest, once in the arm, and once in the thigh. One of the bullets went into Shakur's right lung. Knight was hit in the head by fragmentation. The bodyguard, Frank Alexander, stated that, when he was about to ride along with the rapper in Knight's car, Shakur asked him to drive the car of Shakur's fiancée, Kidada Jones, instead, in case they needed additional vehicles for the drive from Club 662 to the hotel. The bodyguard reported in his documentary, Before I Wake, that, shortly after the assault, one of the convoy's cars drove off after the assailant but that he never heard from the occupants. After arriving at the scene, police and paramedics took Knight and a wounded Shakur to the University Medical Center of Southern Nevada. Chris Carroll, the first Las Vegas police officer to arrive on the scene, heard Shakur's last words, \"f**k you\". Carroll reports that he refused to say another word to him or another officer. According to an interview with the music video director Gobi, while at the hospital, Shakur received news from a Death Row marketing employee that the shooters had called the record company and threatened Shakur. Gobi informed the Las Vegas police but said that the police claimed to be understaffed. No attackers came. At the hospital, Shakur was heavily sedated, was placed on life-support machines, and was ultimately put under a barbiturate-induced coma after repeatedly trying to get out of the bed. While in the intensive-care unit, on the afternoon of Friday, September 13, 1996, Shakur died from internal bleeding; doctors attempted to revive him but could not stop the hemorrhaging. His mother, Afeni, made the decision to tell the doctors to stop. He was pronounced dead at 4:03 p.m. (PDT). The official causes of death were noted as respiratory failure and cardiopulmonary arrest in connection with multiple gunshot wounds. Shakur's body was cremated the next day. Some of his ashes were later mixed with marijuana and smoked by members of the Outlawz. However, E.D.I. Mean claimed in an interview in 2014 that, despite his belief at the time that the ashes were those of Shakur, he later found that the ashes did not belong to Shakur. His fifth album, The Don Killuminati: The 7 Day Theory was released two months later.",
        "date": "09/07/1996"
      },
      {
        "type": "Bio",
        "title": "Prison",
        "content": "Shakur began serving his prison sentence on sexual-assault charges at Clinton Correctional Facility on February 14, 1995. Shortly afterward, he released his multi-platinum album Me Against the World. Shakur became the first artist to have an album at number one on the Billboard 200 while serving a prison sentence. Me Against the World made its debut on the Billboard 200 and stayed at the top of the charts for four weeks. The album sold 240,000 copies in its first week, setting a record for highest first week sales for a solo male rap artist at the time. While serving his sentence, he married his long-time girlfriend, Keisha Morris, on April 4, 1995; the couple divorced in 1996. Shakur stated that he married her \"for the wrong reasons\". In an interview after his release, Shakur claimed to have only written one song during his sentence. While imprisoned, Shakur read many books by Niccolò Machiavelli, The Art of War by Sun Tzu, and other works about political philosophy and strategy. The works inspired his pseudonym \"Makaveli\" under which he released the album The Don Killuminati: The 7 Day Theory. The album presents a stark contrast to previous works. Throughout the album, Shakur continues to focus on the themes of pain and aggression, making this album one of the emotionally darker works of his career. While in prison, Shakur wrote to Death Row Uncut director Nina Bhadresher about his plans to begin a \"new chapter\" of his life. According to Kevin Powell, who spoke to Shakur following his release from prison, Shakur \"seemed like a completely transformed person.\" Powell recalled Shakur being more dark and menacing to the extent that Powell wondered whether he had really known Shakur.",
        "date": "02/14/1995"
      },
    ]
  },
  { "id": 6,
    "artistId": "6",
    "category": [
      {
        "type": "Bio",
        "title": "Birth",
        "content": "Shawn Corey Carter, born December 4, 1969, known professionally as Jay Z (formerly Jay-Z), is an American rapper, businessman and investor. He is one of the most financially successful hip hop artists in America. In 2014, Forbes estimated Jay Z's net worth at nearly $520 million. He is one of the world's best-selling artists of all time, having sold more than 100 million records, while receiving 21 Grammy Awards for his musical work, and numerous additional nominations. Consistently ranked as one of the greatest rappers ever, he was ranked number one by MTV in their list of The Greatest MCs of All-Time in 2006. Three of his albums, Reasonable Doubt (1996), The Blueprint (2001), and The Black Album (2003), are considered landmarks in the genre with all of them featured in Rolling Stone's list of the 500 greatest albums of all time. As a businessman and an investor, Jay Z co-owns the New York 40/40 Club sports bar, and is the co-creator of the clothing line Rocawear. He is the former president of Def Jam Recordings, co-founder of Roc-A-Fella Records, and the founder of the entertainment company Roc Nation. He also founded the sports agency Roc Nation Sports and is a certified NBA and MLB sports agent. As an artist, he holds the record for most number one albums by a solo artist on the Billboard 200 with 13. Jay Z also has had four number ones on the Billboard Hot 100, one as lead artist. On December 11, 2009, Jay Z was ranked as the tenth-most successful artist of the 2000s by Billboard as well as the fifth top solo male artist and fourth top rapper behind Eminem, Nelly, and 50 Cent. He was also ranked the 88th greatest artist of all time by Rolling Stone.",
        "date": "12/04/1969"
      },
      {
        "type": "Album",
        "title": "Reasonable Doubt",
        "content": "Reasonable Doubt is the debut studio album by American rapper Jay Z. It was released on June 25, 1996, by Roc-A-Fella Records and Priority Records. The album features production provided by DJ Premier, Ski, Knobody and Clark Kent, and also it includes guest appearances from Memphis Bleek, Mary J. Blige and The Notorious B.I.G., among others. The album features Mafioso rap themes and gritty lyrics about the \"hustler\" lifestyle and material obsessions. Reasonable Doubt debuted at number 23 on the US Billboard 200, on which it charted for 18 weeks. It was promoted with four singles; including \"Ain't No Nigga\" and \"Can't Knock the Hustle\". Reasonable Doubt was certified platinum by the Recording Industry Association of America (RIAA) and, as of 2006, has sold 1.5 million copies in the United States. A critical success, it has been ranked on several publications' lists of the greatest rap albums ever, while many hip hop fans have viewed it as Jay-Z's best work.",
        "date": "06/24/1996"
      },
      {
        "type": "Album",
        "title": "In My Lifetime, Vol. 1",
        "content": "In My Lifetime, Vol. 1 is the second studio album by American rapper Jay Z, released on November 4, 1997 by Roc-A-Fella Records. The album debuted at number 3 on the U.S. Billboard 200 chart and was certified platinum by the RIAA. The album features guest contributions by Lil' Kim, Foxy Brown, Babyface, Blackstreet, Teddy Riley, Too $hort, and Puff Daddy. Producers for Reasonable Doubt such as DJ Premier and Ski contribute to a limited number of beats on this album, though the majority of the production is handled by beatmakers from Puff Daddy's Bad Boy label, giving the album a generally glossier sound than its predecessor. It displayed a shift from the mafioso rap themes of his first effort to the so-called \"jiggy\" era of late 90's hip-hop, often credited to videos and albums from Puff Daddy and his Bad Boy record label's roster of artists including Notorious B.I.G. (the first two singles from his second album were both huge pop hits) and Mase.",
        "date": "11/04/1997"
      },
      {
        "type": "Album",
        "title": "Vol. 2... Hard Knock Life",
        "content": "Vol. 2... Hard Knock Life is the third studio album by American rapper Jay Z. It was released on September 29, 1998, by Roc-A-Fella Records. In the liner notes of the album, Jay-Z gives his thoughts on various tracks. The lyrics to the fast paced \"Nigga What, Nigga Who (Originator 99)\" are also included. Speaking in December 1998 to noted UK urban writer Pete Lewis of the award-winning Blues & Soul, Jay described the background to the album's lyrical themes: \"Primarily I see myself as so much more than a rapper. I really believe I'm the voice for a lot of people who don't have that microphone or who can't rap. So I wanted to represent and tell the story of everybody who's been through what I've been through, or knows somebody that has. I also wanted to speak about our lifestyle to people who - though they may live, say, in the suburbs and not be part of that world - still want to know about it and understand it.\"",
        "date": "09/29/1998"
      },
      {
        "type": "Album",
        "title": "Vol. 3... Life and Times of S. Carter",
        "content": "Vol. 3… Life and Times of S. Carter is the fourth studio album by American rapper Jay Z. It was released on December 28, 1999, by Roc-A-Fella Records. According to USA Today critic Steve Jones, the record marked a return to the street-oriented sound of Jay-Z's 1996 debut album, Reasonable Doubt. Vol. 3... featured production from Swizz Beatz, Timbaland, K-Rob, DJ Clue, Rockwilder, DJ Premier, and Irv Gotti, among others. The album was well received by critics and debuted at number one on the Billboard 200, selling 462,000 copies in its first week. It has since sold over three million copies and been certified triple platinum by the Recording Industry Association of America. In a contemporary review, Rolling Stone critic Kris Ex wrote that Jay-Z \"has become a better architect of songs\" while hailing Vol. 3... as \"his strongest album to date, with music that's filled with catchy hooks, rump-shaking beats and lyrics fueled by Jay's hustler's vigilance\". Richard Harrington from The Washington Post found the record to be \"full of reputation-building swagger, cataloguing of lyrical skills and autobiographical perspective\". Reviewing the album in Entertainment Weekly, Anthony DeCurtis said it reconnects with Jay-Z's urban demographic, \"with flair\", while Steve Jones of USA Today was particularly impressed by his lyrics and flow, finding both to be \"razor-sharp as ever\". In The Village Voice, Robert Christgau argued that Jay-Z has too much at stake commercially to depart from \"playing the now-a-rapper-now-a-thug 'reality' game with his customers, thugs and fantasists both\", but he impresses with \"a rugged, expansive vigor, nailing both come-fly-with-me cosmopolitanism and the hunger for excitement that's turned gangster hangouts into musical hotbeds from Buenos Aires to Kansas City\". Fellow Voice critic Miles Marshall Lewis called Jay-Z \"the best MC in hip hop\" and Vol. 3… \"the quintessential 2000-model hip hop album\". Soren Baker was less impressed in the Los Angeles Times, writing that the record lacks the \"biting humor and spectacular wordplay\" of his previous albums.",
        "date": "12/28/1999"
      },
      {
        "type": "Album",
        "title": "The Dynasty: Roc La Familia",
        "content": "The Dynasty: Roc La Familia is the fifth studio album released by American rapper Jay Z. Its lead single, \"I Just Wanna Love U (Give It 2 Me)\", produced by The Neptunes, was one of Jay-Z's most successful singles peaking at number 11 on the Billboard Hot 100. The album debuted at #1 on the Billboard 200 with 557,789 copies sold in its first week and more than 2.3 million copies sold to date. The album generally received positive reviews from music critics and the album ended up becoming the 20th highest selling R&B/Hip-Hop Album of the 2000–2010 decade according to Billboard. Originally a Roc-A-Fella Records compilation album, a showcase for Roc-A-Fella artists such as Memphis Bleek, Beanie Sigel, Amil and Freeway, which eventually became another Jay-Z solo album (or at least marketed as one to increase sales), although the Roc-A-Fella artists are abundant on this album. Big name guest appearances have been limited to three – Snoop Dogg, R. Kelly, and Scarface – to make room for the Roc-A-Fella family. Rather than using big-name producers such as Swizz Beatz and Timbaland, who had featured prominently on Vol. 2 and Vol. 3, Jay-Z had decided to feature more up-and-coming producers at the time of this album, such as Just Blaze, Kanye West, Bink! and The Neptunes. Partially as a result of this exposure, these producers would achieve notable success in the future. This was also the first album of Jay-Z's not to feature work by longtime producer DJ Premier. Given Just Blaze and Kanye West's penchant for utilizing soul samples in their beats, the album features a smoother sound than Jay-Z's previous efforts, though Bay Area-based producer Rick Rock includes a more minimalist sound in his four productions.",
        "date": "10/31/2000"
      },
      {
        "type": "Album",
        "title": "The Blueprint",
        "content": "The Blueprint is the sixth studio album by American rapper Jay-Z, released on September 11, 2001, on Roc-A-Fella Records in the United States. Its release was set a week earlier than initially planned in order to combat bootlegging. Recording sessions for the album took place during 2001 at Manhattan Center Studios and Baseline Studios in New York City. Contrasting the radio-friendly sound of Jay-Z's previous work, The Blueprint features soul-based sampling and production handled primarily by Kanye West, Just Blaze and Bink, as well as Timbaland, Trackmasters and Eminem, who also contributes the album's sole guest verse. At the time of the album's recording, Jay-Z was awaiting two criminal trials, one for gun possession and another for assault, and had become one of hip hop's most dissed artists, receiving insults from rappers such as Nas, Prodigy, and Jadakiss.[1][2] The album is also famous for both its producers Kanye West and Just Blaze's breakouts as major producers. Kanye West produced 5 of the 13 tracks on the album, including the songs \"Izzo (H.O.V.A.)\" and the controversial \"Takeover,\" which included diss lyrics aimed at rappers Nas and Prodigy, while Just Blaze produced 3 tracks, \"Girls, Girls, Girls\", \"Song Cry\", and \"U Don't Know\", also including the hidden bonus track \"Breathe Easy (Lyrical Exercise)\". Upon its release, The Blueprint received universal acclaim, with critics praising Jay-Z's lyricism and the production. It is considered one of Jay-Z's best albums and has also been labeled as one of the greatest hip-hop albums of all time.",
        "date": "09/11/2001"
      },
      {
        "type": "Album",
        "title": "The Blueprint 2: The Gift & The Curse",
        "content": "The Blueprint 2: The Gift & The Curse is the seventh studio album by American rapper Jay Z. It was released on November 12, 2002, by Roc-A-Fella Records and Def Jam Recordings. The album serves as a sequel to his sixth album The Blueprint (2001). Parts of the album were later reissued for his compilation album, titled Blueprint 2.1 (2003). Unlike this project than his other four previous albums, it debuted at number one, shipping with first-week sales of 545,000 units. As of February 2012, the album has sold 2,117,000 units in the United States.",
        "date": "11/12/2002"
      },
      {
        "type": "Album",
        "title": "The Black Album",
        "content": "The Black Album is the eighth studio album by American rapper Jay Z, released on November 14, 2003, by Roc-A-Fella Records. It was advertised as his final album before retiring, which is also a recurring theme throughout the songs, although Jay-Z resumed his recording career in 2006. For the album, Jay-Z wanted to enlist a different producer for each song, working with Just Blaze, Kanye West, The Neptunes, Timbaland, 9th Wonder and Rick Rubin, among others. When The Black Album was released, it received widespread acclaim from critics. In its first week, the album debuted at number one on the Billboard 200, selling 463,000 copies in the United States. It became Jay Z's top selling record of the 2000s decade, and by July 2013, it had sold 3,516,000 copies in the US. The Black Album was promoted with a retirement tour by Jay Z and three singles that also achieved Billboard chart success, including the top-ten hits \"Change Clothes\" and \"Dirt Off Your Shoulder\". Jay-Z said The Black Album would have a different producer for each track, and early magazine advertisements listed a series of numbers (representing tracks) and a producer for each number. Dr. Dre and DJ Premier were originally supposed to be among these producers; however, they did not make the final cut. The final album did feature a variety of producers, although Roc-A-Fella producers Kanye West and Just Blaze produced two tracks each, in addition to the two produced by frequent Jay-Z collaborators The Neptunes.",
        "date": "11/14/2003"
      },
      {
        "type": "Album",
        "title": "Kingdom Come",
        "content": "Kingdom Come is the ninth studio album by American rapper Jay-Z. It was released on November 21, 2006, by Roc-A-Fella Records. It was considered a \"comeback album\" for the rapper, as 2003's The Black Album was promoted as his final release. Kingdom Come received generally lukewarm reviews but was a commercial success, selling 680,000 copies in its first week, while earning Jay-Z a Grammy Award nomination for Best Rap Album. He has since considered it to be his worst album. Kingdom Come was the first Jay-Z album released since 2003's The Black Album, which had been widely hyped as Jay-Z's \"retirement\" album. The video for that album's hit single \"99 Problems\" had ended with Jay-Z going down in a hail of gunfire. Jay-Z stated in interviews that that scene represented the \"death\" of Jay-Z and the \"rebirth\" of Shawn Carter. Because of this, Jay-Z had originally planned to release Kingdom Come under his real name of Shawn Carter, but decided in the end to release it under his more-famous stage name Jay-Z. The album's second single, \"Lost One\" (produced by Dr. Dre) addresses Jay's split with Roc-A-Fella co-founder Damon Dash, the death of his nephew, and supposedly his relationship with singer Beyoncé. Past collaborators Kanye West and particularly Just Blaze made significant contributions to the album's production. This is the first time Dr. Dre has played a substantial role in a Jay-Z album, as he produced four beats and mixed every song on the album. Relatively unknown newcomers B-Money, Syience, and DJ Khalil also contributed to the album's production, as well as Coldplay lead singer Chris Martin. Kingdom Come's opening track \"The Prelude\" features additional vocals from Pain in da Ass who featured on some of Jay Z's earlier album introductions, impersonating characters from films such as Scarface, Goodfellas, and Carlito's Way.",
        "date": "11/21/2006"
      },
      {
        "type": "Album",
        "title": "American Gangster",
        "content": "American Gangster is the tenth studio album by American rapper Jay-Z. It was recorded as a concept album—inspired by the 2007 film of the same name—and was released on November 6, 2007, by Roc-A-Fella Records. The album features production from Diddy & The Hitmen, Just Blaze, and The Neptunes, among others. Guest appearances include Beanie Sigel, Lil Wayne, Pharrell and Nas. American Gangster was released to commercial success, despite being pulled from the iTunes Store at Jay-Z's request, at the time of its initial release. It debuted at number one on the Billboard 200 chart, selling 425,861 copies in its first week, while tying Elvis Presley for the second most American number-one albums. American Gangster received widespread critical acclaim and was viewed as a return to form for Jay-Z after the 2006 album Kingdom Come.",
        "date": "11/06/2007"
      },
      {
        "type": "Album",
        "title": "The Blueprint 3",
        "content": "The Blueprint 3 is the eleventh studio album by American rapper Jay-Z, released September 8, 2009, on Roc Nation, through distribution from Atlantic Records. It is the final installment in The Blueprint trilogy, preceded by The Blueprint (2001) and The Blueprint2: The Gift & The Curse (2002). Production for the album took place during 2008 to 2009 at several recording studios and was handled by Kanye West, No I.D., The Neptunes, Jeff Bhasker, Al Shux, Jerome \"J-Roc\" Harmon, The Inkredibles, Swizz Beatz, and Timbaland. This is the only album in the Blueprint trilogy, as well as the first album since Vol. 3... Life and Times of S. Carter (1999), not to feature production from Just Blaze. The album debuted at number one on the US Billboard 200 chart, selling 476,000 copies in its first week. It became Jay-Z's eleventh US number-one album, breaking the record he had previously shared with Elvis Presley, and produced five singles that achieved chart success. Upon its release, The Blueprint 3 received generally positive reviews from music critics.",
        "date": "09/08/2009"
      },
      {
        "type": "Album",
        "title": "Magna Carta Holy Grail",
        "content": "Magna Carta Holy Grail (alternatively written as Magna Carta... Holy Grail) is the twelfth studio album by American rapper Jay Z. It was made available for free digital download for Samsung customers via the Jay Z Magna Carta app on July 4, 2013. It was released for retail sale on July 8, 2013, by Roc-A-Fella and Roc Nation. The album features guest appearances by Justin Timberlake, Nas, Rick Ross, Frank Ocean and Beyoncé. Most of the album was produced by Timbaland and Jerome \"J-Roc\" Harmon, while other producers included Boi-1da, Mike Will Made It, Hit-Boy, Mike Dean, No I.D., The-Dream, Swizz Beatz, and Pharrell Williams among others. The album was promoted through various commercials presented by Samsung and was not preceded by any retail singles. Upon its release, Magna Carta Holy Grail was met with mixed reviews from music critics. Some complimented the album's production and composition, while others were disappointed with its overall theme and found many songs repetitive. On the day of its physical release in the United States, the album was certified Platinum by the Recording Industry Association of America (RIAA) for shipments of 1,000,000 copies. It debuted at number one on the US Billboard 200, selling 528,000 copies in its first week, making it Jay-Z's 13th consecutive studio album to top the chart. On September 2, 2013, it was announced that Magna Carta Holy Grail was certified double Platinum by the RIAA, for shipments of two million copies in the United States. The album was nominated in six categories at the 2014 Grammy Awards winning the Best Rap/Sung Collaboration trophy for \"Holy Grail\" featuring Justin Timberlake. The album spawned three successful singles, \"Holy Grail\", \"Tom Ford\" and \"Part II (On the Run)\" featuring Beyoncé. Multiple other songs on the album achieved chart success including, \"FuckWithMeYouKnowIGotIt\", \"Oceans\", \"Heaven\" and \"Picasso Baby\". Additionally, the album was supported by the concert tour, Magna Carter World Tour.",
        "date": "07/04/2013"
      },
      {
        "type": "Album",
        "title": "The Best of Both Worlds",
        "content": "The Best of Both Worlds is a 2002 collaborative album by R. Kelly and Jay Z. The album sold 285,000 in its opening week and debuted at #2 on the U.S. Billboard 200 albums chart. The album received poor reviews from music critics. The album went platinum in the US for selling more than a million copies.",
        "date": "03/26/2002"
      },
      {
        "type": "Album",
        "title": "Unfinished Business",
        "content": "Unfinished Business is the second collaboration album between R&B artist R. Kelly and rapper Jay Z and was released worldwide on October 26, 2004. It was distributed in the United States and Canada by Jive Records and Island Def Jam Music Group, by the Bertelsmann Music Group (BMG) and its subsidiary Jive Records, except in Canada and the United States of America where Island Def Jam Music Group and its labels Def Jam Recordings and Roc-A-Fella Records replaced BMG. The album was composed of unreleased tracks from the recording sessions of 2002's The Best of Both Worlds, although slight additions were made. Unfinished Business was promoted by the \"Best of Both Worlds\" concert tour with R. Kelly and Jay Z performing songs from both their solo and joint albums. Two singles, \"Big Chips\" and \"Don’t Let Me Die\", were sent to radio stations, but only the former saw a physical release. Unfinished Business debuted at number one on the U.S. Billboard 200 chart amid controversy & criticism. Like its predecessor, it was criticized for repetitive lyrics. The \"Best of Both Worlds\" tour filled with tension and accusations that boiled over at an October 31 show where R. Kelly was accused of erratic behavior and was pepper sprayed by a Jay Z associate. Jay Z and the tour promoter then banned R. Kelly from the tour claiming \"lack of professionalism\". R. Kelly responded by suing his co-act and touring company for $75 million for breach of contract, among other things, on November 2. Unfinished Business was certified Platinum by the Recording Industry Association of America (RIAA) on December 1 for selling more than 1,000,000 copies in the US.",
        "date": "10/26/2004"
      },
      {
        "type": "Album",
        "title": "Collision Course",
        "content": "Collision Course is a collaborative rap rock CD/DVD set from American rapper Jay-Z and nu metal band Linkin Park, released on November 30, 2004 by Roc-A-Fella, Machine Shop, Warner Bros. and Def Jam records. Before the album, Jay-Z had released collaborations with The Roots and R. Kelly, and Linkin Park had collaborated with various artists on their remix album Reanimation. The album was inspired by The Grey Album by Danger Mouse, which was a mash-up album between Jay-Z and The Beatles. MTV had originally planned on mashing up only one or two songs, but the project was eventually expanded to a six song EP. The album was mostly produced by Mike Shinoda and Jay-Z, and was recorded between July 16 and July 19. Upon release, Collision Course reached #1 on the Billboard 200. As of June 2014, it has sold 2 million copies in the United States alone. The album spawned one single, Numb/Encore which eventually won Best Rap/Sung Collaboration at the 2006 Grammy Awards.",
        "date": "11/30/2004"
      },
      {
        "type": "Album",
        "title": "Watch the Throne",
        "content": "Watch the Throne is a collaborative studio album by American rappers Jay-Z and Kanye West, released on August 8, 2011, by Roc-A-Fella Records, Roc Nation, and Def Jam Recordings. Before the album, Jay-Z and West had collaborated on their respective singles and with West as a producer on Jay-Z's work. As longtime friends, they originally sought out to record a five-song EP together, but the project eventually evolved into a full-length album. Recording sessions took place at various locations and began in November 2010. Production on the album was led by West himself, alongside a variety of high-profile record producers including Mike Dean, Swizz Beatz, Sak Pase, Jeff Bhasker, The Neptunes and Q-Tip. Expanding on the dense production style of West's 2010 album My Beautiful Dark Twisted Fantasy, Watch the Throne incorporates orchestral and progressive rock influences, unconventional samples, and dramatic melodies in its sound. Jay-Z and West's braggadocio lyrics exhibit themes of opulence, fame, materialism, power, and the burdens of success, as well as political and socioeconomic context. The album expresses other topics such as Jay-Z's thoughts on fatherhood, West's reflection on being deemed a social villain, and their legacy as performers. Music writers interpreted the subject matter to concern the rappers' plight as African Americans struggling with financial success in America. The album produced seven singles, including \"H•A•M\", \"Otis\", \"Lift Off\", \"No Church in the Wild\", and the Billboard Hot 100 top five \"Niggas in Paris\", which all received music videos. Jay-Z and West promoted the album with the Watch the Throne Tour that spanned October 2011 to June 2012 and became the highest grossing hip-hop concert tour in history. Watch the Throne debuted at number one on the US Billboard 200 chart, selling 436,000 copies its first week. While some critics found the album's lyrical content uninspiring, its production and the rappers' performances were highly praised. Many critics and publications placed the album in their year-end best-of lists. It also earned Jay-Z and West seven Grammy Award nominations. The album is certified platinum in the US.",
        "date": "08/08/2011"
      },
    ]
  },
  { "id": 7,
    "artistId": "7",
    "category": [
      {
        "type": "Bio",
        "title": "Birth",
        "content": "Kendrick Lamar Duckworth (born June 17, 1987), known professionally as Kendrick Lamar, is an American rapper and songwriter. He embarked on his musical career as a teenager under the stage name K-Dot, releasing a mixtape that garnered local attention and led to his signing with indie record label Top Dawg Entertainment (TDE). He began to gain major recognition in 2010, after his first retail release, Overly Dedicated. The following year, Lamar independently released his first studio album, Section.80, which included his debut single, \"HiiiPoWeR\". By that time, he had amassed a large Internet following and collaborated with several prominent artists in the hip hop industry, including The Game, Snoop Dogg, Busta Rhymes, and Lil Wayne. Lamar secured a major-label record deal with Aftermath and Interscope Records, in 2012. His major-label debut, good kid, m.A.A.d city, was released in October 2012 to critical success. The record contained the Top 40 singles \"Swimming Pools (Drank)\", \"Bitch, Don't Kill My Vibe\", and \"Poetic Justice\". It debuted at number two on the U.S. Billboard 200 chart and was later certified platinum by the Recording Industry Association of America (RIAA). Preceded by the Grammy Award-winning single \"i\", Lamar released his third album To Pimp a Butterfly, in 2015 to universal acclaim. The album drew on free jazz, funk, soul, and spoken word, and debuted atop the charts in the U.S. and the UK. It was nominated at the 58th Grammy Awards for Album of the Year and won Best Rap Album. In 2016, Lamar released untitled unmastered., a collection of unreleased demos that originated during the recording sessions for Butterfly. Lamar has received wide acclaim and a number of accolades over the course of his career, including seven Grammy Awards. In early 2013, MTV named Lamar the number one \"Hottest MC in the Game\", on their annual list. Time named Lamar one of the 100 most influential people in the world in 2016. Aside from his solo career, Lamar is also known as a member of the West Coast hip hop supergroup Black Hippy, alongside his TDE label-mates and fellow South Los Angeles-based rappers Ab-Soul, Jay Rock and Schoolboy Q.",
        "date": "06/17/1987"
      },
      {
        "type": "Mixtape",
        "title": "C4",
        "content": "In 2004, at the age of 16, Lamar released his first full-length project, a mixtape titled Youngest Head Nigga in Charge (Hub City Threat: Minor of the Year), under the pseudonym K-Dot. The mixtape was released under Konkrete Jungle Muzik and garnered local recognition for Lamar. The mixtape led to Lamar securing a recording contract with Top Dawg Entertainment (TDE), a newly founded indie record label, based in Carson, California. He began recording material with the label and subsequently released a 26 track mixtape two years later, titled Training Day (2005). Throughout 2006 and 2007, Lamar would appear alongside other up-and-coming West Coast rappers, such as Jay Rock and Ya Boy, as opening acts for veteran West Coast rapper The Game. Under the moniker K-Dot, Lamar was also featured on The Game's songs \"The Cypha\" and \"Cali Niggaz\". C4 is the third solo mixtape by American hip hop recording artist K-Dot. It was released in 2009 under Top Dawg Entertainment (TDE). The mixtape contains 17 tracks and includes guest appearances from Lamar's TDE label-mates Ab-Soul, Punch, Jay Rock and BO. The mixtape was heavily inspired by Lil Wayne’s 2008 album Tha Carter III, composed mostly of freestyles over instrumentals from Wayne’s album, in addition to a number of original tracks.",
        "date": "1/30/2009"
      },
      {
        "type": "Extended Play",
        "title": "The Kendrick Lamar EP",
        "content": "The Kendrick Lamar EP is the debut extended play (EP) by American hip hop recording artist Kendrick Lamar, released as a free digital download on December 31, 2009, by Top Dawg Entertainment (TDE). The EP features guest appearances from Angela McCluskey, Ab-Soul, JaVonte, Jay Rock, BJ the Chicago Kid, Punch, Schoolboy Q and Big Pooh. The EP's production was handled by Sounwave, Black Milk, Jake One, Q-Tip and Wyldfire, among others. The free-download EP premiered exclusively on online mixtape distribution platform DatPiff and has since then been downloaded over 100,000 times on the website earning a gold certification status.",
        "date": "12/31/2009"
      },
      {
        "type": "Mixtape",
        "title": "Overly Dedicated",
        "content": "Overly Dedicated (stylized O(verly) D(edicated) and often referred to as O.D.) is the fifth mixtape by American hip hop recording artist Kendrick Lamar, released on September 14, 2010, via Top Dawg Entertainment. The album features guest appearances from Dash Snow, Jhené Aiko, Schoolboy Q, Ab-Soul, Ash Riser, Dom Kennedy and Murs, among others. The album's production was handled by several TDE in-house producers, including King Blue, Sounwave, Tae Beast and Willie B; other producers such as Tommy Black, Drop, Jairus \"J-Mo\" Mozee, and Wyldfyer, also contributed production. As of October 2012, the mixtape has sold a total of 12,000 copies.",
        "date": "09/14/2010"
      },
      {
        "type": "Album",
        "title": "Section.80",
        "content": "Section.80 is the debut studio album by American rapper Kendrick Lamar. It was released on July 2, 2011, by Top Dawg Entertainment. The album features guest appearances from GLC, Colin Munroe, Ashtrobot, BJ the Chicago Kid, Schoolboy Q, Ab-Soul and vocals from late singer-songwriter Alori Joh. The production was mainly handled by Top Dawg in-house producers from production group Digi+Phonics, along with THC, Tommy Black, Wyldfyer, Terrace Martin and J. Cole. The concept album features lyrical themes delivered by Lamar such as racism and medication tolerance. The album's lead single, \"HiiiPoWeR\" was released on April 12, 2011. Section.80 received generally positive reviews from critics. The album debuted with 5,000 copies in the United States, based upon digital downloads within less than a week, debuting at number 113 on the Billboard 200, with minimal mainstream media promotion and coverage – however, some sources suggest the album entered at number 104. Within a two-week period, the album sold in total of 9,000 copies in the United States. As of February 2014, Section.80 has sold 130,000 copies domestically.",
        "date": "07/02/2011"
      },
      {
        "type": "Album",
        "title": "Good Kid, M.A.A.D City",
        "content": "Good Kid, M.A.A.D City (stylized as good kid, m.A.A.d city) is the second studio album by American rapper Kendrick Lamar. The album was released on October 22, 2012, by Top Dawg Entertainment, Aftermath Entertainment, and was distributed by Interscope Records. The album serves as Lamar's major label debut, after his signing to Aftermath and Interscope in early 2012. It was preceded by the release of Kendrick's debut studio album Section.80 (2011), released exclusively through the iTunes Store as an independent album. The album was recorded mostly at several studios in California, with producers such as Dr. Dre, Just Blaze, Pharrell Williams, Hit-Boy, Scoop DeVille, Jack Splash and T-Minus, among others, contributing to the album. Billed as a \"short film by Kendrick Lamar\" on the album cover, the concept album follows the story of Lamar's teenage experiences in the drug-infested streets and gang lifestyle of his native Compton. Good Kid, M.A.A.D City received widespread acclaim from critics, who praised its thematic scope and Lamar's lyrics. It earned Lamar four Grammy Award nominations at the 56th Grammy Awards, including Album of the Year. The album debuted at number two on the Billboard 200 chart, selling 242,000 copies in its first week – earning the highest first-week hip hop album sales of 2012 from a male artist, along with the best-selling debut from a male artist of the year. It became Lamar's first album to enter the UK Albums Chart, peaking at number 16, and entering the UK R&B Albums Chart at number two. The album was also named to many end-of-the-year lists, often topping them. It was later certified Platinum by the Recording Industry Association of America (RIAA) in August 2013. By March 2015, the album had sold 1,400,000 copies domestically, according to Nielsen SoundScan. The album's release was supported by five singles – \"The Recipe\" featuring Dr. Dre, \"Swimming Pools (Drank)\", \"Backseat Freestyle\", \"Poetic Justice\" featuring Drake, and \"Bitch, Don't Kill My Vibe\". All five singles received varied chart success. Lamar also went on a world tour between May and August 2013, featuring the other members of the hip hop collective, Black Hippy.",
        "date": "10/22/2012"
      },
      {
        "type": "Album",
        "title": "To Pimp a Butterfly",
        "content": "To Pimp a Butterfly is the third studio album by American rapper Kendrick Lamar. It was released on March 15, 2015, by Top Dawg Entertainment, Aftermath Entertainment and Interscope Records. The album was recorded in studios throughout the United States, with production from Sounwave, Terrace Martin, Taz \"Ti$a\" Arnold, Thundercat, Rahki, LoveDragon, Flying Lotus, Pharrell Williams, Boi-1da, and several other high-profile hip hop producers, as well as executive production from Dr. Dre and Anthony \"Top Dawg\" Tiffith. The album incorporates elements of free jazz, funk, soul, spoken word, and the avant-garde and explores a variety of political and personal themes concerning African-American culture, racial inequality, depression, and institutional discrimination. To Pimp a Butterfly debuted atop the Billboard 200 and received widespread acclaim from critics, who praised its musical scope and the social relevance of Lamar's lyrics. Additionally, it was ranked as the best album of 2015 by many publications, including Rolling Stone, Billboard and Pitchfork. It was nominated for Album of the Year and won Best Rap Album at the 58th Grammy Awards. Its singles \"i\" (in 2015) and \"Alright\" (in 2016) each won Grammys for Best Rap Song and Best Rap Performance, with the latter also nominated for Song of the Year. Additionally, \"These Walls\" won Best Rap/Sung Collaboration. The album was certified Platinum by the Recording Industry Association of America (RIAA). By March 2016, the album had sold 850,000 copies in the United States, and over 1 million copies worldwide. The album's release was supported by five singles – \"i\", \"The Blacker the Berry\", \"King Kunta\", \"Alright\" and \"These Walls\" featuring Bilal and Anna Wise. All five singles received varied chart success. Lamar also went on the Kunta's Groove Sessions Tour, which included eight shows in eight cities, in late 2015 to early 2016.",
        "date": "03/15/2015"
      },
      {
        "type": "Album",
        "title": "Untitled Unmastered",
        "content": "Untitled Unmastered (stylized as untitled unmastered.) is a compilation album by American hip hop recording artist Kendrick Lamar. It was released on March 4, 2016, by Top Dawg Entertainment, Aftermath Entertainment and Interscope Records. It consists of previously unreleased demos that originated during the recording of Lamar's album To Pimp a Butterfly (2015), continuing that work's exploration of politically-charged and psychological themes, as well as its experimentation with free jazz, soul, avant-garde, and funk styles. Upon its release, the compilation album received acclaim from music critics, and it debuted atop the US Billboard 200.",
        "date": "03/04/2016"
      },
    ]
  },
  { "id": 8,
    "artistId": "8",
    "category": [
      {
        "type": "Bio",
        "title": "Birth",
        "content": "Marshall Bruce Mathers III (born October 17, 1972), known professionally as Eminem (often stylized as EMINƎM), is an American rapper, record producer, and actor. Eminem is the best-selling artist of the 2000s in the United States. Throughout his career, he has had 10 number-one albums on the Billboard 200 and five number-one singles on the Billboard Hot 100. With US sales of 45.1 million albums and 42 million tracks as of June 2014, Eminem is the second best-selling male artist of the Nielsen SoundScan era, the sixth best-selling artist in the United States and the best-selling hip-hop artist. Globally, he has sold more than 172 million albums, thus being one of the world's best-selling artists. Rolling Stone ranked him 83rd on its list of 100 Greatest Artists of All Time, calling him the King of Hip Hop. After his debut album Infinite (1996), Eminem signed with Dr. Dre's Aftermath Entertainment and subsequently achieved mainstream popularity in 1999 with The Slim Shady LP, which earned him his first Grammy Award for Best Rap Album. His next two releases, 2000's The Marshall Mathers LP and 2002's The Eminem Show, were worldwide successes, with each being certified diamond in U.S. sales, and both winning Best Rap Album Grammy Awards—making Eminem the first artist to win the award for three consecutive LPs. They were followed by Encore in 2004, another critical and commercial success. Eminem went on hiatus after touring in 2005, releasing Relapse in 2009 and Recovery in 2010. Both won Grammy Awards and Recovery was the best-selling album of 2010 worldwide, the second time he had the international best-selling album of the year (after The Eminem Show). Eminem's eighth album, 2013's The Marshall Mathers LP 2, won two Grammy Awards, including Best Rap Album; it expanded his record for the most wins in that category and his Grammy total to 15. In addition to his solo career, Eminem is an original member of the midwest hip hop groups, Soul Intent and D12. He is also known for his collaborations with fellow Detroit-based rapper Royce da 5'9\"; the two are collectively known as Bad Meets Evil. Eminem has developed other ventures, including Shady Records, with manager Paul Rosenberg, which helped launch the careers of artists such as 50 Cent. Eminem has also established his own channel, Shade 45, on Sirius XM Radio. In November 2002, he starred in the hip hop film 8 Mile, which won the Academy Award for Best Original Song, for \"Lose Yourself\", becoming the first rap artist to win the award. Eminem has made cameo appearances in the films The Wash (2001), Funny People (2009), The Interview (2014) and the television series Entourage (2010).",
        "date": "10/17/1972"
      },
      {
        "type": "Album",
        "title": "Infinite",
        "content": "Infinite is the debut studio album by American rapper Eminem. It was released on November 12, 1996, by Web Entertainment. Recording sessions took place at the Bass Brothers' studio, known as the Bassmint Productions, with the production that was handled by Mr. Porter and Proof. The album features guest vocals from these fellow rappers Proof, Mr. Porter, Eye-Kyu, Three and Thyme; as well as singer Angela Workman on one track \"Searchin'\". The album failed to chart, and it only sold 1,000 copies, and is not available on any online music stores. Infinite initially received mixed reviews from critics, who praised its lyrical content, while criticizing the album's production. While Eminem's future albums would prove much more successful, the rapper's debut album has still gained some recognition and retrospective acclaim. On November 17th, 2016, 5 days after the 20th anniversary of the album, Eminem posted an official remaster of the first track \"Infinite\" to his Vevo channel, with the remix produced by the Bass Brothers.",
        "date": "11/12/1996"
      },
      {
        "type": "Album",
        "title": "The Slim Shady LP",
        "content": "The Slim Shady LP is the second studio album and the major-label debut by American rapper Eminem. It was released on February 23, 1999, under Interscope Records and Dr. Dre's Aftermath Entertainment. Recorded in Ferndale, Michigan following Eminem's recruitment by Dr. Dre and Jimmy Iovine, the album features production from Dr. Dre, the Bass Brothers, and Eminem himself. The majority of the record's lyrical content is written from the perspective of the rapper's alter ego Slim Shady, whom the rapper created on the Slim Shady EP (1997). The lyrics are noted for their over-the-top depictions of violence and heavy use of profanity. The album was met with both critical and commercial success; critics praised Eminem for his unique lyrical style, and the record debuted at number two on the US Billboard 200 chart behind TLC's FanMail with 283,000 copies sold in its opening week. The first official single, \"Just Don't Give a Fuck\", did not enter the \"Billboard\" Hot 100 but at least did enter the \"Bubbling Under\" Hot 100, peaking at number 14, which is equivalent to 114. The second official single, \"My Name Is\", peaked at number 36 on the Billboard Hot 100, becoming his first entry on that chart. The Slim Shady LP went on to be certified quadruple-platinum by the Recording Industry Association of America (RIAA). The album won a Grammy Award for Best Rap Album, and in 2012, the album was ranked number 275 on Rolling Stone Magazine's list of the 500 greatest albums of all time. The Slim Shady LP turned Eminem from an underground rapper into a high-profile celebrity. Interscope Records awarded him with his own record label, Shady Records, and he embarked on an extensive touring schedule to promote the album. In the summer of 1999, the rapper frequently performed on the Vans Warped Tour and in hip-hop clubs. He also became a highly controversial figure due to his lyrical content, which some perceived to be misogynistic and a negative influence on American youth.",
        "date": "02/23/1999"
      },
      {
        "type": "Album",
        "title": "The Marshall Mathers LP",
        "content": "The Marshall Mathers LP is the third studio album by American rapper Eminem. It was released on May 23, 2000, by Aftermath Entertainment, Interscope Records, and Eminem's newly founded label, Shady Records in the United States, and on September 11, 2000, by Polydor Records in the United Kingdom. The album was produced mostly by Dr. Dre and Eminem, along with The 45 King, the Bass Brothers, and Mel-Man. Released a year after Eminem's breakout album The Slim Shady LP, the record features more introspective lyricism including the rapper's response to his sudden rise to fame and controversy surrounding his lyrics. The album sold more than 1.76 million copies in the US in the first week alone, becoming the fastest-selling studio album by any solo artist in American music history. This record was later broken after 15 years following the release of the album 25 by Adele, which sold over 2.433 million albums within three days of release in November 2015. In 2001, the album won the Grammy Award for Best Rap Album and was nominated for Album of the Year. Eminem lost the latter to jazz-rock duo Steely Dan and their album Two Against Nature. The album was certified diamond by the Recording Industry Association of America in March 2011 for shipping 10 million copies in the United States. By May 2015, the album had sold over 11 million copies in the United States and more than 32 million copies worldwide. A sequel to the album, The Marshall Mathers LP 2, was released on November 5, 2013.",
        "date": "05/23/2000"
      },
      {
        "type": "Album",
        "title": "The Eminem Show",
        "content": "The Eminem Show is the fourth studio album by American rapper Eminem, released on May 21, 2002 by Aftermath Entertainment, Shady Records, and Interscope Records. The Eminem Show includes the commercially successful singles \"Without Me\", \"Cleanin' Out My Closet\", \"Superman\", and \"Sing for the Moment\". The Eminem Show reached number one in 19 countries, including Australia, Canada, the United Kingdom and the United States, and was the best-selling album of 2002 in the United States, with 7.6 million copies sold. Since its release in 2002 the album has sold 11,600,000 copies in the United States. At the 2003 Grammy Awards, it was nominated for Album of the Year and became Eminem's third record in four years to win the award for Best Rap Album. On March 7, 2011, the album was certified ten-times-platinum by the Recording Industry Association of America, making it Eminem's second album to receive a Diamond certification in the United States. Production for the album took place between 2001 and 2002. Eminem had started recording the album around the same time he was filming 8 Mile. Production was used for both the soundtrack of the movie and his album. The album also saw Eminem take a substantially more predominant production role; most of it was self-produced, with his longtime collaborator Jeff Bass co-producing several tracks (mainly the eventual singles), and playing a significant role in co-writing many of the tracks. Dr. Dre, in addition to being the album's executive producer, produced three individual tracks: \"Business\", \"Say What You Say\", and \"My Dad's Gone Crazy\". In an interview with The Face magazine in April 2002, Eminem said that he treated the album like it was a rock record, in terms of production, incorporating the use of guitars while still having elements of hip-hop. He said that he wanted to capture the '70s rock vibe, which he felt \"had this incredible feel\", for most of the record. He said that he \"tried to get the best of both worlds\" on the album.",
        "date": "05/21/2002"
      },
      {
        "type": "Album",
        "title": "Encore",
        "content": "Encore (stylized as ƎNCORE) is the fifth studio album by American rapper Eminem. It was released by Aftermath Entertainment, Shady Records, and Interscope Records. Its release was set for November 16, 2004, but was moved up to November 12 (coincidentally, exactly eight years to the day his debut album, Infinite, was released) after the album was leaked to the Internet. Encore sold 710,000 copies in its first three days, and went on to sell over 1.5 million copies in its first two weeks of release in the United States, certified quadruple-platinum that mid-December. Nine months after its release, worldwide sales of the album stood at 11 million copies. The album contains several lyrical themes, including Eminem's relationship with his ex-wife, Kim, (\"Puke\", and \"Love You More\"), their daughter Hailie Jade Mathers (\"Mockingbird\"), his childhood (\"Yellow Brick Road\"), his relationships with his parents (\"Evil Deeds\"), and opposition to then-American President George W. Bush (\"Mosh\" and \"We As Americans\") \"Just Lose It\" is a parody of Michael Jackson's \"Billie Jean\", as well as a Pepsi commercial in 1984. Similar to Eminem's previous album, The Eminem Show, Encore opens with a skit called \"Curtains Up\", indicative of the start of the show.",
        "date": "11/12/2004"
      },
      {
        "type": "Album",
        "title": "Relapse",
        "content": "Relapse is the sixth studio album by American rapper Eminem. The album was released on May 19, 2009, under Aftermath Entertainment, Shady Records, and Interscope Records. It was his first album of original material since Encore (2004), following a four-year hiatus from recording due to his writer's block and an addiction to prescription sleeping medication. Recording sessions for the album took place during 2005 to 2009 at several recording studios, and Dr. Dre, Mark Batson, and Eminem handled production. Conceptually, Relapse concerns the ending of his drug rehabilitation, rapping after a non-fictional relapse, and the return of his Slim Shady alter-ego. One of the most anticipated album releases of 2009, Relapse debuted at number one on the US Billboard 200 chart, selling 608,000 copies in its first week. It produced three singles that attained chart success and has been certified double platinum by the Recording Industry Association of America. The album received mixed reviews from most music critics, who were divided in their responses towards Eminem's lyrics. It has sold more than 2.3 million copies in the United States.",
        "date": "05/19/2009"
      },
      {
        "type": "Album",
        "title": "Recovery",
        "content": "Recovery is the seventh studio album by American rapper Eminem. It was released on June 18, 2010, by Aftermath Entertainment, Shady Records, and Interscope Records as the follow-up to Eminem's Relapse (2009). Originally planned to be released as Relapse 2, the album was renamed to Recovery when Eminem found the music of the new album different from its predecessor. Production of the album took place during 2009 to 2010 at several recording studios and was handled by various record producers, including Alex da Kid, Just Blaze, Boi-1da, Jim Jonsin, DJ Khalil, Mr. Porter, and Dr. Dre. Eminem also collaborated with artists such as Pink, Lil Wayne, Slaughterhouse and Rihanna for the album. Recovery featured more introspective and emotional content than its predecessor and the theme of the album revolved around his positive changes, anxiety, and emotional drives. To promote the album, he performed the album's songs live on televised shows, at award ceremonies, musical events and also headed The Recovery Tour. It spawned four singles; \"Not Afraid\", \"Love the Way You Lie\", \"No Love\", and \"Space Bound\", with the former two both reaching number one on the Billboard Hot 100. Recovery had earned Eminem American Music Awards, Billboard Music Awards, Detroit Music Awards and Grammy Awards. It was also nominated for Brit Awards, Juno Awards and MTV Video Music Awards Japan. Recovery went on to become the best selling album of 2010 in the US and worldwide. At the 2011 Grammys It was nominated for Album of the Year, Song of the Year and Record of the Year for the Album and the international chart topping single \"Love the Way You Lie\".",
        "date": "06/18/2010"
      },
      {
        "type": "Album",
        "title": "The Marshall Mathers LP 2",
        "content": "The Marshall Mathers LP 2 is the eighth studio album by American rapper Eminem. Aftermath Entertainment, Shady Records, and Interscope Records released the album on November 5, 2013. It serves as a sequel to The Marshall Mathers LP (2000). The album's production and its recording sessions were conducted from 2012 to 2013, involving Eminem himself, along with several record producers including Rick Rubin, Luis Resto, Emile Haynie, and Alex da Kid. The Marshall Mathers LP 2 features guest appearances from singers Skylar Grey, Rihanna, and Nate Ruess, and rapper Kendrick Lamar. The album title was revealed during the 2013 MTV Video Music Awards on August 25, 2013, alongside a preview of the lead single \"Berzerk\", which subsequently peaked at number 3 on the US Billboard Hot 100. It was followed by two more singles: \"Survival\" and \"Rap God\". The former debuted at number 17 on the Billboard Hot 100, and the latter debuted at number 7 and became certified triple platinum by Recording Industry Association of America (RIAA) in the United States. \"The Monster\" featuring Rihanna, was released as the album's fourth single on October 29, 2013. It went number one in several countries and was certified triple platinum in the United States. The album's fifth single, \"Headlights\" featuring Ruess, was released on February 5, 2014. The album received positive reviews from music critics, who praised Eminem's technical rapping abilities and production choices. The Marshall Mathers LP 2 marked an improvement in reception over some of Eminem's more recent albums, and was named on multiple \"Albums of the Year\" year-end lists. The album debuted at number one on the US Billboard 200 and was the second-best selling album sales of 2013. As of early 2014, the album has sold 3.8 million copies worldwide. The album won the Grammy Award for Best Rap Album at the 57th Grammy Awards.",
        "date": "11/15/2013"
      },
    ]
  },
  { "id": 9,
    "artistId": "9",
    "category": [
      {
        "type": "Bio",
        "title": "Birth",
        "content": "Nasir bin Olu Dara Jones (/nɑːˈsɪər/; born September 14, 1973), better known by his stage name Nas /ˈnɑːz/, is an American hip hop recording artist, record producer, actor and entrepreneur. The son of jazz musician Olu Dara, Nas has released eight consecutive platinum and multi-platinum albums and has sold over 25 million records worldwide. He is also an entrepreneur through his own record label; he serves as associate publisher of Mass Appeal magazine and is the owner of a Fila sneaker store. He is currently signed to Mass Appeal Records. His musical career began in 1991 as featured artist on Main Source's \"Live at the Barbeque\". His debut album Illmatic (1994) received universal acclaim from both critics and the hip hop community and is frequently ranked as one of the greatest hip hop albums of all time. Nas' follow-up It Was Written debuted at number one on the Billboard 200, stayed on top for four consecutive weeks, went double platinum in two months, and made Nas internationally known. From 2001 to 2005, Nas was involved in a highly publicized feud with rapper Jay Z. Nas signed to Def Jam in 2006. In 2010, he released Distant Relatives, a collaboration album with reggae artist Damian Marley, donating all royalties to charities active in Africa. His eleventh studio album, Life Is Good (2012) and was nominated for Best Rap Album at the 55th Annual Grammy Awards. Nas is often named as one of the greatest hip hop artists. MTV ranked him at number 5 on their list of \"The Greatest MCs of All Time\". In 2012, The Source ranked him number two on their list of the \"Top 50 Lyricists of All Time\". In 2013, Nas was ranked fourth on MTV's \"Hottest MCs in the Game\" list. About.com ranked him first on their list of the \"50 Greatest MCs of All Time\" in 2014, and a year later, Nas was featured on \"The 10 Best Rappers of All Time\" list by Billboard.",
        "date": "09/14/1973"
      },
      {
        "type": "Album",
        "title": "Illmatic",
        "content": "Illmatic is the debut studio album by American rapper Nas, released on April 19, 1994, by Columbia Records. After signing with the label with the help of MC Serch, Nas recorded the album in 1992–1993 at Chung King Studios, D&D Recording, Battery Studios, and Unique Recording Studios in New York City. Its production was handled by DJ Premier, Large Professor, Pete Rock, Q-Tip, L.E.S. and Nas himself. Styled as a hardcore hip hop album, Illmatic features multi-syllabic internal rhymes and inner-city narratives based on Nas's experiences in Queensbridge, New York. The album debuted at #12 on the U.S. Billboard 200 chart, selling 59,000 copies in its first week. However, its initial sales fell below expectations and its five singles failed to achieve significant chart success. Despite the album's low initial sales, Illmatic received rave reviews from most music critics, who praised its production and Nas' lyricism. On January 17, 1996, the album was certified Gold by the Recording Industry Association of America, and on December 11, 2001 it earned a Platinum certification after shipping one million copies in the United States. Since its initial reception, Illmatic has been recognized by writers and music critics as a landmark album in East Coast hip hop. Its influence on subsequent hip hop artists has been attributed to the album's production and Nas' lyricism. It also contributed to the revival of the New York City rap scene, introducing a number of stylistic trends to the region. The album is widely regarded as one of the greatest hip hop albums of all time, appearing on numerous best album lists by critics and publications.",
        "date": "04/19/1994"
      },
      {
        "type": "Album",
        "title": "It Was Written",
        "content": "It Was Written is the second studio album by American rapper Nas, released July 2, 1996 on Columbia Records in the United States. Following the moderate sales success of his acclaimed debut album, Illmatic (1994), Nas chose to focus his efforts in a more mainstream direction. Primarily produced by Trackmasters, it is a departure for him from the raw, underground tone of his debut album towards a more polished, mainstream sound. The album features mafioso and gangsta themes, and marks the first appearance of Nas's short-lived supergroup The Firm, which included rappers Foxy Brown, AZ, and Cormega. The album proved to be Nas’s most commercially successful release, debuting at number one on the US Billboard 200 chart. It also heralded Nas’s mainstream popularity and followed the success of other mafioso rap albums such as Only Built 4 Cuban Linx… (1995) and Reasonable Doubt (1996). However, his stylistic changes and increased mainstream success fostered accusations of selling out within the hip hop community. It has been viewed by music writers as one of Nas's best records and remains Nas' best-selling release, with over 4 million copies in the United States alone.",
        "date": "07/02/1996"
      },
      {
        "type": "Album",
        "title": "I Am...",
        "content": "I Am… is the third studio album by American rapper Nas, released April 6, 1999 on Columbia Records. Following the commercial and critical success of 1996's It Was Written, Nas put to work on a double album that merged the styles of his first two albums and detailed entire aspects of his life. But a majority of the material leaked onto the internet in MP3 format forced him to record new material for single-disc release. The album debuted at number 1 on the Billboard 200, selling over 470,000 copies in its first week. I Am… would later be certified Double Platinum in the United States, making this Nas' second best-selling release behind It Was Written. Upon its release, I Am... received generally positive reviews from music critics.",
        "date": "04/06/1999"
      },
      {
        "type": "Album",
        "title": "Nastradamus",
        "content": "Nastradamus is the fourth studio album by American rapper Nas, released November 23, 1999 on Columbia Records in the United States. It was originally scheduled to be released as a follow-up album composed of material from recording sessions for his third album, I Am... (1999) on October 26, 1999. Due to bootlegging of the material, Nas recorded separate songs for Nastradamus to meet its November release date. In 1998, Nas started recording his third album under the title I Am… with intentions to be a double-disc album. Due to bootleg, he cut out some songs and released it as a single disc in 1999. Months later, Columbia Records decided to release the left out material as a follow up album, however Nas decided to record all new material under the title Nastradamus. The album debuted at number 7 on the Billboard 200 chart, selling 232,000 copies in its first week. Upon its release, Nastradamus received generally mixed reviews from most music critics, and it has been regarded as Nas's weakest effort. Despite its mixed reception, it achieved considerable commercial success and spawned two charting singles. On December 22, 1999, the album was certified Platinum in sales by the Recording Industry Association of America (RIAA). This album includes one of the earliest shots fired in the soon-to-be epic Jay-Z/Nas feud. On \"What You Think of That\" Jay's protege Memphis Bleek says \"I'mma ball till I fall / What you think of that?\" On Nastradamus' title track, Nas raps \"You wanna ball till you fall? / I can help you with that / You want beef? / I could let a slug melt in your hat\".",
        "date": "11/23/1999"
      },
      {
        "type": "Album",
        "title": "Stillmatic",
        "content": "Stillmatic is the fifth studio album by American rapper Nas, released December 18, 2001 on Columbia Records in the United States. In contrast to his previous work's gangsta rap themes, it contains socially conscious and philosophical themes similar to those of his debut album, Illmatic (1994). Nas' lyrics address topics such as ghetto life, United States domestic and foreign policies, and his feud with rapper Jay-Z. Stillmatic served as a commercial and critical success that helped re-establish Nas' career, following a period of critical disappointment with the release of Nastradamus (1999). It debuted at number 8 on the United States Billboard 200 chart with sales of 342,600, eventually peaking at number 5 and selling over 2,026,000 copies in the United States. Upon its release, Stillmatic received generally positive reviews from most music critics.",
        "date": "12/18/2001"
      },
      {
        "type": "Album",
        "title": "God's Son",
        "content": "God's Son is the sixth studio album by American rapper Nas, released December 13, 2002 on his Columbia-imprint Ill Will Records. Production for the album took place during 2001 to 2002 and was handled by several hip hop producers, including Salaam Remi, Chucky Thompson, Ron Browz, and The Alchemist. Partly inspired by Nas's feud with Jay-Z and the death of his mother in early 2002, God's Son covers lyrical themes such as religion, violence, and his own emotional experiences. It has been recognized by music writers as a personal work by Nas. The album debuted at number 18 on the US Billboard 200 chart, selling 156,000 copies in its first week. It ultimately peaked at number 12 on the chart and produced three singles that achieved Billboard chart success. Upon its release, God's Son received critical acclaim, with critics praising Nas' lyricism and viewing it as a progression from his previous work. On January 14, 2003, the album was certified Platinum in sales by the Recording Industry Association of America (RIAA), following sales in excess of one million copies. Although guest appearances are made by Kelis, Alicia Keys, and others, God's Son is considered to be a personal album, in which he covers lyrical themes of his own emotional experiences The personal lyrics are a result of Nas' mother dying less than a year before the album's release. He dedicates \"Dance\" to his mother, and references her in \"Warrior Song\" and \"Last Real Nigga Alive.\" \"Dance\" is considered to be one of Nas' most introspective tracks, and has been described as \"a requiem for Nas' mother\" that \"is touching rather than mawkish.\" Nas' lyrics also deal with religion as the album's title conveys. He ponders the concept of heaven on \"Heaven\", and makes various biblical references to describe himself on \"The Cross\". Even with similar themes, each track is distinct from the rest providing God's Son with a \"narrative sense\". One noteworthy concept track is \"Book of Rhymes\" where Nas raps songs that he had written in his rhyme book years ago. At times, he stops rapping, and starts commenting on how bad some of his lyrics are amongst other things. According to one writer, \"The self-examination that inevitably accompanies the death of a loved one has also provoked a renewed sense of socio-political consciousness in Nas.\"",
        "date": "12/13/2002"
      },
      {
        "type": "Album",
        "title": "Street's Disciple",
        "content": "Street's Disciple is the seventh studio album by American rapper Nas, released on November 30, 2004, by Columbia Records. It was a double album titled after one of his lyrics from \"Live at the Barbeque\" (1991) by Main Source, which was the song marking his musical debut. The album's cover art was digitally created using photos of Nas to create an adaptation of The Last Supper. Street's Disciple was well received by most critics and debuted at number five on the Billboard 200, selling 232,000 copies in its first week. It was Nas's seventh consecutive platinum record in the U.S., having shipped one million copies. The lion's share of the album's production was handled between Salaam Remi, L.E.S. and Chucky Thompson of Sean Combs' production team The Hitmen. Remi contributed production on eleven tracks, L.E.S. produced on eight and Chucky Thompson helped on six. Salaam Remi (who collaborated with Nas on his previous LPs Stillmatic and God's Son) led all with nine solo productions. L.E.S. only produced three solo outings, but one included the single \"Just a Moment\". Thompson, on the other hand, had one solo production credit (\"Getting Married\"). Other notable producers from the album include A Tribe Called Quest member Q-Tip (who had last worked with Nas on Illmatic's \"One Love\") and D.I.T.C. producer Buckwild (\"These Are Our Heroes\"). Nas himself produced \"Suicide Bounce\" and \"U.B.R. (Unauthorized Biography of Rakim)\", both from the second disc. L.E.S. also brought on baggage for his productions. T. Black and Nut assisted the legendary producer on \"The Makings of a Perfect Bitch\" and Herb Middleton helped with the beat on \"Me &You (Dedicated to Destiny)\". Chucky Thompson, too, brought in extra help for \"Live Now\" (Barnardo \"Nardo\" Williams). Rapper Ill Bill made a song similar to \"U.B.R. (Unauthorized Biography Of Rakim)\" titled \"U.B.S. (Unauthorized Biography Of Slayer)\" on his album The Hour of Reprisal (2008).",
        "date": "11/30/2004"
      },
      {
        "type": "Album",
        "title": "Hip Hop is Dead",
        "content": "Hip Hop Is Dead is the eighth studio album by American rapper Nas, released December 19, 2006 on Def Jam Recordings. His first album for the label, it was co-financed by Nas's previous label, Columbia Records, which once distributed for Def Jam. The album's title was inspired by Nas's view of the music industry and the state of hip hop music at the time. The album debuted at number one on the U.S. Billboard 200 chart, selling 355,880 copies in its first week. His fourth U.S. number-one album, it had sold 764,000 copies by November 2008, eventually over time it went platinum by the RIAA. Upon its release, Hip Hop Is Dead received generally positive reviews from most music critics. Hip Hop Is Dead was nominated for a Grammy Award for Best Rap Album, ultimately losing to Kanye West's Graduation at the 50th Grammy Awards. In an interview on the music television show 106 & Park, while promoting his untitled 2008 album, Nas said that he chose \"Hip Hop Is Dead\" as the title of the album in order to engender excitement and a reaction among hip hop artists. He went on to say that it worked, due to reactions from artists like Lil Wayne and Kanye West (whether West was actually reacting to the title of the album or merely promoting the album is unclear, given that he produced on two of the album's tracks). The title had a major impact in the hip hop world, especially for Southern hip hop, whose artists have been blamed for cheapening the quality of hip-hop with crunk and snap music. Southern rapper Young Jeezy had made statements against the title of Nas' album, and also furthered his comments by questioning Nas' street credibility. They have since reconciled, with Nas appearing on Jeezy's 2008 single, \"My President\". Many other Southern rappers such as Ludacris, Trick Daddy, and Big Boi (whose fellow Outkast member, Andre 3000, declared hip hop dead on 2001's \"Funkin' Around\", off Big Boi and Dre Present...Outkast) have also attacked Nas' album title claiming that it is targeted at Southern hip hop. Nas also has a fair share of supporters such as fellow New York rappers KRS-One, DMX, Raekwon, and Ghostface Killah.",
        "date": "12/19/2006"
      },
      {
        "type": "Album",
        "title": "Untitled",
        "content": "The untitled ninth studio album by American rapper Nas was released by Def Jam Recordings and Columbia Records on July 15, 2008 in the United States, with earlier dates in some other countries. Its original title—Nigger—was changed due to controversy surrounding the racial epithet. The album is distinguished for its political content, diverse sources of production and provocative subject matter. The album debuted at number one on the US Billboard 200 chart, Nas' fifth to do so. It was certified gold by the Recording Industry Association of America (RIAA), for shipments of 500,000 copies in the United States. Upon its release, the album received generally positive reviews from music critics; it holds an aggregate score of 71/100 from Metacritic. The original title of the album, Nigger was mentioned by Nas several times, as well as on an October 12, 2007, performance at the Roseland Ballroom in New York City where he announced the title and release date. Def Jam made no comment on the title. This was similar to attempts to name his 2006 album, eventually titled Hip Hop Is Dead, to both Nigga and Hip Hop Is Dead... The N. On May 19, 2008, it was confirmed that Nas changed the name of the album to an untitled one (although on iTunes, the album is self-titled), stating that \"the people will always know what the real title of this album is and what to call it.\" The cover of the album shows the back of a shirtless Nas with flagellation scars forming the shape of the letter N, a reference to the racial slur and how slaves were tortured. Fort Greene, Brooklyn assemblyman Hakeem Jeffries requested New York's Comptroller Thomas DiNapoli to withdraw $84 million from the state pension fund that has been invested into Universal and its parent company, Vivendi, if the album's title was not changed. L.A. Reid, chairman of Def Jam at the time, confirmed that the label fully backed Nas and his decision on naming his album. The album's original title received support from Ice Cube, Jay-Z, Bishop Lamont, Alicia Keys, LL Cool J, Rev Run, Common, Akon, Method Man, Lupe Fiasco, David Banner, GZA, and Melle Mel. The title Nigger came under fire from 50 Cent, Will Smith, Al Sharpton, Bill O'Reilly, Oprah Winfrey, Reverend Jesse Jackson and the NAACP.",
        "date": "07/15/2008"
      },
      {
        "type": "Album",
        "title": "Life Is Good",
        "content": "Life Is Good is the eleventh studio album by American rapper Nas. It was recorded at various studios in New York and California, and produced primarily by No I.D. and Salaam Remi. Nas wrote the album after his divorce from recording artist Kelis and compared it to Marvin Gaye's 1978 record Here, My Dear. He wanted to vent personal feelings and address moments in his life in his songs, while drawing on 1980s hip hop influences for the album's production in order to complement its nostalgic tone. Life Is Good features personal subject matter, themes of adulthood and nostalgia, and reflections on Nas' personal life and experience in hip hop. His rapping is characterized by a relaxed, plainspoken flow, internal rhymes, and a tone that veers from malicious to nostalgic and introspective. The album's production incorporates orchestral elements and musical references to both contemporary and golden age hip hop, including boom bap beats and old school samples. When Life Is Good was released on July 13, 2012, by Def Jam Recordings, it received widespread critical acclaim and debuted at number one on the Billboard 200 in the United States. It also reached the top 10 of record charts in Canada, Switzerland, and the United Kingdom. It was promoted with three singles—\"Nasty\", \"The Don\", and \"Daughters\"—five music videos, and Nas' touring during June to December 2012. By February 10, 2013, Life Is Good had sold 354,000 copies, according to Nielsen SoundScan.",
        "date": "07/13/2012"
      },
      {
        "type": "Album",
        "title": "The Album",
        "content": "The Album is the only studio album by American hip hop supergroup The Firm. It was released on October 21, 1997 by Aftermath Entertainment and Interscope Records. The project was created by rapper Nas, his manager Steve Stoute and producers Dr. Dre and Trackmasters, who came up with the idea of forming a hip hop supergroup. The original line-up included Nas, AZ, Foxy Brown and Cormega who were all featured on the song \"Affirmative Action\" from Nas' album It Was Written (1996). However, Cormega later left the group due artistic differences between him and Nas, as well as contract disagreements with Stoute. He was replaced by Nature prior to recording of the album. The Album is a concept album that revolves around the themes of mafia and \"gangsta\" lifestyle. The songs on the album were mainly produced by Dr. Dre, Chris \"The Glove\" Taylor and Trackmasters (as Poke and Tone), and feature guest vocals from Pretty Boy, Wizard, Canibus, Dawn Robinson, Noriega and Half-a-Mill. The Album received mixed reviews from the music critics, who criticized its mainstream pop-oriented sound rather than the members' previous styles. In the United States, the album debuted at number one on the Billboard 200 and also topped the Top R&B/Hip-Hop Albums chart. It also charted in other countries, such as Canada, France and the United Kingdom. The Album sold 147,000 copies in the debut week and has sold over 925,000 copies in the United States and was certified gold in Canada. Two singles were release from the album, with \"Firm Biz\" peaking at number twelve on the Hot R&B/Hip-Hop Airplay and number eighteen on the UK Singles Chart. However, the album's second single \"Phone Tap\" failed to chart.",
        "date": "10/21/1997"
      },
      {
        "type": "Album",
        "title": "Distant Relatives",
        "content": "Distant Relatives is a collaborative studio album by American rapper Nas and Jamaican reggae artist Damian Marley, released May 18, 2010, on Universal Republic and Def Jam Recordings. Production for the album took place during 2008 to 2010 and was handled primarily by Damian Marley and Stephen Marley. Fusing musical elements of hip hop and reggae, Distant Relatives features lyrical themes concerning ancestry, poverty, and the plight of Africa. The album debuted at number five on the US Billboard 200 chart, selling 57,000 copies in its first week. Upon its release, Distant Relatives received positive reviews from most music critics. News of the album first came at the 2009 Grammy Awards, when Nas told MTV reporters \"Right now, I'll tell you first, I'm working on an album with Damian Marley. We tryin' to build some schools in Africa with this one, and trying to build empowerment. We're tryin' to show love and stuff with this album. So, the record's … all about really the 'hood and Africa also as well.\" The album title derives from Nas and Marley's relationship, their shared African ancestry, and the shared ancestry of the entire human race; which musically and lyrically inspired each recording. Leftover tracks from Nas and Marley's previous albums were originally planned for an EP based on Africa. After working together, the duo decided to record a full album together.",
        "date": "05/18/2010"
      },
    ]
  },
  { "id": 10,
    "artistId": "10",
    "category": [
      {
        "type": "Bio",
        "title": "Birth",
        "content": "Dwayne Michael Carter Jr. (born September 27, 1982), known professionally as Lil Wayne, is an American hip hop recording artist and author from New Orleans, Louisiana. In 1991, at the age of nine, Lil Wayne joined Cash Money Records as the youngest member of the label, and half of the duo The B.G.'z, alongside fellow New Orleans-based rapper Lil' Doogie. In 1996, Lil Wayne joined the southern hip hop group Hot Boys, with his Cash Money label-mates Juvenile, Young Turk and Lil' Doogie (who now goes by B.G.). Hot Boys debuted with Get It How U Live!, that same year. Most of the group's success came with their platinum-selling album Guerrilla Warfare (1999) and the 1999 single \"Bling Bling\". Along with being the flagship artist of Cash Money Records, Lil Wayne is also the Chief Executive Officer (CEO) of his own label imprint, Young Money Entertainment, which he founded in 2005. Lil Wayne's solo debut album Tha Block Is Hot (1999), was certified platinum by the Recording Industry Association of America (RIAA). His subsequent albums, Lights Out (2000) and 500 Degreez (2002), went on to be certified gold. Wayne reached higher popularity with his fourth album Tha Carter (2004), which was led by the single \"Go D.J.\" and his appearance on Destiny's Child's Top 10 single \"Soldier\", that same year. The album was followed by Tha Carter II (2005), as well as several mixtapes and collaborations throughout 2006 and 2007. Wayne gained more prominence with his sixth album Tha Carter III (2008), which became his most successful album to date, with first-week sales of over one million copies in the United States. The album won the Grammy Award for Best Rap Album and includes the hit singles \"Lollipop\", \"A Milli\" and \"Got Money\". Following the success of Tha Carter III, Wayne decided to record a rock-esque album titled Rebirth. The album, released in 2010, was certified gold by the RIAA, despite a generally negative critical response. In March 2010, Lil Wayne began serving an 8-month jail sentence in New York after being convicted of criminal possession of a weapon stemming from an incident in July 2007. Wayne's eighth album I Am Not a Human Being (2010), was released during his incarceration. His 2011 album and first following his release, Tha Carter IV, sold 964,000 copies in its first week of availability in the United States. It includes the singles \"6 Foot 7 Foot\", \"How to Love\" and \"She Will\". On September 27, 2012, Lil Wayne passed Elvis Presley as the male with the most entries on the Billboard Hot 100 chart, with 109 songs. Lil Wayne's thirteenth studio album, Tha Carter V has been delayed multiple times and has no scheduled release date. Lil Wayne has sold over 100 million records worldwide, including sold more than 15 million albums and 37 million digital tracks in United States, making him one of the best-selling artists of all time.",
        "date": "09/27/1982"
      },
      {
        "type": "Album",
        "title": "Tha Block Is Hot",
        "content": "Tha Block Is Hot is the debut studio album by American hip hop recording artist Lil Wayne; it was released on November 2, 1999, by Cash Money Records. Except the use of the word \"fuck\", the album is nearly free of explicit lyrics from Wayne himself, due to his mother's wishes. The most violent and sexual verses were done by Big Tymers and the other Hot Boys. The album debuted at number 3 on the US Billboard 200, selling 229,500 copies in its first week. In its second week, the album sold 117,000 copies in the United States. On December 10, 1999, the album was certified platinum by the Recording Industry Association of America (RIAA) for the shipments of one million copies in the United States. As of June 2012, the album sold over 1.4 million copies in the United States.",
        "date": "11/02/1999"
      },
      {
        "type": "Album",
        "title": "Lights Out",
        "content": "Lights Out is the second studio album by American rapper Lil Wayne. It was released on December 19, 2000, by Cash Money Records. The album debuted at number 16 on the US Billboard 200 chart, selling 116,000 copies its first week. On June 12, 2001, the album was certified gold by the Recording Industry Association of America (RIAA).",
        "date": "12/19/2000"
      },
      {
        "type": "Album",
        "title": "500 Degreez",
        "content": "500 Degreez is the third studio album by American rapper Lil Wayne. It was released on July 23, 2002, by Cash Money Records. The album's title was inspired by the album 400 Degreez (1998), by a fellow rapper Juvenile (who was his label mate). The album debuted at number 6 on the US Billboard 200, selling 103,000 copies in the first week. On September 3, 2002, the album was certified gold by the Recording Industry Association of America (RIAA). As of 2011, the album has sold 584,179 copies in the United States",
        "date": "07/23/2002"
      },
      {
        "type": "Album",
        "title": "Tha Carter",
        "content": "Tha Carter is the fourth studio album by American rapper Lil Wayne. It was released on June 29, 2004, by Cash Money Records and Universal Records.[6] The production on the album was mostly and frequently handled from the Cash Money's former in-house producer Mannie Fresh, before Mannie left the label. The title of the album was based on \"The Carter\", which is the empire crack house from the 1991 movie New Jack City, and his last name. The album debuted at number 5 on the Billboard 200, with first week sales of 116,000 copies in the United States. On September 7, 2004, the album was certified gold by the Recording Industry Association of America (RIAA) for sales of over 500,000 copies in the United States. As of November 2005, the album sold 878,000 copies in the United States.",
        "date": "06/29/2004"
      },
      {
        "type": "Album",
        "title": "Tha Carter II",
        "content": "Tha Carter II is the fifth studio album by American rapper Lil Wayne. It was released on December 6, 2005, by Cash Money Records and Universal Distribution. Recording sessions took place from 2004 to 2005, with Birdman and his brother Ronald \"Slim\" Williams serving as the records executive producers, while both of them enlisted the additional production on the Wayne's album such as The Runners and The Heatmakerz, among others. The album serves as a sequel to his fourth album Tha Carter (2004), and it incorporates the southern hip hop styles. The album was supported by three singles: \"Fireman\", \"Hustler Musik\" and \"Shooter\" featuring Robin Thicke. Upon its release, Tha Carter II received acclaim from music critics, who complimented its musical progression from his previous albums. Tha Carter II is widely considered by critics and fans to be one of Lil Wayne's best albums. The album debuted at number 2 on the US Billboard 200, with first week sales of over 254,001. To date, the album sold 1,400,050 copies in the United States.",
        "date": "12/06/2005"
      },
      {
        "type": "Album",
        "title": "Like Father, Like Son",
        "content": "Like Father, Like Son is a collaborative studio album by the American rappers Birdman and Lil Wayne. The album was released on October 31, 2006, through Cash Money Records and Universal Records. Guest appearances include Fat Joe, T-Pain, Rick Ross, Tha Dogg Pound and All Star Cashville Prince. Producers included Swizz Beatz and Scott Storch. The album's first single was \"Stuntin' Like My Daddy\". The second single released from the album was \"Leather So Soft\". The third single was \"You Ain't Know\". All of those singles have music videos. In February 2006, Birdman and Lil Wayne released a mixtape, The Carter 2 Part 2: Like Father Like Son, hosted by DJ Khaled to promote the album. The mixtape had leftover tracks from Lil Wayne's album Tha Carter II and early versions of tracks that would later end up on Like Father, Like Son. According to the Cash Money's website, and an aggressive street campaign in Houston, the album was initially scheduled for release on September 26, 2006 but delays pushed the release back to October 31, 2006. Like Father, Like Son debuted at number three on the Billboard 200 chart with 176,000 copies sold in its first week. Up to July 11, 2007, it had sold 761,958 copies in the United States. In an interview, Lil Wayne said that \"Army Gunz\" might be the fourth single from the album. However, the song has not been released. In January 2009, Birdman said in an interview that a movie based on the title of the album and starring him and Wayne would be released in June 2009, but it was never made.",
        "date": "10/31/2006"
      },
      {
        "type": "Album",
        "title": "Tha Carter III",
        "content": "Tha Carter III is the sixth studio album by American rapper Lil Wayne, released on June 10, 2008, by Cash Money and Universal Motown. It follows a long string of mixtape releases and guest appearances on other hip hop and R&B artists records, helping to increase his exposure in the mainstream. The album's cover art features a baby picture of Wayne and is similar to covers of hip hop albums such as Nas's Illmatic (1994) and Notorious B.I.G.'s Ready to Die (1994). Amid release delays and leaks, Tha Carter III became one of the most anticipated releases of 2008. The album debuted at number one on the U.S. Billboard 200 chart, selling 1,005,545 copies in its first week. It reached sales of 2.88 million copies by the end of 2008 and produced four singles that achieved chart success, including the international hit \"Lollipop\" and Billboard hits \"A Milli\", \"Got Money\", and \"Mrs. Officer\". Upon its release, Tha Carter III received universal acclaim from music critics and earned Lil Wayne several accolades, including a spot on Rolling Stone's list of the 500 Greatest Albums of All Time. It has been certified triple-platinum by the Recording Industry Association of America and has sold 3.6 million copies in the United States.",
        "date": "06/10/2008"
      },
      {
        "type": "Album",
        "title": "Rebirth",
        "content": "Rebirth is the seventh studio album by American rapper Lil Wayne, released February 2, 2010, on Cash Money Records, Young Money Entertainment and Universal Motown. The album's production was primarily handled by Cool & Dre, DJ Infamous, DJ Nasty & LVM, Kevin Rudolf, and J.U.S.T.I.C.E. League. Rebirth was promoted as Wayne's rock music debut, though it includes some hip hop tracks. The album debuted at number 2 on the US Billboard 200, selling 176,000 copies in its first week. The album became Wayne's seventh top-ten album in the United States and produced four singles, that which attained Billboard chart success. Upon its release, Rebirth received generally negative reviews from music critics. The album has been certified gold by the Recording Industry Association of America (RIAA), with domestic shipment of 500,000 copies in the United States.",
        "date": "02/02/2010"
      },
      {
        "type": "Album",
        "title": "I Am Not a Human Being",
        "content": "I Am Not a Human Being is the eighth studio album by American rapper Lil Wayne. It had a digital release on September 27, 2010 and on Compact Disc on October 12, 2010, by Young Money Entertainment, Cash Money Records, and Universal Motown. It was recorded prior to Wayne's eight-month prison term for criminal possession of a weapon. Production for the album was handled by Wayne and several record producers, including Boi-1da, Cool & Dre, Streetrunner, Noah \"40\" Shebib and DJ Infamous, among others. Upon its release, I Am Not a Human Being received generally favorable reviews from music critics, who drew comparisons to Wayne's earlier works. The album debuted at number two on the U.S. Billboard 200, based on its first-week digital sales alone. Following its physical release, it topped the chart, becoming Lil Wayne's second US number-one album and the first studio album since Tupac Shakur's Me Against the World in 1995 to reach the top slot on the Billboard 200 while its artist was jailed. Its lead single \"Right Above It\" became a top-ten hit in the United States. The album has been certified Platinum by the Recording Industry Association of America.",
        "date": "09/27/2010"
      },
      {
        "type": "Album",
        "title": "Tha Carter IV",
        "content": "Tha Carter IV is the ninth studio album by American rapper Lil Wayne, released on August 29, 2011 through Young Money Entertainment, Cash Money Records and Universal Republic Records. Recording sessions for the album began in late 2008, shortly after Lil Wayne's sixth studio album, Tha Carter III (2008) was released to strong sales and critical acclaim: however, the sessions were put on hold, as Lil Wayne claimed he did not want to follow an album he held in high regard so quickly with another, potentially inferior release. In the interim, Lil Wayne released his two other albums in 2010: the largely rock-themed Rebirth, and I Am Not a Human Being. The latter was reportedly composed from unreleased material from the original Tha Carter IV sessions, as the album was released whilst Wayne served a prison sentence at Rikers Island prison for illegal possession of a weapon, and was thus unable to record any new material: this also meant Tha Carter IV's recording sessions were once more put on hold. Following Wayne's release from prison, the album was re-recorded from scratch. The recording sessions resumed at various locations, involving several record producers including Bangladesh, Detail, T-Minus, Noah \"40\" Shebib, Polow da Don, Jim Jonsin, Kane Beatz, Boi-1da, Willy Will, Streetrunner, Cool & Dre, Young Ladd, The Smeezingtons, and Kanye West. The album's largely concerns the themes of sex, violence, drugs and crime, but also love, hurt and emotional conflict. Appearances on the album include Cory Gunz, Drake, T-Pain, Tech N9ne, Andre 3000, Rick Ross, John Legend, Bruno Mars, Birdman, Kevin Rudolf, Jadakiss, Bun B, Nas, Shyne, and Busta Rhymes. Following a heavily delayed release, Tha Carter IV was released to digital retailers at midnight on August 28, 2011, following Wayne's scheduled performance at the MTV Video Music Awards, and physical retailers received the album the following day. Tha Carter IV achieved first week sales of 964,000 copies in the United States and became Lil Wayne's second album to top the US Billboard 200 in its first week. The album received generally mixed reviews from music critics, who were divided in their responses towards the album's production and Wayne's own performances on the album: they felt it a disappointment compared to his previous work. The entire album according to Lil Wayne is an allegory of the negative aspects of the West.",
        "date": "08/29/2011"
      },
      {
        "type": "Album",
        "title": "I Am not a Human Being II",
        "content": "I Am Not a Human Being II is the tenth studio album by American rapper Lil Wayne. It was released on March 22, 2013, by Young Money Entertainment, Cash Money Records and Republic Records. Recording sessions took place during 2008 to 2012, with Lil Wayne serving as the records executive producers, alongside Ronald \"Slim\" Williams and Birdman, who enlisted a wide variety of record producers such as Cool & Dre, Mike Will Made It, David Banner, T-Minus, Diplo, Juicy J and StreetRunner, among others. The album serves as the sequel to I Am Not a Human Being (2010),[1] incorporating the elements of these hip hop styles. The album was supported by three singles: \"No Worries\" featuring Detail, \"Love Me\" featuring Drake and Future, and \"Rich As Fuck\" featuring 2 Chainz; the latter of which peaked at numbers 29, 9 and 38 respectively, on the US Billboard Hot 100. I Am Not a Human Being II was included as one of the multiples on \"Most Anticipated Albums of 2013\" lists. However, upon its release, the album received generally mixed reviews from music critics, who criticized its production and panned Wayne's lyrics. The album debuted at number 2 on the US Billboard 200, selling 217,000 copies in its first week. As of August 12, 2013, the album sold 529,000 copies in the United States. In August 2013, the album was certified gold by the Recording Industry Association of America (RIAA).",
        "date": "03/22/2013"
      },
      {
        "type": "Album",
        "title": "Free Weezy Album",
        "content": "Free Weezy Album (abbreviated as FWA) is the eleventh studio album by American hip hop recording artist Lil Wayne. It was released on July 4, 2015, by Young Money Entertainment and Republic Records, exclusively on TIDAL. On December 4, 2014, just five days before Lil Wayne's Tha Carter V was due to be released, Wayne issued a statement saying the album would not be released on its expected release date, due to his displeasure with Cash Money Records label-boss Birdman, not wanting to release the album although it had been completed. Wayne also expressed his feelings by stating he felt both he and his creativity were \"being held prisoner\". On January 20, 2015, Wayne self-released Sorry 4 the Wait 2, a mixtape to compensate for the continued delay of Tha Carter V. It is the sequel to 2011's Sorry 4 the Wait, which served for the same purpose during the delay of his ninth album, Tha Carter IV (2011). Upon Sorry for the Wait 2's release, it was noted Wayne disses Birdman and Cash Money Records, several times throughout the mixtape. On January 28, 2015, it was reported Wayne filed a $51 million lawsuit against Birdman and Cash Money Records over the delay of Tha Carter V.",
        "date": "07/04/2015"
      },
    ]
  },
  { "id": 11,
    "artistId": "11",
    "category": [
      {
        "type": "Bio",
        "title": "Birth",
        "content": "Jermaine Lamarr Cole (born January 28, 1985), better known by his stage name J. Cole, is an American recording artist and record producer. Raised in Fayetteville, North Carolina, Cole initially gained recognition as a rapper following the release of his debut mixtape, The Come Up, in early 2007. Intent on further pursuing a solo career as a rapper, he would go on to release two additional mixtapes after signing to Jay Z's Roc Nation imprint in 2009. Cole would release his debut studio album, Cole World: The Sideline Story, in 2011 to critical success. Cole World: The Sideline Story would debut at number one on the U.S. Billboard 200, and was soon certified platinum by the Recording Industry Association of America (RIAA). His next two releases, 2013's Born Sinner and 2014's 2014 Forest Hills Drive, received mostly positive reviews from critics, while being both certified platinum in the US. The latter earned him his first Grammy Award nomination for Best Rap Album. 2014 Forest Hills Drive was also the first rap album in over 25 years to gain platinum certification without any guest appearances or features. Self-taught on piano, Cole also acts as a producer alongside his hip hop career, producing singles for artists such as Kendrick Lamar and Janet Jackson, as well as handling the majority of the production in his own projects. He has also developed other ventures, including Dreamville Records, as well as non-profit organization, the Dreamville Foundation. The Dreamville Foundation isn't the only non-profit gesture Cole has put forth. In January 2015, Cole decided to house single mothers rent free in his childhood home, 2014 Forest Hill Drive, Fayetteville, North Carolina.",
        "date": "01/28/1985"
      },
      {
        "type": "Mixtape",
        "title": "Friday Night Lights",
        "content": "Friday Night Lights is the third official mixtape from Fayetteville, North Carolina rapper J. Cole. It was released on November 12, 2010. The mixtape was to originally be called Villematic and contain J. Cole's previous leaks and freestyles, however, J. Cole later stated it would have original material. The mixtape became the second most searched and trending topics on Google and Twitter respectively following its release. Most songs on the mixtape were slated to be on his debut album at one point or another. J. Cole's Friday Night Lights won Best Mixtape of the Year at the BET Hip Hop Awards 2011. The mixtape has been viewed over 2,530,000 times, streamed over 721,000 times, and downloaded over 1,000,000 times on mixtape site DatPiff. On June 26, 2013 J. Cole announced that he would be re-releasing The Warm Up and Friday Night Lights for retail sale, in order to give them the push they deserved. The original tracks on the mixtape were intended to be on J. Cole's debut album Cole World: The Sideline Story. However, because the label did not believe it would sell, Cole released the original songs with extra freestyles as a mixtape, but was forced to redo the entire album. \"In The Morning\" featuring Drake, was the only record from the mixtape to make the album cut.",
        "date": "11/12/2010"
      },
      {
        "type": "Mixtape",
        "title": "The Come Up",
        "content": "The Come Up is the first mixtape from North Carolina rapper J. Cole released on May 4, 2007, hosted by DJ OnPoint. The mixtape has been downloaded and streamed over 300,000 times, while being viewed over 1,274,000 times on mixtape site DatPiff. J. Cole self-produced 14 out of the 21 tracks on the mixtape, including his debut single, \"Simba\", which Cole shot his first music video for. The mixtape also features samples from Kanye West, Nas, Jay-Z, Ghostface Killah, and more, while including guest features from Deacon and Nervous Reck.",
        "date": "05/04/2007"
      },
      {
        "type": "Mixtape",
        "title": "The Warm Up",
        "content": "The Warm Up is the second official mixtape from Fayetteville, North Carolina rapper J. Cole. J. Cole and The R.E.C produced the majority of the mixtape with help from Elite, Syience, and E.k.n. The mixtape has been viewed over 1,927,000 times, streamed over 451,000 times, and downloaded over 550,000 times on DatPiff. J. Cole was famously signed to Roc Nation after Jay-Z heard the track \"Lights Please\" before the mixtape was released. In August 2010 J. Cole, was awarded the UMA Male Artist of the Year thanks to his heralded The Warm Up mixtape. He was awarded the first ever Sucker Free Summit Who's Got Next in 2010 because of the mixtape. On June 26, 2013 J. Cole announced that he would be re-releasing The Warm Up and Friday Night Lights for retail sale, in order to give them the push they deserved. In his review for MSN Music, music critic Robert Christgau gave the mixtape a two-star honorable mention, indicating a \"likable effort consumers attuned to its overriding aesthetic or individual vision may well enjoy.\" He cited \"World Is Empty\" and \"Get By\" as highlights and quipped, \"He's so talented you can hear how much he wants it, so talented you wince every time he shoots himself in the foot, e.g. 'Put some chains on my niggaz like I own slaves'\".",
        "date": "06/15/2009"
      },
      {
        "type": "Album",
        "title": "Cole World: The Sideline Story",
        "content": "Cole World: The Sideline Story is the debut studio album by American rapper J. Cole. The album was released on September 27, 2011 under Dreamville Records and Roc Nation with distribution from Sony Music. The album is his first studio release, following three successful mixtapes. Production was handled mainly by Cole himself, with some production from high-profile producer No I.D. It includes features from Trey Songz, Drake, Jay-Z, and Missy Elliott. The album debuted at number one on the US Billboard 200 chart, with 218,000 copies sold in the first week following its release. The album has since been certified Platinum by the Recording Industry Association of America (RIAA). As of September 2015, it has sold 772,000 copies in the United States. The album was one of the most anticipated releases of 2011 due to the sharp rise in Cole's popularity and mainstream fan base. Cole's lyrics perhaps most strikingly deal with issues such as abortion and the consequences of growing up in a fatherless household. However, these themes are incorporated alongside more introspective issues such as relationships, family problems, fame and attempting to be successful - an area which very much links in with the subtitle of the album 'The Sideline Story'. Upon its release, the album was generally well received by critics, who praised the wholesomeness of the album. On April 25, 2011, Vibe listed him at number five on their Vibe's list of Greatest Rappers Alive 30 Under 30. Cole was nominated for Best New Artist at the 2011 BET Awards. On May 3, 2011 J. Cole stated on Twitter, \"All singles done. Album ridiculous. Title Perfect. Music incredible. Thank you for your patience. Let's change the game.\" On June 21, 2011 Cole tweeted, \"Cole World: The Sideline Story\", the album's title. He then tweeted \"9/27,\" the release date. In June 2011 he announced that the recording of the album was finished, and that the release date is set for September later that year. J. Cole said several of the tracks are songs he held onto before he was signed. He said they were too good to give away on mix tapes. J. Cole stated that he had 16 tracks on the album, 12 of which he has produced himself. He also revealed that he would not release a pre-album mixtape like he previously stated. Instead, every Sunday until the album he released songs that did not make the album. The bundles of songs released are called Any Given Sundays. J. Cole has said that the reason for the subtitle \"The Sideline Story\" is because he feels since being signed to Jay-Z it has been like someone being on the sidelines for their favorite basketball team, and they're just waiting until the coach puts them in.",
        "date": "09/27/2011"
      },
      {
        "type": "Album",
        "title": "Born Sinner",
        "content": "Born Sinner is the second studio album by American hip hop recording artist J. Cole. It was released on June 18, 2013, by Dreamville Records, Roc Nation and Columbia Records. The album serves as the follow-up to his debut album, Cole World: The Sideline Story (2011). The album features guest appearances from Miguel, Amber Coffman, Jhené Aiko, James Fauntleroy, Bas, TLC, Kendrick Lamar and 50 Cent. The album was also primarily produced by Cole himself, along with others such as Jake One, Syience, Christian Rich and Elite. The album was supported by four official singles; \"Power Trip\", \"Crooked Smile\", \"Forbidden Fruit\" and \"She Knows\", along with the promotional single \"Miss America\". Born Sinner received generally positive reviews from critics. The album debuted at number two on the Billboard 200, selling 297,000 copies in its first week of release. After two weeks of being at number two, Born Sinner climbed to number one in its third week. The album has since been certified Platinum by the Recording Industry Association of America (RIAA). As of February 2016, the album has sold over 747,000 copies in the United States. Only a week after the release of his Gold certified-debut album Cole World: The Sideline Story, Cole began working on his second album, Born Sinner. He said that it allowed him to, \"reinvigorate himself both mentally and creatively.\" On October 24, 2011, during his interview with Hot 106's Rise & Grind morning show, Cole revealed that he had began working on his second studio album, with hopes of releasing it in June 2012. He had also stated that the album would consist of songs that failed to make his debut: \"I don't know how many, but I got songs that didn't make the last album that are automatically going to make this one.\" On February 24, 2012, J. Cole reached two million followers on Twitter, he celebrated by releasing the song \"Grew up Fast.\" On March 1, 2012, J. Cole returned to his hometown of Fayetteville, North Carolina. To celebrate his return, he released the song \"Visionz of Home\" (which launched an event, titled \"Dreamville weekend\") to inspire the youth of his hometown to achieve great things. On July 26, he returned to Twitter after a 100-day absence and went on to reveal and release his new song \"The Cure\" in where he hints at a new album. On October 20, he announced at a live show that his second album was complete and he would wait until after Kendrick Lamar released Good Kid, M.A.A.D City to reveal it and previewed two new songs, \"Maine On Fire\" and \"Crooked Smile.\" However they were not tied to any project. \"Maine on Fire\" would end up appearing on a Funkmaster Flex mixtape. On November 5, Cole revealed the title of his second album, and an album teaser for it, Born Sinner and the release date of January 28, 2013, via Ustream. With the title he ended his basketball-themed series of projects.",
        "date": "06/18/2013"
      },
      {
        "type": "Album",
        "title": "2014 Forest Hills Drive",
        "content": "2014 Forest Hills Drive is the third studio album by American hip hop recording artist J. Cole. It was released on December 9, 2014, by Dreamville Records, Roc Nation and Columbia Records. Recording sessions took place over the whole year, while the production on the album was primarily handled by Cole himself, along with several others such as Illmind, Vinylz, Phonix Beats and Willie B. It was announced three weeks before its release and had very little marketing, with no singles or promotion taking place prior to its release. The album was supported by four singles: \"Apparently\", \"Wet Dreamz\", \"No Role Modelz\" and \"Love Yourz\". 2014 Forest Hills Drive received generally positive reviews from critics who admired its ambitious concept, production and lyrics. The album debuted at number one on the Billboard 200, selling 353,000 copies in its first week. It was nominated for Best Rap Album at the 58th Grammy Awards. The album won Album of the Year at the 2015 BET Hip Hop Awards, and Top Rap Album at the 2015 Billboard Music Awards. The single \"Apparently\" was nominated for Best Rap Performance at the 58th Grammy Awards. As of September 2015, the album has sold 1 million copies in the United States. By doing so, J. Cole earned his first million-selling album in the country. The album was certified 2× Platinum by the Recording Industry Association of America (RIAA) in October 2016, with no features. The album's title is the name of an address from J. Cole's childhood home in Fayetteville, North Carolina, where he was living with his mother, his brother and his stepfather. In 2003, after Cole graduated from high school, the home was foreclosed on while J. Cole attended St. John's University in New York City. In 2014, the rapper re-bought the house, marking his first home purchase. It is where he wrote some of his earliest raps and became serious about pursuing a career as a musician.  The album, 2014 Forest Hills Drive recounts the story of Cole leaving North Carolina, and moving to New York City all in pursuit of his dreams; it battles with the transition that were taken in order to find his success and fame within the music industry. The majority of Cole's childhood involved him and his family frequently moving from place to place while their mother tried to make ends meet. Cole now plans on allowing a new family to move in to the house he once called home for an extremely cheap renting price, in the hope that they will find their feet in life like he once did.",
        "date": "12/09/2014"
      },
      {
        "type": "Extended Play",
        "title": "Truly Yours",
        "content": "Truly Yours and Truly Yours 2 are the first and second extended plays by American hip hop artist J. Cole. They were released digitally for free download and stream on February 12 and April 30 of 2013. The series consists of songs that Cole knew would not make the cutlist for Born Sinner. Truly Yours 2 features guest appearances from Young Jeezy, 2 Chainz and Bas. The free EP was released as a trilogy, with the third being released as the deluxe edition of Born Sinner. Both projects has over 500,000 downloads on mixtape site DatPiff.",
        "date": "02/12/2013"
      },
      {
        "type": "Extended Play",
        "title": "Truly Yours 2",
        "content": "Truly Yours and Truly Yours 2 are the first and second extended plays by American hip hop artist J. Cole. They were released digitally for free download and stream on February 12 and April 30 of 2013. The series consists of songs that Cole knew would not make the cutlist for Born Sinner. Truly Yours 2 features guest appearances from Young Jeezy, 2 Chainz and Bas. The free EP was released as a trilogy, with the third being released as the deluxe edition of Born Sinner. Both projects has over 500,000 downloads on mixtape site DatPiff.",
        "date": "04/30/2013"
      },
    ]
  },
  { "id": 12,
    "artistId": "12",
    "category": [
      {
        "type": "Bio",
        "title": "Birth",
        "content": "Lonnie Rashid Lynn, Jr. (born March 13, 1972), better known by his stage name Common (formerly Common Sense), is an American rapper, actor, film producer and poet from Chicago, Illinois. Common debuted in 1992 with the album Can I Borrow a Dollar? and maintained a significant underground following into the late 1990s, after which he gained notable mainstream success through his work with the Soulquarians. In 2011, Common launched Think Common Entertainment, his own record label imprint, and, in the past, has released music under various other labels such as Relativity, Geffen and GOOD Music, among others. Common's first major-label album, Like Water for Chocolate, received widespread critical acclaim and tremendous commercial success. His first Grammy Award was in 2003, winning Best R&B Song for \"Love of My Life\", with Erykah Badu. Its popularity was matched by May 2005's Be, which was nominated for Best Rap Album, at the 2006 Grammy Awards. Common was awarded his second Grammy for Best Rap Performance by a Duo or Group, for \"Southside\" (featuring Kanye West), from his July 2007 album Finding Forever. His best-of album, Thisisme Then: The Best of Common, was released on November 27, 2007. Common won the 2015 Golden Globe Award for Best Original Song and the 2015 Academy Award for Best Original Song, for his song \"Glory\" from the 2014 film Selma, in which he co-starred as Civil Rights Movement leader James Bevel. Common's acting career also includes starring significant roles in the films Smokin' Aces, Street Kings, American Gangster, Wanted, Terminator Salvation, Date Night, Just Wright, Happy Feet Two, New Year's Eve and Run All Night, Being Charlie. He also narrated the award-winning documentary Bouncing Cats, about one man's efforts to improve the lives of children in Uganda through hip-hop/b-boy culture. He starred as Elam Ferguson on the AMC western television series Hell on Wheels.",
        "date": "03/13/1972"
      },
      {
        "type": "Album",
        "title": "Can I Borrow a Dollar",
        "content": "Can I Borrow a Dollar? is the 1992 debut album by Chicago rapper Common (then known as Common Sense), released in the United States on October 6, 1992. The album was entirely produced by No I.D (then called Immenslope) and Twilite Tone, with addictional production by The Beatnuts. It contains guest vocals from Immenslope, Miss Jones and Common's then-girlfriend Rayshel. Entertainment Weekly's Neil Drumming described it as \"a clever but little-noticed first album\". In 1991, a feature was written about Common in the Unsigned Hype section of The Source. Relativity Records soon signed Common, and prepared to release three singles for his debut album. The first and best-charting single was 1992's \"Take It EZ\". It reached #5 on the Hot Rap Singles chart while his next two singles, \"Breaker 1/9\" and \"Soul by the Pound,\" reached #10 and #7 respectively. All of these singles combined to give Common a strong underground reputation prior to the album's release. Can I Borrow A Dollar? shows Common's early style of rapping; namely a sing-songy and inflection-heavy vocal delivery, as well as lyrics packed with word play and popular culture allusions. The album's production, utilizing samples, keyboards, and drum breaks prominently, tends to be minimalistic, jazzy and laid back. The Source called the production top notch. Although receiving a lukewarm reception, Stanton Swihart of Allmusic considers it to have put Chicago hip hop on the map and to be an underrated debut album.",
        "date": "10/06/1992"
      },
      {
        "type": "Album",
        "title": "Resurrection",
        "content": "Resurrection is the second album by American rapper Common (at the time, who was known as Common Sense). It was released on October 4, 1994, by Relativity Records. The album received critical acclaim, but not a significant amount of mainstream attention. Resurrection was entirely produced by No I.D. (who also produced the bulk of Can I Borrow A Dollar?). In 1994, the record was originally rated 3.5 mics in The Source. In 1998, the album was selected as one of The Source's 100 Best Rap Albums. The album is divided into two sections; the \"East Side of Stony\" (tracks 1-7) and \"West Side of Stony\" (tracks 8-15). Stony Island Avenue is a street that runs through the South Side of Chicago, where Common was raised. The closing track, \"Pop's Rap\" was the first of a series of tracks featuring spoken word and poetry by Common's father, Lonnie \"Pops\" Lynn, which Common has used to close several of his albums since. Interlaced throughout the album are short interludes which form a loose narrative concerning day-to-day life on the South Side. Songs such as \"Thisisme\", are full of self-assessing raps that reflect the rapper's personal growth since 1992's Can I Borrow A Dollar?. Likewise the crasser moments found on that LP, such as the misogynistic \"Heidi Hoe\" are greatly toned down for Resurrection, and replaced by thought-provoking narratives such as \"Chapter 13 (Rich Man Vs. Poor Man)\", and \"I Used to Love H.E.R.\" - a song that re-imagines Hip hop as a formerly unadulterated woman, led astray after being enticed by materialistic elements of life. The use of a conflicted woman as an allegory for Hip hop allowed Common to covertly express his disdain at the genre's turn towards gangsta rap inspired content, and what he saw as the resulting reorientation of rap artists. This song, which brought Common to the attention of fans and music critics alike, would also become the cause of a rift between the rapper and West Coast emcee Ice Cube, who took exception to the insinuation that the West Coast pioneered style of gangsta rap was detrimental to Hip hop - even going as far as to claim that Hip hop altogether \"started in the West\". Together with his Westside Connection compatriots, Cube hurled insults Common's way on the song \"Westside Slaughterhouse\" and throughout their album Bow Down, to which the rapper replied with the equally venomous \"The Bitch in Yoo\". In the aftermath of the murders of both Tupac Shakur and the Notorious B.I.G., the rivalry would be settled out of public view at a peacemaking function held by Louis Farrakhan at his home. The album is broken down track-by-track by Common in Brian Coleman's book Check the Technique.",
        "date": "10/04/1994"
      },
      {
        "type": "Album",
        "title": "One Day It'll All Make Sense",
        "content": "One Day It'll All Make Sense is the third studio album by rapper Common, released on September 30, 1997 on Relativity Records. It was the follow-up to his critically acclaimed album Resurrection and the last Common album to feature producer No I.D. until Common's 2011 album The Dreamer/The Believer. The album's recording was put on hold for up to a year as Common was busy becoming a father. After the birth of his child, Common returned to finish the album, albeit with a newer sense of responsibility, which he relates to his transformation from bachelor to father. He recorded \"Retrospect For Life\", with Lauryn Hill, as a dedication to his first child Omoye Assata Lynn. The song became the second single to be released from the album, and was accompanied by a video (directed by Lauryn Hill), as were \"Invocation\", \"Hungry\", and the album's first single \"Reminding Me (Of Sef)\" (a eulogy to a close, deceased friend of Common's). The album's cover is a picture of an 8-year-old Common with his mother, Dr. Ann Hines, at an airport in Montego Bay, Jamaica in 1980. The multi-talented Cee Lo Green, who at the time was still a member of Southern Hip hop group Goodie Mob, provides the vocals for the spiritual \"G.O.D.\" (which stands for \"Gaining One's Definition\"). Rapper Canibus makes an early career appearance on the track \"Making A Name For Ourselves\", as do veterans De La Soul on \"Gettin' Down At The Amphitheater\". Other guests include Black Thought, and Q-Tip on \"Stolen Moments\" Parts \"II\" and \"III\" respectively, and Common's future love interest Erykah Badu, on \"All Night Long\", which was produced by The Roots. Chicagoan poet Malik Yusef, waxes lyrical about his hometown on \"My City\", and as usual Common's father Lonnie Lynn closes the album out with some words of wisdom on \"Pop's Rap Part 2 / Fatherhood\".",
        "date": "09/30/1997"
      },
      {
        "type": "Album",
        "title": "Like Water for Chocolate",
        "content": "Like Water for Chocolate is the fourth studio album by American hip hop rapper Common, released March 28, 2000 on MCA Records. It was a considerable critical and commercial breakthrough for Common, receiving universal acclaim from major magazine publications and selling 70,000 copies in its first week. The album was certified Gold on August 11, 2000 by the Recording Industry Association of America. According to Nielsen SoundScan, the album has sold 748,000 copies by March 2005. The video for \"The Light\" was frequently shown on MTV, adding to Common's exposure. The album also formally marked the formation of the Soulquarians, a collective composed of ?uestlove (of The Roots), Jay Dee (formerly of Slum Village), keyboardist James Poyser, soul artist D'Angelo and bassist Pino Palladino, among numerous other collaborators. This group of musicians would also be featured on Common's next album, Electric Circus. The album's cover photo, 1956 Alabama by Gordon Parks, is a photo of a young black woman in Alabama, dressed for church, and drinking from a \"Colored Only\" drinking fountain.",
        "date": "03/28/2000"
      },
      {
        "type": "Album",
        "title": "Electric Circus",
        "content": "Electric Circus is the fifth studio album by rapper Common, released December 10, 2002 on the now-defunct MCA Records. The album was highly anticipated and praised by many critics for its ambitious vision. However, it was not as commercially successful as his previous album, Like Water for Chocolate, selling under 300,000 copies. An eclectic album, Electric Circus featured fusions of several genres such as hip hop, pop, rock, electronic, and neo soul. \"I wasn't feeling hip hop,\" the rapper remarked. \"So my motivation for that album were other genres of music, like Pink Floyd and Jimi Hendrix. It wasn't hip hop.\" This was Common's second and last album for MCA, and the label's final release prior to its absorption into Geffen Records.",
        "date": "12/10/2002"
      },
      {
        "type": "Album",
        "title": "Be",
        "content": "Be is the sixth studio album by American rapper Common, released May 24, 2005 on GOOD Music and Geffen Records. Primarily produced by hip hop artist Kanye West, the album debuted at number 2 on the Billboard 200 album chart with 185,000 copies sold in its first week. It is Common's second album to sell over 500,000 copies (over 800,000 copies sold) and was certified Gold by the RIAA. Be was also a critical success, receiving acclaim and accolades from several critics and music publications. The album received a perfect \"XXL\" rating from hip hop publication XXL. Be was touted as Common's comeback album after the commercially disastrous Electric Circus. His previous album lacked promotion following MCA Records's absorption under Geffen. His new alliance with Kanye West helped to spark public interest in the project, as the album was produced by West and released by his own label GOOD Music. \"I met Kanye in '96…\" he said. \"He was still in high school. He used to come around No I.D.'s house, a guy that used to produce for me. The thing I noticed about Kanye was that he could really rap! He had some kind of hunger that I hadn't really seen before.\" \"He's today's Marvin Gaye of rap,\" West enthused on a DVD accompanying a deluxe edition of Be. \"Buy the album. If you in a situation where you can barely buy groceries, burn the album.\"The results show that Common was clearly aware, and perhaps agreeing, with the negative criticisms about Electric Circus. In comparison to that album, Be is lean, immediate, and commanding, yet also restrained in its musical ambitions. Many[who?] believe it to be his safest album, although Brooklyn native rapper Israel The ILLa Real has stated that Be has influenced him in making his first album \"I Fell In Love With H.E.R.\" Of the reaction to the album, the rapper said: \"I don't think Electric Circus was as focused. Though I'd done some progressive hip-hop, people know me as the b-boy. When I showed them something different, a different style of b-boy, there were like, \"Hold up. You can be Afrocentric, but what's this rock shit that you're doing?\" Many of the beats created by West, and which Common rejected for the project, later appeared on West's studio album Late Registration.",
        "date": "05/24/2005"
      },
      {
        "type": "Album",
        "title": "Finding Forever",
        "content": "Finding Forever is the seventh studio album by Common, released on July 31, 2007 on GOOD Music and Geffen Records. Like Common's previous album, Be (2005), Finding Forever is primarily produced by Kanye West. The album debuted at the number one on the Billboard 200, selling 155,000 units in the first week, becoming Common's first chart-topper. Selling over 500,000 units in the US, it has been certified Gold. Finding Forever was nominated for a Grammy Award for Best Rap Album, losing to Kanye West's Graduation at the 50th Grammy Awards. Common explains that \"Finding Forever really means to find a place in music where you can exist forever. Music can be forever if you make it from the heart, if you make it from the soul and it’s good. And I look at music like Bob Marley's or Marvin Gaye's or Stevie Wonder's or A Tribe Called Quest's, that's forever music. And I’m continuing on the quest to make forever music.\" Common also says: \"And now with the death of J Dilla and other things, you start thinking about forever lasting for real through music [...] Jay Dee will last forever through his music and hopefully generations down the line will know about Common through his music. And it's also saying: I been doing this for a nice period of time, so I'm trying to find the place where I can keep existing in the game and make music I love.\"",
        "date": "07/31/2007"
      },
      {
        "type": "Album",
        "title": "Universal Mind Control",
        "content": "Universal Mind Control is Common's eighth studio album. Originally scheduled to be released on June 24, 2008 under the name Invincible Summer, the release date was pushed back to September 30, 2008 due to Common filming Wanted.[1] However, on September 10, 2008, it was announced that the title would be changed to Universal Mind Control and the release date was set for November 11, 2008. Later, the release was pushed back to December 9, 2008. The album's first single, titled \"Universal Mind Control\", was officially released on July 1, 2008 via the US iTunes Store as part of the Announcement EP (sold as \"Universal Mind Control-EP\" in the UK). The song features Pharrell. The Announcement EP included an additional track titled \"Announcement\". The video for \"Universal Mind Control\" was filmed in September by director Hype Williams. The album was sold for 79 points (roughly $.99) on Zune Marketplace to help promote the album. In 2010, the album was nominated for a Grammy Award for Best Rap Album but lost to the Eminem album Relapse.",
        "date": "06/24/2008"
      },
      {
        "type": "Album",
        "title": "The Dreamer/The Believer",
        "content": "The Dreamer/The Believer is the ninth studio album by American rapper Common. It was released on December 20, 2011, through Warner Bros. Records alongside Common's newly launched Think Common Music Inc.. Common's longtime friend and frequent collaborator No I.D., handled the album's production entirely himself. Recording sessions for the album began in 2009, and was originally due for a spring release, but was not completed because Common wanted to concentrate on acting. The album was scheduled for an April 2011 release, but was pushed back to late 2011. The first single was \"Ghetto Dreams\" featuring Nas. The music video was Directed by Matt Alonzo and Executive Produced by Leah Harmony. It was released on iTunes July 6, 2011. In preparation for the album's release, Common spoke with The BoomBox about how the LP was taking shape and that he and No I.D. were crafting the album in a more positive direction: \"It's going to be positive hip-hop. Hip-hop that can really generate good spirit, the spirit of the music and just good energy. I'm excited about the album 'The Dreamer, The Believer'. I feel blessed that I got to work with No I.D. I'm enthused to do hip-hop, which is something that I have to do when I feel it. It's the spirit and energy of hip-hop that made you just enjoy it and love the music and not feel like, 'Man, is this gonna sell?' or 'I sold this many.' It's stuff that made you feel something, it's stuff that you can use that inspired your life. I think about hip-hop like Brand Nubian and KRS-One and N.W.A and Rakim, that stuff inspired my life. Those things really shaped who I am.\" The Target Exclusive Edition comes with two additional tracks. The second single off the album was \"Blue Sky\" which was officially made available on iTunes October 7, 2011. The song samples \"Mr. Blue Sky\" by Electric Light Orchestra.",
        "date": "12/20/2011"
      },
      {
        "type": "Album",
        "title": "Nobody's Smiling",
        "content": "Nobody's Smiling is the tenth studio album by American hip hop recording artist Common. It was released on July 22, 2014, by Def Jam Recordings and No I.D.'s label ARTium Records. Following the release of his 2011's album The Dreamer/The Believer, Common took a hiatus from musical endeavors. In 2013, he returned to the studio and began working his tenth album and later revealed that the production, much like his previous effort, would be handled entirely by his longtime collaborator and record producer No I.D.. In 2014, Common signed a recording contract with No I.D.'s ARTium Records, through Def Jam Recordings, for the distribution of the album. The title and concept of the album was inspired by the violence and high crime rate in Common's hometown of Chicago, Illinois. The album features guest appearances from Lil Herb, Big Sean, Jhené Aiko, Snoh Aalegra, Dreezy, Elijah Blake, Vince Staples and Cocaine 80s. The album was supported by three singles: \"Kingdom\" featuring Vince Staples, \"Speak My Piece\" and \"Diamonds\" featuring Big Sean.",
        "date": "07/22/2014"
      },
      {
        "type": "Album",
        "title": "Black America Again",
        "content": "Black America Again is the eleventh studio album by American hip hop recording artist Common. It was released on November 4, 2016, by ARTium Recordings and Def Jam Recordings. The album was supported by two singles: \"Love Star\" featuring Marsha Ambrosius and PJ, and \"Black America Again\" featuring Stevie Wonder. The album's first single, called \"Love Star\" was released on September 2, 2016. The song features guest vocals from musicians Marsha Ambrosius and PJ, with the production that was provided by Karriem Riggins. The album's second single, called \"Black America Again\" was released on September 23, 2016. The song features guest vocals from American R&B legend Stevie Wonder, with Karriem Riggins, who also produced this track, alongside with Robert Glasper. On November 14, 2016, Common shared the remix of \"Black America Again\" which features Gucci Mane, Pusha T and BJ the Chicago Kid.",
        "date": "11/04/2016"
      },
    ]
  },
]


  
